Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: If you don't see the bug icon, go to the plugin manager and activate the debugger.
es: Si no ve el icono del error, vaya al gestor de plugins y active el depurador.
fr_fr: Si vous ne voyez pas l'icône de bogue, allez dans le gestionnaire de plugins et activez le débogueur.
it: Se non vedi l'icona del bug, vai nel gestore dei plugin e attiva il debugger.
zh_cn: 如果您没有看到错误图标，请转到插件管理器并激活调试器。

source: You can start a debug session by providing a transaction hash.
es: Puede iniciar una sesión de depuración proporcionando un hash de transacción.
fr_fr: Vous pouvez démarrer une session de débogage en fournissant un hachage de transaction.
it: È possibile avviare una sessione di debug fornendo l'hash della transazione.
zh_cn: 您可以通过提供事务哈希来启动调试会话。

source: To find a transaction hash:
es: Para encontrar el hash de una transacción:
fr_fr: Pour trouver un hachage de transaction :
it: Per trovare un hash di transazione:
zh_cn: 要查找交易哈希：

source: Go to a transaction in the terminal.
es: Vaya a una transacción en el terminal.
fr_fr: Accédez à une transaction dans le terminal.
it: Vai a una transazione nel terminale.
zh_cn: 在终端中进行交易。

source: Click a line with a transaction - to exand the log.
es: Haga clic en una línea con una transacción - para salir del registro.
fr_fr: Cliquez sur une ligne comportant une transaction - pour ouvrir le journal.
it: Fare clic su una riga con una transazione - per espandere il registro.
zh_cn: 单击带有事务的行 - 展开日志。

source: The transaction hash is there - copy it.
es: El hash de la transacción está ahí - cópielo.
fr_fr: Le hachage de la transaction est là - copiez-le.
it: L'hash di transazione è lì - copialo.
zh_cn: 交易哈希在那里 - 复制它。

source: Then click in the debugger paste the hash and click on the Start debugging button.
es: A continuación, haga clic en el depurador pegue el hash y pulse el botón Iniciar depuración.
fr_fr: Cliquez ensuite dans le débogueur, collez le hachage et cliquez sur le bouton Démarrer le débogage.
it: Quindi fai clic nel debugger per incollare l'hash e fai clic sul pulsante Avvia debug.
zh_cn: 然后单击调试器粘贴哈希并单击开始调试按钮。

source: Using the debugger
es: Uso del depurador
fr_fr: Utilisation du débogueur
it: Utilizzare il debugger
zh_cn: 使用调试器

source: The debugger allows one to see detailed informations about the transaction's execution. It uses the editor to display the location in the source code where the current execution is.
es: El depurador permite ver información detallada sobre la ejecución de la operación. Utiliza el editor para mostrar la ubicación en el código fuente en la que se encuentra la ejecución actual.
fr_fr: Le débogueur permet de voir des informations détaillées sur l'exécution de la transaction. Il utilise l'éditeur pour afficher l'endroit du code source où se trouve l'exécution en cours.
it: Il debugger consente di visualizzare informazioni dettagliate sull'esecuzione della transazione. Esso utilizza l'editor per visualizzare la posizione nel codice sorgente in cui si trova l'esecuzione attuale.
zh_cn: 调试器允许人们查看有关事务执行的详细信息。 它使用编辑器在源代码中显示当前执行的位置。

source: The navigation part contains a slider and buttons that can be used to step through the transaction execution.
es: La parte de navegación contiene un control deslizante y botones que pueden utilizarse para recorrer la ejecución de la transacción.
fr_fr: La partie navigation contient un curseur et des boutons qui peuvent être utilisés pour avancer dans l'exécution de la transaction.
it: La parte di navigazione contiene un cursore e dei pulsanti che possono essere utilizzati per scorrere lungo l'esecuzione della transazione.
zh_cn: 导航部分包含一个滑块和按钮，可用于逐步执行事务。

source: More explaination of what these buttons do.
es: Más explicaciones sobre lo que hacen estos botones.
fr_fr: Plus d'explications sur le rôle de ces boutons.
it: Ulteriori spiegazioni sulle funzioni di questi pulsanti.
zh_cn: 更多解释这些按钮的作用。

source: Step Into
es: Entre
fr_fr: Entrez dans
it: Passa A
zh_cn: 进入

source: Step Over Into
es: Paso a paso
fr_fr: Passer à l'étape suivante
it: Passa Sopra A
zh_cn: 跨步进入

source: 11 panels give detailed information about the execution:
es: 11 paneles ofrecen información detallada sobre la ejecución:
fr_fr: 11 panneaux donnent des informations détaillées sur l'exécution :
it: 11 pannelli forniscono informazioni dettagliate sull'esecuzione:
zh_cn: 11 个面板提供了有关执行的详细信息：

source: Instructions
es: Instrucciones
it: Istruzioni
zh_cn: 指令

source: The Instructions panel displays the bytecode of the current executing contract- with the current step highlighted.
es: El panel de instrucciones muestra el bytecode del contrato en ejecución, con el paso actual resaltado.
fr_fr: Le panneau Instructions affiche le bytecode du contrat en cours d'exécution, l'étape en cours étant mise en évidence.
it: Il pannello Istruzioni visualizza il bytecode del contratto attualmente in esecuzione, con il passaggio corrente evidenziato.
zh_cn: 指令面板显示当前执行合约的字节码——当前步骤突出显示。

source: Important note: When this panel is hidden, the slider will have a courser granularity and only stop at expression boundaries, even if they are compiled into multiple EVM instructions. When the panel is displayed, it will be possible to step over every instruction, even those that refers to the same expression.
es: Nota importante: Cuando este panel esté oculto, el deslizador tendrá una granularidad más gruesa y sólo se detendrá en los límites de las expresiones, aunque estén compiladas en varias instrucciones EVM. Cuando el panel esté desplegado, será posible pasar por encima de cada instrucción, incluso las que se refieran a la misma expresión.
fr_fr: Remarque importante : lorsque ce panneau est masqué, le curseur a une granularité plus fine et ne s'arrête qu'aux limites des expressions, même si elles sont compilées en plusieurs instructions EVM. Lorsque le panneau est affiché, il est possible d'enjamber toutes les instructions, même celles qui se réfèrent à la même expression.
it: Nota importante: quando questo pannello è nascosto, il cursore avrà una granularità maggiore e si fermerà solo ai confini delle espressioni, anche se queste sono compilate in più istruzioni EVM. Quando il pannello è visualizzato, sarà possibile passare sopra ogni istruzione, anche quelle che si riferiscono alla stessa espressione.
zh_cn: 重要提示：当此面板被隐藏时，滑块将具有更粗的粒度并且仅在表达式边界处停止，即使它们被编译成多个 EVM 指令。 显示面板时，可以跳过每条指令，即使是那些引用相同表达式的指令。

source: Solidity Locals
es: Locales Solidarios
fr_fr: Solidité Locale
it: Locali di Solidity

source: The Solidity Locals panel displays local variables associated with the current context.
es: El panel Solidity Locals muestra las variables locales asociadas al contexto actual.
fr_fr: Le panneau Solidity Locals affiche les variables locales associées au contexte actuel.
it: Il pannello Locali di Solidity visualizza le variabili locali associate al contesto attuale.
zh_cn: Solidity Locals 面板显示与当前上下文相关的局部变量。

source: Solidity State
es: Estado de solidez
fr_fr: État de Solidité
it: Stato di Solidity

source: The Solidity State panel displays state variables of the current executing contract.
es: El panel Estado de Solidity muestra las variables de estado del contrato en ejecución.
fr_fr: Le panneau Solidity State affiche les variables d'état du contrat en cours d'exécution.
it: Il pannello Stato di Solidity visualizza le variabili di stato del contratto in esecuzione.
zh_cn: Solidity State 面板显示当前执行合约的状态变量。

source: Low level panels
es: Paneles de bajo nivel
fr_fr: Panneaux de bas niveau
it: Pannelli di Livello basso
zh_cn: 低级面板

source: These panels display low level informations about the execution:
es: Estos paneles muestran información de bajo nivel sobre la ejecución:
fr_fr: Ces panneaux affichent des informations de bas niveau sur l'exécution :
it: Questi pannelli mostrano informazioni di basso livello sull'esecuzione:
zh_cn: 这些面板显示有关执行的低级信息：

source: Stack
es: Pila
fr_fr: Pile
zh_cn: 堆栈

source: Storages Changes
es: Cambios en los almacenes
fr_fr: Changements dans les entrepôts
it: Modifiche di Archiviazione
zh_cn: 存储更改

source: Memory
es: Memoria
fr_fr: Mémoire
it: Memoria
zh_cn: 内存

source: Call Data
es: Datos de llamada
fr_fr: Données d'appel
it: Dati di Chiamata
zh_cn: 调用数据

source: Call Stack
es: Pila de llamadas
fr_fr: Pile d'appels
it: Stack di Chiamata
zh_cn: 调用堆栈

source: Return Value (only if the current step is a RETURN opcode)
es: Valor de retorno (sólo si el paso actual es un opcode RETURN)
fr_fr: Valeur de retour (uniquement si l'étape en cours est un opcode RETURN)
it: Valore di ritorno (solo se il passaggio corrente è un codice operativo RETURN)
zh_cn: Return Valu(仅当当前步骤是返回操作码时)

source: Full Storages Changes (only at the end of the execution - display every storage change of every modified contract)
es: Cambios de almacenamiento completos (sólo al final de la ejecución - muestra cada cambio de almacenamiento de cada contrato modificado)
fr_fr: Changements de stockage complets (uniquement à la fin de l'exécution - affichage de tous les changements de stockage de chaque contrat modifié)
it: Modifiche Complete dell'Archiviazione (solo alla fine dell'esecuzione - visualizzazione di ogni modifica dell'archiviazione di ogni contratto alterato)
zh_cn: 完整存储更(仅在执行结束时 - 显示每个修改后的合约的每个存储更改)

source: Reverted Transaction
es: Transacción revertida
fr_fr: Transaction annulée
it: Transazione Invertita
zh_cn: 恢复交易

source: A transaction can be reverted (because of an out of gas exception or Solidity revert statement or because of a low level exception).
es: Una transacción puede revertirse (debido a una excepción fuera de gas o una sentencia Solidity revert o debido a una excepción de bajo nivel).
fr_fr: Une transaction peut être annulée (en raison d'une exception "out of gas" ou d'une déclaration d'annulation de Solidity, ou en raison d'une exception de bas niveau).
it: Una transazione può essere annullata (a causa di un'eccezione di esaurimento del carburante o di una dichiarazione di ripristino di Solidity o a causa di un'eccezione di basso livello).
zh_cn: 可以恢复交易(因为用尽gas异常或 Solidity 恢复语句或因为低级别异常)。

source: It is important to be aware of the exception and to locate where the exception is in the source code.
es: Es importante ser consciente de la excepción y localizar dónde se encuentra en el código fuente.
fr_fr: Il est important d'être conscient de l'exception et de localiser l'endroit où elle se trouve dans le code source.
it: È importante essere consapevoli dell'eccezione e individuare la posizione dell'eccezione nel codice sorgente.
zh_cn: 了解异常并找出异常在源代码中的位置很重要。

source: Remix will warn you when the execution throws an exception. The warning button will jump to the last opcode before the exception happened.
es: Remix le avisará cuando la ejecución lance una excepción. El botón de advertencia saltará al último opcode antes de que se produjera la excepción.
fr_fr: Remix vous avertira lorsque l'exécution lancera une exception. Le bouton d'avertissement vous renvoie au dernier opcode avant que l'exception ne se produise.
it: Remix avvisa quando l'esecuzione genera un'eccezione. Il pulsante di avvertimento salta all'ultimo codice operativo prima che si verificasse l'eccezione.
zh_cn: 当执行引发异常时，Remix 会警告您。 警告按钮将跳转到异常发生之前的最后一个操作码。

source: Breakpoints
es: Puntos de interrupción
fr_fr: Points d'arrêt
it: Punti di interruzione
zh_cn: 断点

source: The two last buttons from the navigation area are used to jump either back to the previous breakpoint or forward to the next breakpoint.
es: Los dos últimos botones del área de navegación se utilizan para saltar hacia atrás al punto de ruptura anterior o hacia adelante al siguiente punto de ruptura.
fr_fr: Les deux derniers boutons de la zone de navigation permettent de revenir au point d'arrêt précédent ou d'avancer au point d'arrêt suivant.
it: Gli ultimi due pulsanti dell'area di navigazione servono per tornare al punto di interruzione precedente o per passare al punto di interruzione successivo.
zh_cn: 导航区域的最后两个按钮用于跳回上一个断点或前进到下一个断点。

source: Breakpoints can be added and removed by clicking on the line number in the Editor.
es: Los puntos de interrupción pueden añadirse y eliminarse pulsando sobre el número de línea en el Editor.
fr_fr: Des points d'arrêt peuvent être ajoutés et supprimés en cliquant sur le numéro de ligne dans l'éditeur.
it: I punti di interruzione possono essere aggiunti e rimossi facendo clic sul numero di riga nell'Editor.
zh_cn: 可以通过单击编辑器中的行号来添加和删除断点。

source: When using debug session with breakpoints, the execution will jump to the first encountered breakpoint.
es: Cuando utilice la sesión de depuración con puntos de interrupción, la ejecución saltará al primer punto de interrupción encontrado.
fr_fr: Lorsque vous utilisez une session de débogage avec des points d'arrêt, l'exécution sautera au premier point d'arrêt rencontré.
it: Quando si utilizza una sessione di debug con punti di interruzione, l'esecuzione salta al primo punto di interruzione incontrato.
zh_cn: 当使用带断点的调试会话时，执行将跳转到第一个遇到的断点。

source: Important note: If you add a breakpoint to a line that declares a variable, it might be triggered twice: Once for initializing the variable to zero and second time for assigning the actual value. As an example, assume you are debugging the following contract:
es: Nota importante: Si añade un punto de interrupción a una línea que declara una variable, podría activarse dos veces: una para inicializar la variable a cero y otra para asignarle el valor real. Como ejemplo, suponga que está depurando el siguiente contrato:
fr_fr: Remarque importante : si vous ajoutez un point d'arrêt à une ligne qui déclare une variable, il risque d'être déclenché deux fois : une première fois pour initialiser la variable à zéro et une seconde fois pour lui assigner sa valeur réelle. À titre d'exemple, supposons que vous déboguiez le contrat suivant :
it: Nota importante: se si aggiunge un punto di interruzione a una riga che dichiara una variabile, questo potrebbe essere attivato due volte: una prima volta per inizializzare la variabile a zero e una seconda volta per assegnare il valore effettivo. A titolo di esempio, si supponga di eseguire il debug del seguente contratto:
zh_cn: 重要提示：如果在声明变量的行中添加断点，它可能会被触发两次：一次用于将变量初始化为零，第二次用于分配实际值。 例如，假设您正在调试以下合约：

source: And let's says that breakpoints are set for the lines
es: Y digamos que se establecen puntos de ruptura para las líneas
fr_fr: Et disons que des points d'arrêt sont définis pour les lignes
it: E supponiamo che i punti di interruzione siano impostati per le linee
zh_cn: 假设为这些行设置了断点

source: then clicking on Jump to next breakpoint will stop at the following lines in the given order:
es: entonces pulsando en Saltar al siguiente punto de interrupción se detendrá en las siguientes líneas en el orden dado:
fr_fr: puis en cliquant sur Sauter au point d'arrêt suivant, vous vous arrêterez aux lignes suivantes dans l'ordre indiqué :
it: facendo clic su Salta al punto di interruzione successivo, si fermerà alle righe successive nell'ordine indicato:
zh_cn: 然后单击跳转到下一个断点将按给定顺序在以下行处停止：

source: uint p = 45; (declaration of p)
es: uint p = 45; (declaración de p)
fr_fr: uint p = 45 ; (déclaration de p)
it: uint p = 45; (dichiarazione di p)
zh_cn: uint p = 45;(p的声明)

source: uint l = 34; (declaration of l)
es: uint l = 34; (declaración de l)
fr_fr: uint l = 34 ; (déclaration de l)
it: uint l = 34; (dichiarazione di l)
zh_cn: uint l = 34; (l 的声明)

source: uint p = 45; (45 assigned to p)
es: uint p = 45; (45 asignado a p)
fr_fr: uint p = 45 ; (45 attribué à p)
it: uint p = 45; (45 assegnato a p)
zh_cn: uint p = 45; (45 分配给 p)

source: m = 89; (89 assigned to m)
es: m = 89; (89 asignado a m)
fr_fr: m = 89 ; (89 attribué à m)
it: m = 89; (89 assegnato a m)
zh_cn: m = 89; (89 分配给 m)

source: uint l = 34; (34 assigned to l)
es: uint l = 34; (34 asignado a l)
fr_fr: uint l = 34 ; (34 assigné à l)
it: uint l = 34; (34 assegnato a l)
zh_cn: uint l = 34； (34 分配给 l)

source: Run & Deploy (part 2)
es: Ejecutar y desplegar (parte 2)
fr_fr: Exécuter et déployer (partie 2)
it: Esegui & Distribuisci (parte 2)
zh_cn: 运行和部署(第 2 部分)

source: Deployed contracts
es: Contratos desplegados
fr_fr: Contrats déployés
it: Contratti distribuiti
zh_cn: 已部署的合约

source: This section in the Run tab contains a list of deployed contracts to interact with through autogenerated UI of the deployed contract (also called udapp).
es: Esta sección de la pestaña Ejecutar contiene una lista de contratos desplegados con los que interactuar a través de la interfaz de usuario autogenerada del contrato desplegado (también denominada udapp).
fr_fr: Cette section de l'onglet Exécuter contient une liste de contrats déployés avec lesquels il est possible d'interagir grâce à l'interface utilisateur autogénérée du contrat déployé (également appelée udapp).
it: Questa sezione della scheda Esegui contiene un elenco di contratti distribuiti con cui interagire attraverso l'interfaccia utente generata automaticamente del contratto distribuito (chiamata anche udapp).
zh_cn: 运行选项卡中的此部分包含一个已部署合约列表，可通过已部署合约(也称为 udapp) 的自动生成 UI 进行交互。

source: The deployed contract appears but is in its collapsed form.
es: El contrato desplegado aparece pero está en su forma colapsada.
fr_fr: Le contrat déployé apparaît mais sous sa forme réduite.
it: Il contratto distribuito viene visualizzato, ma è nella sua forma collassata.
zh_cn: 部署的合约出现，但处于折叠形式。

source: Click the sideways caret to open it up.
es: Pulse el signo de intercalación lateral para abrirlo.
fr_fr: Cliquez sur la flèche latérale pour l'ouvrir.
it: Fare clic sul cursore laterale per aprirlo.
zh_cn: 单击侧面的插入符号将其打开。

source: You will see the functions in the contract. The functions buttons can have different color buttons.
es: Verá las funciones en el contrato. Los botones de las funciones pueden tener diferentes colores.
fr_fr: Vous verrez les fonctions dans le contrat. Les boutons des fonctions peuvent être de couleurs différentes.
it: Le funzioni vengono visualizzate nel contratto. I pulsanti delle funzioni possono essere di colore diverso.
zh_cn: 您将看到合约中的功能。 功能按钮可以有不同颜色的按钮。

source: Functions that are constant or pure functions in Solidity have a blue buttons. Clicking one of this type does not create a new transaction. So clicking will not cause state changes - it will only return a value stored in the contract - so it won't cost you anything in gas fees.
es: Las funciones que son constantes o funciones puras en Solidity tienen un botón azul. Hacer clic en uno de este tipo no crea una nueva transacción. Así que hacer clic no provocará cambios de estado -sólo devolverá un valor almacenado en el contrato-, por lo que no le costará nada en gastos de gas.
fr_fr: Les fonctions qui sont des fonctions constantes ou pures dans Solidity ont un bouton bleu. Cliquer sur un bouton de ce type ne crée pas de nouvelle transaction. Le clic ne provoque donc pas de changement d'état - il ne fait que renvoyer une valeur stockée dans le contrat - et ne vous coûte donc rien en frais de gaz.
it: Le funzioni costanti o pure in Solidity hanno un pulsante blu. Facendo clic su uno di questi pulsanti non si crea una nuova transazione. Pertanto, il clic non causerà cambiamenti di stato - ma restituirà solo un valore archiviato nel contratto - quindi non costerà nulla in termini di costi di carburante.
zh_cn: Solidity 中的常量或纯函数有一个蓝色按钮。 单击此类型之一不会创建新事务。 所以点击不会导致状态改变——它只会返回一个存储在合约中的值——所以它不会花费你任何gas费。

source: Functions that change the state of the contract AND that do not accept Ether are called non-payable functions and have an orange button. Clicking on them will create a transaction and thus cost gas.
es: Las funciones que cambian el estado del contrato Y que no aceptan Ether se denominan funciones no pagables y tienen un botón naranja. Al hacer clic en ellas se creará una transacción y, por tanto, costará gas.
fr_fr: Les fonctions qui modifient l'état du contrat ET qui n'acceptent pas d'Ether sont appelées fonctions non payantes et ont un bouton orange. En cliquant sur ces fonctions, vous créez une transaction et vous payez donc du gaz.
it: Le funzioni che modificano lo stato del contratto E che non accettano Ether sono chiamate funzioni non pagabili e hanno un pulsante arancione. Facendo clic su di esse si crea una transazione e quindi viene addebitato il costo del carburante.
zh_cn: 更改合约状态且不接受ETH的函数称为非付费函数，并带有一个橙色按钮。 点击它们将创建一个交易，因此会产生 gas。

source: Functions that have red buttons are payable functions in Solidity. Clicking one of these will create a new transaction and this transaction can accept a value. The value is put in in the Value field which is under the Gas Limit field.
es: Las funciones que tienen botones rojos son funciones pagables en Solidity. Al hacer clic en una de ellas se creará una nueva transacción y esta transacción puede aceptar un valor. El valor se pone en el campo Valor que está debajo del campo Límite de Gasto.
fr_fr: Les fonctions qui ont des boutons rouges sont des fonctions payables dans Solidity. En cliquant sur l'une d'entre elles, vous créez une nouvelle transaction qui peut accepter une valeur. La valeur est inscrite dans le champ Valeur qui se trouve sous le champ Limite de gaz.
it: Le funzioni con i pulsanti rossi sono funzioni pagabili in Solidity. Facendo clic su una di queste funzioni si crea una nuova transazione che può accettare un valore. Il valore viene inserito nel campo Valore che si trova sotto il campo Limite del Carburante.
zh_cn: 带有红色按钮的函数是 Solidity 中的应付函数。 单击其中一个将创建一个新事务，并且该事务可以接受一个值。 该值被输入到 Gas Limit 字段下的 Value 字段中。

source: See more information about Solidity modifiers in the Solidity docs. .
es: Consulte más información sobre los modificadores Solidity en la documentación de Solidity. .
fr_fr: Vous trouverez plus d'informations sur les modificateurs de Solidity dans la documentation de Solidity. .
it: Per ulteriori informazioni sui modificatori di Solidity, consultare i documenti di Solidity. .
zh_cn: 在 Solidity 文档中查看有关 Solidity 修饰符的更多信息。

source: If a function requires input parameters, well.. you gotta put them in.
es: Si una función requiere parámetros de entrada, bueno... hay que ponerlos.
fr_fr: Si une fonction nécessite des paramètres d'entrée, vous devez les introduire.
it: Se una funzione richiede parametri di input, beh... bisogna inserirli.
zh_cn: 如果一个函数需要输入参数，那么...... 你必须把它们放进去。

source: Inputting parameters
es: Introducción de parámetros
fr_fr: Saisie des paramètres
it: Inserire parametri
zh_cn: 输入参数

source: Inputting parameters in the collapsed view
es: Introducción de parámetros en la vista contraída
fr_fr: Saisie de paramètres dans la vue réduite
it: Inserire parametri nella vista compressa
zh_cn: 在折叠视图中输入参数

source: (Inputting all the parameters in a single input box)
es: (Introducción de todos los parámetros en un único cuadro de entrada)
fr_fr: (saisie de tous les paramètres dans un seul champ de saisie)
it: (Inserimento di tutti i parametri in un'unica casella di input)
zh_cn: (在一个输入框中输入所有参数)

source: The input box tells you what type each parameter needs to be.
es: El cuadro de entrada le indica de qué tipo debe ser cada parámetro.
fr_fr: La zone de saisie vous indique le type de chaque paramètre.
it: La casella di input indica il tipo di parametro da utilizzare.
zh_cn: 输入框告诉您每个参数需要是什么类型。

source: Numbers and addresses do not need to be wrapped in double quotes.
es: Los números y las direcciones no necesitan ir entre comillas dobles.
fr_fr: Les nombres et les adresses ne doivent pas être placés entre guillemets.
it: I numeri e gli indirizzi non devono essere racchiusi in virgolette doppie.
zh_cn: 数字和地址不需要用双引号括起来。

source: Strings need to be wrapped.
es: Es necesario envolver las cadenas.
fr_fr: Les chaînes doivent être enveloppées.
it: Le stringhe devono essere avvolte.
zh_cn: 字符串需要被包装。
