Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Parameters are separated by commas.
es: Los parámetros están separados por comas.
fr_fr: Les paramètres sont séparés par des virgules.
it: I parametri sono separati da virgole.
zh_cn: 参数用逗号分隔。

source: In the example above the "delegate" function has 3 parameters.
es: En el ejemplo anterior, la función "delegar" tiene 3 parámetros.
fr_fr: Dans l'exemple ci-dessus, la fonction "delegate" a 3 paramètres.
it: Nell'esempio precedente, la funzione "delega" ha 3 parametri.
zh_cn: 在上面的例子中，“delegate”函数有 3 个参数。

source: Inputting parameters in the expanded view
es: Introducción de parámetros en la vista ampliada
fr_fr: Saisie de paramètres dans la vue élargie
it: Immissione di parametri nella vista estesa
zh_cn: 在展开视图中输入参数

source: Clicking the 'down' caret brings you to the Multi-param Manager - where you can input the parameters one at a time. Much less confusing!
es: Si hace clic en el signo "abajo" accederá al gestor multiparamétrico, donde podrá introducir los parámetros de uno en uno. ¡Mucho menos confuso!
fr_fr: En cliquant sur la flèche "vers le bas", vous accédez au gestionnaire multi-paramètres, où vous pouvez saisir les paramètres un par un. C'est beaucoup moins déroutant !
it: Facendo clic sul cursore 'giù' si accede alla Gestione Multiparametrica, dove è possibile inserire i parametri uno alla volta. Molto meno caotico!
zh_cn: 单击“向下”插入符号会将您带到多参数管理器 - 您可以一次输入一个参数。 少了很多混乱！

source: In the expanded view, strings do not need to be wrapped.
es: En la vista ampliada, no es necesario envolver las cadenas.
fr_fr: Dans la vue développée, les chaînes n'ont pas besoin d'être enveloppées.
it: Nella vista estesa, le stringhe non devono essere impacchettate.
zh_cn: 在展开的视图中，不需要包装字符串。

source: Clicking the clipboard icon will encode the inputs and will copy them. Only a valid set of inputs can be encoded.
es: Al hacer clic en el icono del portapapeles se codificarán las entradas y se copiarán. Sólo se puede codificar un conjunto válido de entradas.
fr_fr: En cliquant sur l'icône du presse-papiers, vous encoderez les entrées et les copierez. Seul un ensemble valide d'entrées peut être encodé.
it: Facendo clic sull'icona degli appunti, gli input vengono codificati e copiati. È possibile codificare solo un insieme valido di input.
zh_cn: 单击剪贴板图标将对输入进行编码并复制它们。 只有一组有效的输入可以被编码。

source: So if you made a mistake and put a uint8 where an address should have been, clicking the clipboard here will give you an error.
es: Así que si se ha equivocado y ha puesto un uint8 donde debería haber estado una dirección, al pulsar el portapapeles aquí le dará un error.
fr_fr: Ainsi, si vous avez fait une erreur et que vous avez mis un uint8 à la place d'une adresse, cliquer sur le presse-papiers ici vous donnera un message d'erreur.
it: Quindi, se si è commesso un errore e si è inserito un uint8 al posto di un indirizzo, facendo clic sulla clipboard si otterrà un errore.
zh_cn: 因此，如果您犯了一个错误并将一个 uint8 放置在地址应该是的位置，单击此处的剪贴板将给您一个错误。

source: Low level interactions
es: Interacciones de bajo nivel
fr_fr: Interactions de bas niveau
it: Interazioni di livello basso
zh_cn: 低级交互

source: Low level interactions are used to send funds or calldata or funds & calldata to a contract through the recieve() or fallback() function. Typically, you should only need to implement the fallback function if you are following an upgrade or proxy pattern.
es: Las interacciones de bajo nivel se utilizan para enviar fondos o datos de llamada o fondos y datos de llamada a un contrato a través de la función recieve() o fallback(). Normalmente, sólo debería necesitar implementar la función fallback si sigue un patrón de actualización o proxy.
fr_fr: Les interactions de bas niveau sont utilisées pour envoyer des fonds ou des données d'appel ou des fonds et des données d'appel à un contrat par l'intermédiaire de la fonction recieve() ou fallback(). En règle générale, vous ne devez implémenter la fonction fallback que si vous suivez un modèle de mise à niveau ou de procuration.
it: Le interazioni di basso livello sono utilizzate per inviare fondi o calldata o fondi & calldata a un contratto tramite la funzione recieve() o fallback(). In genere, è necessario implementare la funzione di fallback solo se si segue uno schema di aggiornamento o proxy.
zh_cn: 低级交互用于通过 recieve() 或 fallback() 函数将资金或 calldata 或资金和 calldata 发送到合约。 通常，如果您遵循升级或代理模式，您应该只需要实现回退功能。

source: The low level interactions section is below the functions in each deployed contract.
es: La sección de interacciones de bajo nivel se encuentra debajo de las funciones de cada contrato desplegado.
fr_fr: La section des interactions de bas niveau se trouve sous les fonctions de chaque contrat déployé.
it: La sezione delle interazioni di basso livello si trova al di sotto delle funzioni in ciascun contratto distribuito.
zh_cn: 低级交互部分位于每个已部署合约中的功能下方。

source: Please note the following:
es: Tenga en cuenta lo siguiente:
fr_fr: Veuillez noter ce qui suit :
it: Assicurati che:
zh_cn: 请注意以下事项：

source: If you are executing a plain Ether transfer to a contract, you need to have the receive() function in your contract. If your contract has been deployed and you want to send it funds, you would input the amount of Ether or Wei etc. (see A in graphic below), and then input NOTHING in the calldata field of Low level interactions (see B in graphic) and click the Transact button (see C in graphic below).
es: Si está ejecutando una transferencia simple de Ether a un contrato, necesita tener la función receive() en su contrato. Si su contrato ha sido desplegado y desea enviarle fondos, introduciría la cantidad de Ether o Wei, etc. (véase A en el gráfico inferior), y a continuación no introduciría NADA en el campo calldata de las interacciones de bajo nivel (véase B en el gráfico) y pulsaría el botón Transact (véase C en el gráfico inferior).
fr_fr: Si vous exécutez un simple transfert d'Ether vers un contrat, vous devez avoir la fonction receive() dans votre contrat. Si votre contrat a été déployé et que vous souhaitez lui envoyer des fonds, vous devez saisir le montant en Ether ou Wei, etc. (voir A dans le graphique ci-dessous), puis NE RIEN saisir dans le champ calldata des interactions de bas niveau (voir B dans le graphique) et cliquer sur le bouton Transact (voir C dans le graphique ci-dessous).
it: Se state eseguendo un semplice trasferimento di Ether a un contratto, dovete avere la funzione receive() nel vostro contratto. Se il vostro contratto è stato distribuito e volete inviargli dei fondi, dovrete inserire la quantità di Ether o Wei ecc. (vedi A nel grafico sottostante), e poi non inserire nulla nel campo calldata delle interazioni di basso livello (vedi B nel grafico) e fare clic sul pulsante Transact (vedi C nel grafico sottostante).
zh_cn: 如果你正在执行一个普通的ETH转账到一个合约，你需要在你的合约中有 receive() 函数。 如果你的合约已经部署，你想给它发送资金，你可以输入ETH或 Wei 等的数量(见下图中的 A)，然后在低级交互的 calldata 字段中输入 NOTHING(见下图中的 B) 并单击 Transact 按钮(参见下图中的 C)。

source: If you are sending calldata to your contract with Ether, then you need to use the fallback() function and have it with the state mutability of payable.
es: Si está enviando calldata a su contrato con Ether, entonces necesita utilizar la función fallback() y tenerla con la mutabilidad de estado de pagable.
fr_fr: Si vous envoyez des données à votre contrat avec l'Ether, alors vous devez utiliser la fonction fallback() et l'avoir avec la mutabilité de l'état de payable.
it: Se si inviano calldata al contratto con Ether, è necessario utilizzare la funzione fallback() e dotarla della mutabilità di stato di pagabile.
zh_cn: 如果您使用ETH将 calldata 发送到您的合约，那么您需要使用 fallback() 函数并使其具有应付状态的可变性。

source: If you are not sending ether to the contract but are sending call data then you need to use the fallback() function.
es: Si no está enviando éter al contrato, pero sí datos de llamada, deberá utilizar la función fallback().
fr_fr: Si vous n'envoyez pas d'éther au contrat mais des données d'appel, vous devez utiliser la fonction fallback().
it: Se non si invia ether al contratto, ma si inviano calldata, è necessario utilizzare la funzione fallback().
zh_cn: 如果你没有向合约发送ETH而是发送调用数据，那么你需要使用 fallback() 函数。

source: If you break the rules when using the Low level interactions you will be slapped with a warning.
es: Si incumple las normas al utilizar las interacciones de bajo nivel recibirá una advertencia.
fr_fr: Si vous enfreignez les règles lors de l'utilisation des interactions de bas niveau, vous recevrez un avertissement.
it: Se si violano le regole quando si utilizzano le interazioni di basso livello, si riceve un avvertimento.
zh_cn: 如果您在使用低级交互时违反规则，您将受到警告。

source: Please see the solidity docs for more specifics about using the fallback and receive functions.
es: Consulte la documentación de solidity para obtener más información sobre el uso de las funciones fallback y receive.
fr_fr: Veuillez consulter la documentation de Solidity pour plus de détails sur l'utilisation des fonctions fallback et receive.
it: Per maggiori informazioni sull'uso delle funzioni fallback e receive, consultare la documentazione di solidity.
zh_cn: 有关使用回退和接收功能的更多细节，请参阅solidity 文档。

source: Passing in a tuple or a struct to a function
es: Pasar una tupla o una estructura a una función
fr_fr: Transmettre un tuple ou une structure à une fonction
it: Passare una tupla o una struct a una funzione
zh_cn: 将元组或结构传递给函数

source: To pass a tuple in, you need to put in an array [].
es: Para pasar una tupla, debe poner una matriz [].
fr_fr: Pour passer un tuple, vous devez mettre un tableau [].
it: Per passare una tupla, è necessario inserire una matrice [].
zh_cn: 要传入一个元组，您需要放入一个数组 []。

source: Similarly, to pass in a struct as a parameter of a function, it needs to be put in as an array []. Also note that the line pragma experimental ABIEncoderV2; needs to put in at the top of the solidity file.
es: Del mismo modo, para pasar un struct como parámetro de una función, es necesario ponerlo como un array []. También tenga en cuenta que la línea pragma experimental ABIEncoderV2; necesita poner en la parte superior del archivo de solidez.
fr_fr: De même, pour passer une structure en tant que paramètre d'une fonction, elle doit être placée dans un tableau []. Notez également que la ligne pragma experimental ABIEncoderV2 ; doit être placée au début du fichier solidity.
it: Allo stesso modo, per passare una struct come parametro di una funzione, è necessario inserirla come una matrice []. Si noti anche che la riga pragma experimental ABIEncoderV2; deve essere inserita all'inizio del file solidity.
zh_cn: 类似地，要将结构体作为函数的参数传入，需要将其作为数组 [] 放入。 还要注意行 pragma 实验 ABIEncoderV2; 需要放在solidity文件的顶部。

source: Example of passing nested struct to a function
es: Ejemplo de paso de una estructura anidada a una función
fr_fr: Exemple de passage d'une structure imbriquée à une fonction
it: Esempio di passaggio di struttura annidata a una funzione
zh_cn: 将嵌套结构传递给函数的示例

source: Consider a nested struct defined like this:
es: Considere una estructura anidada definida así:
fr_fr: Considérez une structure imbriquée définie comme suit :
it: Considera una struttura annidata definita così:
zh_cn: 考虑这样定义的嵌套结构：

source: If a function has the signature fertilizer(Garden memory gardenPlot) then the correct syntax is:
es: Si una función tiene la firma fertilizante(memoria jardínjardínPlot) entonces la sintaxis correcta es:
fr_fr: Si une fonction a pour signature fertilizer(Garden memory gardenPlot), la syntaxe correcte est la suivante :
it: Se una funzione ha la firma fertilizer(Garden memory gardenPlot), la sintassi corretta è:
zh_cn: 如果函数具有签名 fertilizer(Garden memory gardenPlot)，那么正确的语法是：

source: To continue on this example, here's a sample contract:
es: Para continuar con este ejemplo, he aquí un modelo de contrato:
fr_fr: Pour poursuivre cet exemple, voici un exemple de contrat :
it: Per continuare con questo esempio, ecco un esempio di contratto:
zh_cn: 为了继续这个例子，这里有一个示例合约：

source: After compiling, deploying the contract and opening up the deployed instance, we can then add the following input parameters to the function named fertilizer :
es: Tras compilar, desplegar el contrato y abrir la instancia desplegada, podemos añadir los siguientes parámetros de entrada a la función denominada fertilizante :
fr_fr: Après avoir compilé, déployé le contrat et ouvert l'instance déployée, nous pouvons ajouter les paramètres d'entrée suivants à la fonction nommée fertilizer :
it: Dopo aver compilato, distribuito il contratto e aperto l'istanza distribuita, possiamo aggiungere i seguenti parametri di input alla funzione denominata fertilizzante :
zh_cn: 在编译、部署合约并打开部署的实例后，我们可以将以下输入参数添加到名为 foil 的函数中：

source: The function fertilizer accepts a single parameter of the type Garden. The type Garden is a struct. Structs are wrapped in square brackets. Inside Garden is an array that is an array of structs named theFlowers. It gets a set of brackets for the array and another set for the struct. Thus the double square brackets.
es: La función abono acepta un único parámetro del tipo Jardín. El tipo Jardín es una estructura. Los struct se envuelven entre corchetes. Dentro de Jardín hay un array que es un array de structs llamado lasFlores. Tiene un conjunto de corchetes para el array y otro conjunto para el struct. De ahí los corchetes dobles.
fr_fr: La fonction fertiliser accepte un seul paramètre de type Jardin. Le type Jardin est une structure. Les structures sont placées entre crochets. À l'intérieur de Garden se trouve un tableau qui est un tableau de structures nommé theFlowers. Il y a un ensemble de crochets pour le tableau et un autre pour la structure. D'où les doubles crochets.
it: La funzione fertilizzante accetta un singolo parametro del tipo Giardino. Il tipo Giardino è una struct. Le struct sono racchiuse tra parentesi quadre. All'interno di Giardino c'è una matrice che è una matrice di struct denominata iFiori. Si ottiene un insieme di parentesi per la matrice e un altro insieme per la struct. Ecco perché le doppie parentesi quadre.
zh_cn: 函数 fertilizer 接受花园类型的单个参数。 Garden 类型是一个结构体。 结构体用方括号括起来。 Garden 内部是一个数组，它是一个名为 theFlowers 的结构数组。 它为数组获取一组括号，为结构获取另一组括号。 因此，双方括号。

source: Testing by Example
es: Pruebas con el ejemplo
fr_fr: Exemple de tests
it: Testare da Esempi
zh_cn: 示例测试

source: Here are some examples which can give you better understanding to plan your tests.
es: He aquí algunos ejemplos que pueden darle una mejor comprensión para planificar sus pruebas.
fr_fr: Voici quelques exemples qui peuvent vous aider à mieux planifier vos tests.
it: Ecco alcuni esempi che possono farti capire meglio come pianificare i tuoi test.
zh_cn: 以下是一些示例，可以让您更好地理解计划测试。

source: Note: Examples in this section are intended to give you a push for development. We don't recommend to rely on them without verifying at your end.
es: Nota: Los ejemplos de esta sección pretenden darle un empujón para el desarrollo. No recomendamos confiar en ellos sin verificarlos en su extremo.
fr_fr: Remarque : les exemples dans cette section sont destinés à vous aider dans le développement. Nous ne recommandons pas d'avoir une totale confiance en eux sans vérifier.
it: Nota: gli esempi di questa sezione hanno lo scopo di fornire una spinta allo sviluppo. Non si consiglia di fare affidamento su di essi senza averli verificati.
zh_cn: 注意：本节中的示例旨在推动您的开发。 我们不建议您在没有经过验证的情况下依赖它们。

source: 1. Simple example
es: 1. Ejemplo sencillo
fr_fr: 1. Exemple simple
it: 1. Esempio semplice
zh_cn: 1. 简单的例子

source: In this example, we test setting & getting variables.
es: En este ejemplo, probamos establecer y obtener variables.
fr_fr: Dans cet exemple, nous testons la configuration et l'obtention de variables.
it: In questo esempio, testiamo l'impostazione e l'ottenimento delle variabili.
zh_cn: 在这个例子中，我们测试设置和获取变量。

source: Contract/Program to be tested: Simple_storage.sol
es: Contrato/Programa a probar Simple_storage.sol
fr_fr: Contrat/Programme à tester : <code>simple_storage.sol</code>
it: Contratto/Programma da testare: Simple_storage.sol
zh_cn: 要测试的合约/程序：Simple_storage.sol

source: Test contract/program: simple_storage_test.sol
es: Contrato/programa de prueba: simple_storage_test.sol
fr_fr: Contrat/programme de test : <code>simple_storage_test.sol</code>
it: Testare del contratto/programma: simple_storage_test.sol
zh_cn: 测试合约/程序：simple_storage_test.sol

source: 2. Testing a method involving msg.sender
es: 2. Probar un método que implique msg.sender
fr_fr: 2. Tester une méthode impliquant <code>msg.sender</code>
it: 2. Testare un metodo che coinvolge msg.sender
zh_cn: 2.测试一个涉及msg.sender的方法

source: In Solidity, msg.sender plays a great role in access management of a smart contract methods interaction. Different msg.sender can help to test a contract involving multiple accounts with different roles. Here is an example for testing such case:
es: En Solidity, msg.sender desempeña un gran papel en la gestión del acceso a la interacción de los métodos de un contrato inteligente. Diferentes msg.sender pueden ayudar a probar un contrato que involucre múltiples cuentas con diferentes roles. He aquí un ejemplo para probar tal caso:
fr_fr: Dans Solidity, msg.sender joue un rôle important dans la gestion de l'accès à l'interaction des méthodes d'un contrat intelligent. Différents msg.sender peuvent aider à tester un contrat impliquant plusieurs comptes avec différents rôles. Voici un exemple pour tester un tel cas :
it: In Solidity, msg.sender svolge un ruolo importante nella gestione dell'accesso ai metodi di interazione di un contratto intelligente. Diversi msg.sender possono aiutare a testare un contratto che coinvolge più account con ruoli diversi. Ecco un esempio per testare questo caso:
zh_cn: 在 Solidity 中，msg.sender 在智能合约方法交互的访问管理中发挥着重要作用。 不同的 msg.sender 可以帮助测试涉及具有不同角色的多个账户的合约。 这是测试这种情况的示例：

source: Contract/Program to be tested: Sender.sol
es: Contrato/Programa a probar: Remitente.sol
fr_fr: Contrat/Programme à tester : Sender.sol
it: Contratto/Programma da testare: Sender.sol
zh_cn: 要测试的合约/程序：Sender.sol

source: Test contract/program: Sender_test.sol
es: Contrato/programa de prueba: Remitente_prueba.sol
fr_fr: Contrat/programme de test : Sender_test.sol
it: Testare del contratto/programma: Sender_test.sol
zh_cn: 测试合约/程序：Sender_test.sol

source: 3. Testing method execution
es: 3. Ejecución del método de prueba
fr_fr: 3. Exécution de la méthode d'essai
it: 3. Testare metodi di esecuzione
zh_cn: 3. 测试方法执行

source: With Solidity, one can directly verify the changes made by a method in storage by retrieving those variables from a contract. But testing for a successful method execution takes some strategy. Well that is not entirely true, when a test is successful - it is usually obvious why it passed. However, when a test fails, it is essential to understand why it failed.
es: Con Solidity, se pueden verificar directamente los cambios realizados por un método en el almacenamiento recuperando esas variables de un contrato. Pero comprobar que un método se ha ejecutado correctamente requiere cierta estrategia. Bueno, eso no es del todo cierto, cuando una prueba tiene éxito - por lo general es obvio por qué pasó. Sin embargo, cuando una prueba falla, es esencial comprender por qué falló.
fr_fr: Avec Solidity, on peut directement vérifier les changements effectués par une méthode dans le stockage en récupérant ces variables à partir d'un contrat. Mais tester l'exécution d'une méthode avec succès demande une certaine stratégie. Ce n'est pas tout à fait vrai, lorsqu'un test est réussi, il est généralement évident de comprendre pourquoi il l'a été. Cependant, lorsqu'un test échoue, il est essentiel de comprendre pourquoi il a échoué.
it: Con Solidity, si possono verificare direttamente le modifiche apportate da un metodo in archiviazione, recuperando le variabili da un contratto. Ma verificare che l'esecuzione di un metodo abbia successo richiede una certa strategia. Questo non è del tutto vero in realtà: quando un test ha successo, di solito è ovvio il motivo per cui è andato a buon fine. Tuttavia, quando un test fallisce, è essenziale capire perché è fallito.
zh_cn: 使用 Solidity，人们可以通过从合约中检索这些变量来直接验证存储中的方法所做的更改。 但是测试一个成功的方法执行需要一些策略。 好吧，这并不完全正确，当测试成功时-通常很明显为什么它通过了。 但是，当测试失败时，必须了解它失败的原因。

source: To help in such cases, Solidity introduced the try-catch statement in version 0.6.0. Previously, we had to use low-level calls to track down what was going on.
es: Para ayudar en estos casos, Solidity introdujo la sentencia try-catch en la versión 0.6.0. Anteriormente, teníamos que utilizar llamadas de bajo nivel para averiguar qué estaba pasando.
fr_fr: Pour aider dans de tels cas, Solidity a introduit l'instruction try-catch dans la version 0.6.0. Auparavant, nous devions utiliser des appels de bas niveau pour comprendre ce qui se passait.
it: Per aiutare in questi casi, nella versione 0.6.0 Solidity ha introdotto il comando try-catch. In precedenza, era necessario utilizzare invocazioni di basso livello per capire cosa stesse succedendo.
zh_cn: 为了在这种情况下提供帮助，Solidity 在 0.6.0 版本中引入了 try-catch 语句。 以前，我们必须使用低级调用来追踪正在发生的事情。

source: Here is an example test file that use both try-catch blocks and low level calls:
es: He aquí un archivo de prueba de ejemplo que utiliza tanto bloques try-catch como llamadas de bajo nivel:
fr_fr: Voici un exemple de fichier de test qui utilise à la fois des blocs try-catch et des appels de bas niveau :
it: Ecco un esempio di file di test che utilizza sia blocchi try-catch che invocazioni di basso livello:
zh_cn: 这是一个使用 try-catch 块和低级调用的示例测试文件：

source: Contract/Program to be tested: AttendanceRegister.sol
es: Contrato/Programa a probar: AttendanceRegister.sol
fr_fr: Contrat/Programme à tester : AttendanceRegister.sol
it: Contratto/Programma da testare: AttendanceRegister.sol
zh_cn: 要测试的合约/程序：AttendanceRegister.sol

source: Test contract/program: AttendanceRegister_test.sol
es: Contrato/programa de prueba: AttendanceRegister_test.sol
fr_fr: Contrat/programme de test : AttendanceRegister_test.sol
it: Test del contratto/programma: AttendanceRegister_test.sol
zh_cn: 测试合约/程序： AttendanceRegister_test.sol

source: 4. Testing a method involving msg.value
es: 4. Probar un método que implique msg.value
fr_fr: 4. Tester une méthode impliquant <code>msg.value</code>
it: 4. Test di un metodo che coinvolge msg.value
zh_cn: 4.测试一个涉及msg.value的方法

source: In Solidity, ether can be passed along with a method call which is accessed inside contract as msg.value. Sometimes, multiple calculations in a method are performed based on msg.value which can be tested with various values using Remix's Custom transaction context. See the example:
es: En Solidity, el éter puede pasarse junto con una llamada a un método al que se accede dentro del contrato como msg.value. A veces, se realizan múltiples cálculos en un método basándose en msg.value, que puede probarse con varios valores utilizando el contexto de transacción personalizado de Remix. Vea el ejemplo:
fr_fr: Dans Solidity, l'éther peut être passé avec un appel de méthode qui est accessible à l'intérieur du contrat en tant que msg.value. Parfois, plusieurs calculs dans une méthode sont effectués sur la base de msg.value qui peut être testé avec différentes valeurs en utilisant le contexte de transaction personnalisé de Remix. Voyez l'exemple :
it: In Solidity, Ether può essere passato insieme a una invocazione di metodo, a cui si accede all'interno del contratto come msg.value. A volte, più calcoli in un metodo vengono eseguiti sulla base di msg.value, che può essere testato con vari valori utilizzando il contesto di transazione personalizzato di Remix. Si veda l'esempio:
zh_cn: 在 Solidity 中，Eth可以与方法调用一起传递，该方法调用在合约内部作为 msg.value 访问。 有时，一个方法中的多个计算是基于 msg.value 执行的，可以使用 Remix 的自定义事务上下文使用各种值进行测试。 请参阅示例：
