Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: One can select/deselect the modules under which contract should be analyzed and can run the analysis again for last compiled contract by clicking on Run.
es: Se pueden seleccionar/deseleccionar los módulos bajo los que se debe analizar el contrato y se puede volver a ejecutar el análisis para el último contrato compilado pulsando en Ejecutar.
fr_fr: Vous pouvez sélectionner/désélectionner les modules sous lesquels le contrat doit être analysé et vous pouvez relancer l'analyse pour le dernier contrat compilé en cliquant sur Exécuter.
it: Si possono selezionare o meno i moduli con i quali analizzare il contratto e si può eseguire l'analisi nuovamente per l'ultimo contratto compilato cliccando su Esegui.
zh_cn: 可以 选择/取消 选择应分析合约的模块，并可以通过单击“运行”再次为上次编译的合约运行分析。

source: If you don't want to run analysis each time you compile a contract, just uncheck the checkbox near to Auto run.
es: Si no desea ejecutar el análisis cada vez que compile un contrato, sólo tiene que desmarcar la casilla situada junto a Ejecución automática.
fr_fr: Si vous ne souhaitez pas exécuter l'analyse à chaque fois que vous compilez un contrat, il vous suffit de décocher la case située à côté de Exécution automatique.
it: Se non vuoi eseguire l'analisi ogni volta che compili un contratto, togli la spunta alla casella di controllo vicino a Auto esegui.
zh_cn: 如果您不想在每次编译合约时都运行分析，只需取消选中 Auto run 附近的复选框即可。

source: Analysis Modules
es: Módulos de análisis
fr_fr: Modules d'analyse
it: Moduli Di Analisi
zh_cn: 分析模块

source: Currently, with Remix IDE v0.10.1, there are 21 analysis modules listed under 4 categories. Categories are: Security, Gas & Economy, ERC & Miscellaneous.
es: Actualmente, con Remix IDE v0.10.1, hay 21 módulos de análisis listados bajo 4 categorías. Las categorías son: Seguridad, Gas y Economía, ERC y Varios.
fr_fr: Actuellement, avec Remix IDE v0.10.1, il y a 21 modules d'analyse répertoriés dans 4 catégories. Ces catégories sont les suivantes : Sécurité, Gaz et économie, ERC et Divers.
it: Al momento con Remix IDE v0.10.1 ci sono 21 moduli di analisi elencati sotto 4 categorie. Le categorie sono: Sicurezza, Gas & Economia, ERC & Varie.
zh_cn: 目前，在 Remix IDE v0.10.1 中，共有 21 个分析模块列在 4 个类别下。 类别包括：安全、gas和经济、ERC 和其它。

source: Here is the list of modules under each category along with the example code which should be avoided or used very carefully while development:
es: He aquí la lista de módulos de cada categoría junto con el código de ejemplo que deben evitarse o utilizarse con sumo cuidado durante el desarrollo:
fr_fr: Voici la liste des modules de chaque catégorie ainsi que l'exemple de code à éviter ou à utiliser avec précaution lors du développement :
it: Qui c'è la lista dei moduli sotto a ogni categoria assieme a esempi di codice che dovrebbero essere evitati o utilizzati con molta cautela mentre si sviluppa:
zh_cn: 以下是每个类别下的模块列表以及在开发时应避免或非常小心使用的示例代码：

source: Category: Security
es: Categoría: Seguridad
fr_fr: Catégorie : Sécurité
it: Categoria: Sicurezza
zh_cn: 类别：安全

source: Transaction origin: 'tx.origin' is used
es: Origen de la transacción: se utiliza 'tx.origin
fr_fr: Origine de la transaction : "tx.origin" est utilisé
it: Origine della transazione: viene utilizzato 'tx.origin'
zh_cn: 交易来源：使用“tx.origin”

source: tx.origin is useful only in very exceptional cases. If you use it for authentication, you usually want to replace it by "msg.sender", because otherwise any contract you call can act on your behalf.
es: tx.origin sólo es útil en casos muy excepcionales. Si lo utiliza para la autenticación, normalmente querrá sustituirlo por "msg.sender", porque de lo contrario cualquier contrato al que llame podrá actuar en su nombre.
fr_fr: tx.origin n'est utile que dans des cas très exceptionnels. Si vous l'utilisez pour l'authentification, vous souhaitez généralement le remplacer par "msg.sender", car sinon tout contrat que vous appelez peut agir en votre nom.
it: tx.origin è utile solo in casi eccezionali. Se vuoi utilizzarlo per l'autenticazione, di solito vorrai rimpiazzarlo con "msg.sender" perché altrimenti ogni contratto che chiamerai agirà al posto tuo.
zh_cn: tx.origin 仅在非常特殊的情况下才有用。 如果您使用它进行身份验证，您通常希望将其替换为“msg.sender”，因为否则您调用的任何合约都可以代表您行事。

source: Example:
es: Ejemplo:
fr_fr: Exemple :
it: Esempio:
zh_cn: 示例：

source: Check effects: Potential reentrancy bugs
es: Compruebe los efectos: Posibles fallos de reentrada
fr_fr: Vérifier les effets : Bogues de réentrance potentiels
it: Effetti di controllo: Potenziali bug di reingresso
zh_cn: Check effects：潜在的重入错误

source: Potential Violation of Checks-Effects-Interaction pattern can lead to re-entrancy vulnerability.
es: La violación potencial del patrón Comprobaciones-Efectos-Interacción puede conducir a una vulnerabilidad de reentrada.
fr_fr: La violation potentielle du modèle Checks-Effects-Interaction peut entraîner une vulnérabilité de réentrance.
it: Potenziale Violazione del modello Interazione-Controllo-Effetto può portare a vulnerabilità di rientranza.
zh_cn: Checks-Effects-Interaction 模式的潜在违反可能导致重入漏洞。

source: Inline assembly: Inline assembly used
es: Montaje en línea: Montaje en línea utilizado
fr_fr: Assemblage en ligne : Assemblage en ligne utilisé
it: Assemblaggio in linea: Assemblaggio in linea utilizzato
zh_cn: Inline assembly：使用内联汇编

source: Use of inline assembly is advised only in rare cases.
es: Se aconseja utilizar el montaje en línea sólo en casos excepcionales.
fr_fr: L'utilisation de l'assemblage en ligne n'est conseillée que dans de rares cas.
it: Utilizzo di assemblaggio in linea è consigliato solo in casi rari.
zh_cn: 仅在极少数情况下建议使用内联汇编。

source: Block timestamp: Semantics maybe unclear
es: Marca de tiempo del bloque: Semántica quizá poco clara
fr_fr: Horodatage du bloc : La sémantique n'est peut-être pas claire
it: Timestamp del blocco: Semantica forse non chiara
zh_cn: Block timestamp：语义可能不清楚

source: now does not mean current time. now is an alias for block.timestamp. block.timestamp can be influenced by miners to a certain degree, be careful.
es: now no significa la hora actual. now es un alias de block.timestamp. block.timestamp puede estar influenciado por los mineros hasta cierto punto, tenga cuidado.
fr_fr: now ne signifie pas l'heure actuelle. now est un alias de block.timestamp. block.timestamp peut être influencé par les mineurs dans une certaine mesure, soyez prudent.
it: now non significa tempo corrente. now è un alias per block.timestamp. block.timestamp può essere influenzato dagli estrattori per certi versi, fai attenzione.
zh_cn: 现在并不意味着当前时间。 now 是 block.timestamp 的别名。 block.timestamp 会在一定程度上受到矿工的影响，请小心。

source: Low level calls: Semantics maybe unclear
es: Llamadas de bajo nivel: Semántica quizá poco clara
fr_fr: Appels de bas niveau : La sémantique n'est peut-être pas claire
it: Chiamate di basso livello: La semantica potrebbe non essere chiara
zh_cn: Low level calls：语义可能不清楚

source: Use of low level call, callcode or delegatecall should be avoided whenever possible. send does not throw an exception when not successful, make sure you deal with the failure case accordingly. Use transfer whenever failure of the ether transfer should rollback the whole transaction.
es: El uso de llamadas de bajo nivel, callcode o delegatecall debe evitarse siempre que sea posible. send no lanza una excepción cuando no tiene éxito, asegúrese de tratar el caso de fallo como corresponde. Utilice transfer siempre que el fallo de la transferencia de éter deba hacer retroceder toda la transacción.
fr_fr: L'utilisation d'un appel de bas niveau, d'un callcode ou d'un delegatecall doit être évitée dans la mesure du possible. send ne lève pas d'exception en cas d'échec, assurez-vous de traiter le cas d'échec en conséquence. Utilisez transfer lorsque l'échec du transfert d'éther doit annuler l'ensemble de la transaction.
it: Utilizza chiamate di basso livello, callcode o delegatecall dovrebbero essere evitate quando possibile. send non da un'eccezione quando non è riuscita, assicurati di procedere con i casi di fallimento come dovuto. Usa transfer ogni qualvolta un fallimento del trasferimento di ether debba fare il rollback dell'intera transazione.
zh_cn: 应尽可能避免使用低级调用、调用代码或委托调用。 send 不成功时不会抛出异常，请确保您相应地处理失败情况。 每当以太传输失败应回滚整个交易时，请使用传输。

source: Blockhash usage: Semantics maybe unclear
es: Uso del bloqueo: Semántica quizá poco clara
fr_fr: Utilisation de Blockhash : La sémantique n'est peut-être pas claire
it: Utilizzo di blockhash: La semantica potrebbe non essere chiara
zh_cn: Blockhash usage：语义可能不清楚

source: blockhash is used to access the last 256 block hashes. A miner computes the block hash by "summing up" the information in the current block mined. By summing up the information in a clever way a miner can try to influence the outcome of a transaction in the current block.
es: blockhash se utiliza para acceder a los últimos 256 hashes de bloque. Un minero calcula el hash del bloque "sumando" la información del bloque actual minado. Al sumar la información de forma inteligente, un minero puede intentar influir en el resultado de una transacción en el bloque actual.
fr_fr: blockhash est utilisé pour accéder aux 256 derniers hashs de blocs. Un mineur calcule le hachage du bloc en "résumant" les informations contenues dans le bloc en cours de minage. En résumant les informations de manière intelligente, un mineur peut tenter d'influencer le résultat d'une transaction dans le bloc en cours.
it: blockhash è utilizzato per accedere gli ultimi 256 blocchi di hash. Un estrattore computa il blocco di hash "sommando" l'informazione del blocco estratto corrente. Sommando le informazioni in modo intelligente un estrattore può cercare di influenzare il risultato di una transazione nel blocco corrente.
zh_cn: blockhash 用于访问最后 256 个块哈希。 矿工通过“summing up”当前开采的区块中的信息来计算区块哈希。 通过巧妙地总结信息，矿工可以尝试影响当前区块中交易的结果。

source: Selfdestruct: Beware of caller contracts
es: Autodestrucción: Cuidado con los contratos de llamadas
fr_fr: Autodestruction : Méfiez-vous des contrats d'appel
it: Autodistruzione: Fai attenzione ai contratti chiamanti
zh_cn: Selfdestruct：当心调用者合约

source: selfdestruct can block calling contracts unexpectedly. Be especially careful if this contract is planned to be used by other contracts (i.e. library contracts, interactions). Selfdestruction of the callee contract can leave callers in an inoperable state.
es: La autodestrucción puede bloquear contratos de llamada de forma inesperada. Tenga especial cuidado si está previsto que este contrato sea utilizado por otros contratos (por ejemplo, contratos de biblioteca, interacciones). La autodestrucción del contrato llamante puede dejar a los contratos llamantes en un estado inoperativo.
fr_fr: L'autodestruction peut bloquer les contrats appelants de manière inattendue. Soyez particulièrement vigilant si ce contrat est prévu pour être utilisé par d'autres contrats (par exemple, des contrats de bibliothèque, des interactions). L'autodestruction du contrat de l'appelant peut laisser les appelants dans un état inopérant.
it: selfdestruct può bloccare la chiamata dei contratti inaspettatamente. Fai specialmente attenzione se è previsto l'utilizzo di questo contratto da altri contratti (es. una libreria di contratti, interazioni). La distruzione dello stesso contratto chiamante potrebbe lasciare i chiamanti in uno stato di inoperabilità.
zh_cn: selfdestruct 可以意外阻止调用合约。 如果该合约计划被其他合约(即 程序库合约、交互)使用，请特别小心。 被调用者合约的自毁可能会使调用者处于不可操作状态。

source: Category: Gas & Economy
es: Categoría: Gas y economía
fr_fr: Catégorie : Gaz et économie
it: Categoria: Gas & Economia
zh_cn: 类别：gas与经济

source: Gas costs: Too high gas requirement of functions
es: Costes de gas: Demasiado alto requerimiento de gas de las funciones
fr_fr: Coûts du gaz : Besoins en gaz trop élevés pour les fonctions
it: Costi del gas: Il gas richiesto dalle transazioni è troppo alto
zh_cn: Gas costs：对 gas 功能要求很高

source: If the gas requirement of a function is higher than the block gas limit, it cannot be executed. Please avoid loops in your functions or actions that modify large areas of storage
es: Si la necesidad de gas de una función es superior al límite de gas del bloque, no podrá ejecutarse. Por favor, evite bucles en sus funciones o acciones que modifiquen grandes áreas de almacenamiento
fr_fr: Si le besoin en gaz d'une fonction est supérieur à la limite de gaz du bloc, elle ne peut pas être exécutée. Veuillez éviter les boucles dans vos fonctions ou les actions qui modifient de grandes zones de stockage.
it: Se il gas richiesto da una funzione è più alto del limite del gas per il blocco, non può essere eseguita. Per favore evita dei loop nelle tue funzioni o azioni che modifichino grandi parte della memoria
zh_cn: 如果一个函数的gas需求高于block gas limit，它就不能被执行。 请避免在修改大面积存储的函数或操作中出现循环

source: This on local calls: Invocation of local functions via 'this'
es: Esto en las llamadas locales: Invocación de funciones locales a través de 'this'
fr_fr: This sur les appels locaux : Invocation de fonctions locales via "this
it: This nelle chiamate locali: L'invocazione di funzioni locali con "this"
zh_cn: 本地调用上的 this：通过 'this' 调用本地函数

source: Never use this to call functions in the same contract, it only consumes more gas than normal local calls.
es: Nunca lo utilice para llamar a funciones del mismo contrato, sólo consume más gasolina que las llamadas locales normales.
fr_fr: Ne l'utilisez jamais pour appeler des fonctions dans le même contrat, cela ne fait que consommer plus de gaz que les appels locaux normaux.
it: Non utilizzare this per chiamare funzioni nello stesso contratto, consuma più gas delle chiamate locali normali.
zh_cn: 永远不要使用它来调用同一个合约中的函数，它只会比普通的本地调用消耗更多的gas。

source: Delete on dynamic Array: Use require/assert appropriately
es: Borrar en Array dinámico: Utilice require/assert adecuadamente
fr_fr: Supprimez les tableaux dynamiques : Utilisez require/assert de manière appropriée
it: Eliminare su Array dinamici: Utilizza require/assert in modo appropriato
zh_cn: 删除动态数组：适当使用 require/assert

source: The delete operation when applied to a dynamically sized array in Solidity generates code to delete each of the elements contained. If the array is large, this operation can surpass the block gas limit and raise an OOG exception. Also nested dynamically sized objects can produce the same results.
es: La operación de borrado cuando se aplica a un array de tamaño dinámico en Solidity genera código para borrar cada uno de los elementos contenidos. Si el array es grande, esta operación puede sobrepasar el límite de gas del bloque y lanzar una excepción OOG. También los objetos anidados de tamaño dinámico pueden producir los mismos resultados.
fr_fr: L'opération de suppression appliquée à un tableau de taille dynamique dans Solidity génère du code pour supprimer chacun des éléments qu'il contient. Si le tableau est de grande taille, cette opération peut dépasser la limite de gaz du bloc et soulever une exception OOG. Des objets imbriqués de taille dynamique peuvent également produire les mêmes résultats.
it: L'operazione di eliminazione quando applicata ad array di grandezza dinamica in Solidity generano codice per cancellare ognuno degli elementi contenuti. Se l'array è grande, questa operazione può sorpassare il limite del gas per blocco e segnalare un'eccezione OOG. Anche oggetti di grandezza dinamica nidificati possono produrre gli stessi risultati.
zh_cn: 当应用于 Solidity 中动态大小的数组时，删除操作会生成代码以删除包含的每个元素。 如果数组很大，此操作可能会超过块gas限制并引发 OOG 异常。 嵌套的动态大小的对象也可以产生相同的结果。

source: For loop over dynamic array: Iterations depend on dynamic array's size
es: Bucle For sobre matriz dinámica: Las iteraciones dependen del tamaño de la matriz dinámica
fr_fr: Boucle For sur un tableau dynamique : Les itérations dépendent de la taille du tableau dynamique
it: Il loop for su array dinamici: Le iterazioni dipendono dalla grandezza dell'array dinamico
zh_cn: For 循环遍历动态数组：迭代取决于动态数组的大小

source: Loops that do not have a fixed number of iterations, for example, loops that depend on storage values, have to be used carefully: Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can stall the complete contract at a certain point. Additionally, using unbounded loops can incur in a lot of avoidable gas costs. Carefully test how many items at maximum you can pass to such functions to make it successful.
es: Los bucles que no tienen un número fijo de iteraciones, por ejemplo, los bucles que dependen de valores de almacenamiento, deben utilizarse con cuidado: Debido al límite de gas en bloque, las transacciones sólo pueden consumir una determinada cantidad de gas. El número de iteraciones de un bucle puede crecer más allá del límite de gas de bloque, lo que puede paralizar el contrato completo en un momento dado. Además, utilizar bucles no limitados puede acarrear muchos gastos de gas evitables. Pruebe cuidadosamente cuántos elementos como máximo puede pasar a dichas funciones para que tenga éxito.
fr_fr: Les boucles qui n'ont pas un nombre fixe d'itérations, par exemple les boucles qui dépendent des valeurs de stockage, doivent être utilisées avec précaution : En raison de la limite de gaz par bloc, les transactions ne peuvent consommer qu'une certaine quantité de gaz. Le nombre d'itérations dans une boucle peut dépasser la limite de gaz par bloc, ce qui peut bloquer le contrat complet à un certain moment. En outre, l'utilisation de boucles non bornées peut entraîner de nombreux coûts de gaz qui pourraient être évités. Testez soigneusement le nombre maximum d'éléments que vous pouvez transmettre à ces fonctions pour qu'elles soient efficaces.
it: Loop che non hanno un numero fisso di iterazioni, per esempio, loop che dipendono da valori di memoria, devono essere utilizzati con cautela: A causa del limite del gas per blocco, le transazioni possono solo consumare un certo ammontare di gas. Il numero di iterazioni in un loop può crescere oltre il limite del gas per bloco il che può fermare l'intero contratto a un certo punto. Inoltre, utilizzare loop senza limiti può incorrere in molti costi del gas evitabili. Testa con cautela quanti elementi al massimo puoi passare in una certa funzione per eseguirla con successo.
zh_cn: 没有固定迭代次数的循环，例如依赖于存储值的循环，必须谨慎使用：由于区块gas限制，交易只能消耗一定量的gas。 循环中的迭代次数可能会超过区块gas限制，这可能会在某个点停止完整的合约。 此外，使用无界循环会产生大量可避免的 gas 成本。 仔细测试您最多可以将多少项传递给此类函数以使其成功。

source: Ether transfer in loop: Transferring Ether in a for/while/do-while loop
es: Transferencia de éter en bucle: Transferencia de éter en un bucle for/while/do-while
fr_fr: Transfert d'Ether dans une boucle : Transfert d'Ether dans une boucle for/while/do-while
it: Trasferimenti di ether in loop: Trasferire Ether in un loop for/while/do-while
zh_cn: 循环中的ETH转移：在 for/while/do-while 循环中转移ETH

source: Ether payout should not be done in a loop. Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can cause the complete contract to be stalled at a certain point. If required, make sure that number of iterations are low and you trust each address involved.
es: El pago de éter no debe realizarse en bucle. Debido al límite de gas en bloque, las transacciones sólo pueden consumir una determinada cantidad de gas. El número de iteraciones en un bucle puede crecer más allá del límite de gas de bloque, lo que puede provocar que el contrato completo se paralice en un momento determinado. Si es necesario, asegúrese de que el número de iteraciones es bajo y de que confía en cada una de las direcciones implicadas.
fr_fr: Le paiement des éthers ne doit pas être effectué en boucle. En raison de la limite de gaz par bloc, les transactions ne peuvent consommer qu'une certaine quantité de gaz. Le nombre d'itérations dans une boucle peut dépasser la limite de gaz par bloc, ce qui peut entraîner le blocage du contrat complet à un certain moment. Le cas échéant, assurez-vous que le nombre d'itérations est faible et que vous faites confiance à chaque adresse concernée.
it: Il pagamento di Ether non dovrebbe essere effettuato in un ciclo. A causa del limite di carburante dei blocchi, le transazioni possono consumare solo una certa quantità di carburante. Il numero di iterazioni in un ciclo può crescere oltre il limite di carburante dei blocchi, causando lo stallo completo del contratto a un certo punto. Se necessario, assicurati che il numero di iterazioni sia basso e che ti possa fidare di ogni indirizzo coinvolto.
zh_cn: 以太币支付不应循环进行。 由于区块gas限制，交易只能消耗一定量的gas。 循环中的迭代次数可能会超过区块gas限制，这可能导致整个合约在某个点停滞不前。 如果需要，请确保迭代次数较少并且您信任所涉及的每个地址。

source: Category: ERC
es: Categoría: ERC
fr_fr: Catégorie : ERC
it: Categoria: ERC
zh_cn: 类别：ERC

source: ERC20: 'decimals' should be 'uint8'
es: ERC20: 'decimals' debería ser 'uint8'
fr_fr: ERC20 : "decimals" devrait être "uint8".
it: ERC20: 'decimals' dovrebbero essere 'uint8'
zh_cn: ERC20：'decimals' 应该是 'uint8'

source: ERC20 Contracts decimals function should have uint8 as return type.
es: La función de decimales de los Contratos ERC20 debería tener uint8 como tipo de retorno.
fr_fr: La fonction decimals de l'ERC20 Contracts devrait avoir uint8 comme type de retour.
it: La funzione "decimals" dei contratti ERC20 dovrebbe avere uint8 come tipo di ritorno.
zh_cn: ERC20 合约小数函数应该有 uint8 作为返回类型。

source: Category: Miscellaneous
es: Categoría: Varios
fr_fr: Catégorie : Divers
it: Categoria: Varie
zh_cn: 类别：其它

source: Constant/View/Pure functions: Potentially constant/view/pure functions
es: Funciones constantes/vistas/puras: Funciones potencialmente constantes/vistas/puras
fr_fr: Fonctions constantes/vues/pures : Fonctions potentiellement constantes/vues/pures
it: Funzioni costanti/vista/pure: Potenzialmente funzioni costanti/vista/pure
zh_cn: Constant/View/Pure 函数：潜在的Constant/View/Pure 函数

source: It warns for the methods which potentially should be constant/view/pure but are not.
es: Advierte de los métodos que potencialmente deberían ser constantes/vistos/puros pero no lo son.
fr_fr: Il met en garde contre les méthodes qui devraient potentiellement être constantes/visibles/pures mais qui ne le sont pas.
it: Avverte dei metodi che potenzialmente dovrebbero essere costanti/visibili/puri ma non lo sono.
zh_cn: 它警告那些可能应该是 constant/view/pure 但不是的方法。

source: Similar variable names: Variable names are too similar
es: Nombres de variables similares: Los nombres de las variables son demasiado similares
fr_fr: Noms de variables similaires : Les noms de variables sont trop similaires
it: Nomi di variabili simili: I nomi delle variabili sono troppo simili
zh_cn: Similar variable names：变量名太相似

source: It warns on the usage of similar variable names.
es: Advierte sobre el uso de nombres de variables similares.
fr_fr: Il met en garde contre l'utilisation de noms de variables similaires.
it: Avverte dell'uso di nomi di variabili simili.
zh_cn: 它警告使用类似的变量名。

source: No return: Function with 'returns' not returning
es: Sin retorno: Función con 'returns' no devuelve
fr_fr: Pas de retour : La fonction avec des "retours" n'est pas retournée
it: Nessun ritorno: La funzione con 'returns' non ritorna
zh_cn: No return：带有“返回”的函数不返回

source: It warns for the methods which define a return type but never explicitly return a value.
es: Advierte de los métodos que definen un tipo de retorno pero nunca devuelven explícitamente un valor.
fr_fr: Il met en garde contre les méthodes qui définissent un type de retour mais ne renvoient jamais explicitement une valeur.
it: Mette in guardia sui metodi che definiscono un tipo di ritorno, ma che non restituiscono mai esplicitamente un valore.
zh_cn: 它警告定义返回类型但从不显式返回值的方法。
