Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Using Deploy or At Address is a classic use case of Remix. However, it is possible to interact with a contract by using its ABI. The ABI is a JSON array which describe its interface.
es: Utilizar Deploy o At Address es un caso de uso clásico de Remix. Sin embargo, es posible interactuar con un contrato utilizando su ABI. La ABI es una matriz JSON que describe su interfaz.
fr_fr: L'utilisation de Deploy ou At Address est un cas d'utilisation classique de Remix. Cependant, il est possible d'interagir avec un contrat en utilisant son ABI. L'ABI est un tableau JSON qui décrit son interface.
it: Utilizzando Deploy o At Address è un utilizzo classico di Remix. In ogni caso è possibile interagire con un contratto utilizzando il suo ABI. L'ABI è un array JSON che ne descrive l'interfaccia.
zh_cn: 使用 Deploy 或 At Address 是 Remix 的一个经典用例。 但是，可以使用合约的 ABI 与合约进行交互。 ABI 是一个描述其接口的 JSON 数组。

source: To interact with a contract using the ABI, create a new file in Remix with extension *.abi and copy the ABI content to it. Then, in the input next to At Address, put the Address of the contract you want to interact with. Click on At Address, a new "connection" with the contract will popup below.
es: Para interactuar con un contrato utilizando la ABI, cree un nuevo archivo en Remix con extensión *.abi y copie en él el contenido de la ABI. A continuación, en la entrada situada junto a At Address, ponga la dirección del contrato con el que desea interactuar. Haga clic en At Address, a continuación aparecerá una nueva "conexión" con el contrato.
fr_fr: Pour interagir avec un contrat à l'aide de l'ABI, créez un nouveau fichier dans Remix avec l'extension *.abi et copiez-y le contenu de l'ABI. Ensuite, dans la zone de saisie située à côté de At Address, indiquez l'adresse du contrat avec lequel vous souhaitez interagir. Cliquez sur At Address, une nouvelle "connexion" avec le contrat apparaîtra ci-dessous.
it: Per interagire con un contratto utilizzando l'ABI, crea un nuovo file in Remix con estensione *.abi e copia il contenuto ABI all'interno di esso. Poi, nell'input vicino a At Address metti l'Indirizzo del contratto con cui vuoi interagire. Clicca su At Address e una nuova "connessione" con il contratto apparirà sotto.
zh_cn: 要使用 ABI 与合约交互，请在 Remix 中创建一个扩展名为 *.abi 的新文件，并将 ABI 内容复制到其中。 然后，在 At Address 旁边的输入中，输入您要与之交互的合约的地址。 点击地址，下面会弹出一个与合约的新“连接”。

source: Using the Recorder
es: Uso de la grabadora
fr_fr: Utilisation de l'enregistreur
it: Utilizzare il Registratore
zh_cn: 使用记录器

source: The Recorder is a tool used to save a bunch of transactions in a JSON file and rerun them later either in the same environment or in another.
es: El grabador es una herramienta que se utiliza para guardar un grupo de transacciones en un archivo JSON y volver a ejecutarlas más tarde, ya sea en el mismo entorno o en otro.
fr_fr: L'enregistreur est un outil utilisé pour enregistrer un ensemble de transactions dans un fichier JSON et les réexécuter plus tard, soit dans le même environnement, soit dans un autre.
it: Il Registratore è uno strumento utilizzato per salvare un tot di transazioni in un file JSON e ritornarle più tardi nello stesso ambiente o in un altro.
zh_cn: Recorder 是一种工具，用于将一堆事务保存在 JSON 文件中，然后在同一环境或另一个环境中重新运行它们。

source: Saving to the JSON file ( by default its called scenario.json) allows one to easily check the transaction list, tweak input parameters, change linked library, etc...
es: Guardar en el archivo JSON (por defecto se llama scenario.json) permite comprobar fácilmente la lista de transacciones, ajustar los parámetros de entrada, cambiar la biblioteca vinculada, etc.
fr_fr: L'enregistrement dans le fichier JSON (appelé par défaut scenario.json) permet de vérifier facilement la liste des transactions, d'ajuster les paramètres d'entrée, de changer la bibliothèque liée, etc...
it: Salvare nel file JSON (di default è chiamato scenario.json) ti permette di controllare facilmente l'elenco delle transazioni, aggiustare i parametri inseriti, cambiare le librerie collegate, ecc...
zh_cn: 保存到 JSON 文件(默认情况下，它称为scenario.json)允许人们轻松检查事务列表、调整输入参数、更改链接库等......

source: There are many use cases for the recorder.
es: Hay muchos casos de uso para la grabadora.
fr_fr: L'enregistreur peut être utilisé dans de nombreux cas.
it: Ci sono vari utilizzi per il registratore.
zh_cn: 记录器有很多用例。

source: For instance:
es: Por ejemplo:
fr_fr: Par exemple :
it: Per esempio:
zh_cn: 例如：

source: After having coded and tested contracts in a constrained environment (like the JavaScript VM), you could then change the environment and redeploy it to a more realistic environment like a test net with an injected web3 or to a Geth node. By using the generated scenario.json file, you will be using all the same settings that you used in the Javascript VM. And this mean that you won't need to click the interface 100 times or whatever to get the state that you achieved originally. So the recorder could be a tool to protect your sanity.
es: Después de haber codificado y probado los contratos en un entorno restringido (como la VM Javascript), podría cambiar el entorno y volver a desplegarlo en un entorno más realista como una red de prueba con una web3 inyectada o en un nodo Geth. Al utilizar el archivo scenario.json generado, estará utilizando todos los mismos ajustes que utilizó en la VM Javascript. Y esto significa que no necesitará hacer clic en la interfaz 100 veces o lo que sea para obtener el estado que consiguió originalmente. Así que la grabadora podría ser una herramienta para proteger su cordura.
fr_fr: Après avoir codé et testé des contrats dans un environnement contraint (comme la VM JavaScript), vous pouvez changer l'environnement et le redéployer dans un environnement plus réaliste comme un réseau de test avec un web3 injecté ou un nœud Geth. En utilisant le fichier scenario.json généré, vous utiliserez tous les mêmes paramètres que ceux utilisés dans la VM JavaScript. Cela signifie que vous n'aurez pas besoin de cliquer 100 fois sur l'interface pour obtenir l'état que vous avez obtenu à l'origine. L'enregistreur pourrait donc être un outil pour protéger votre santé mentale.
it: Dopo aver codificato e testato i contratti in un ambiente costretto (come la VM JavaScript), puoi quindi cambiare l'ambiente e ridistribuirlo a un ambiente più realistico come ad esempio una rete di test con web3 iniettato o a un nodo Geth. Utilizzando il file generato scenario.json, utilizzerai tutti le stesse impostazioni che utilizzi nella VM Javascript. E questo significa che non avrai bisogno di cliccare l'interfaccia 100 volte o quant'altro per ottenere lo stato che avevi raggiunto originariamente. Quindi il registratore può essere uno strumento per salvare la tua sanità mentale.
zh_cn: 在受限环境(如 JavaScript VM)中对合约进行编码和测试后，您可以更改环境并将其重新部署到更现实的环境中，例如注入 web3 的测试网或 Geth 节点。 通过使用生成的scenario.json 文件，您将使用在Javascript VM 中使用的所有相同设置。 这意味着您无需单击界面 100 次或其他任何操作即可获得最初达到的状态。 所以记录器可以成为保护你理智的工具。

source: You can also change the settings in the scenario.json file to customize the playback.
es: También puede cambiar los ajustes del archivo scenario.json para personalizar la reproducción.
fr_fr: Vous pouvez également modifier les paramètres du fichier scenario.json pour personnaliser la lecture.
it: Puoi anche cambiare le impostazioni nel file scenario.json e personalizzare la riproduzione.
zh_cn: 您还可以更改scenario.json 文件中的设置来自定义播放。

source: Deploying contract does often require more than creating one transaction and so the recorder will automate this deployment.
es: El despliegue de un contrato suele requerir más que la creación de una transacción, por lo que el registrador automatizará este despliegue.
fr_fr: Le déploiement d'un contrat nécessite souvent plus que la création d'une transaction et l'enregistreur automatise donc ce déploiement.
it: Distribuire un contratto spesso richiede più di creare una transazione, e quindi il registratore automatizzerà questa distribuzione.
zh_cn: 部署合约通常需要的不仅仅是创建一个事务，因此记录器将自动执行此部署。

source: Working in a dev environment often requires to setup the state in a first place.
es: Trabajar en un entorno dev requiere a menudo configurar el estado en primer lugar.
fr_fr: Travailler dans un environnement de développement nécessite souvent de configurer l'état en premier lieu.
it: Lavorare in un ambiente dev spesso richiede di impostare uno stato inizialmente.
zh_cn: 在开发环境中工作通常需要首先设置状态。

source: scenario.json
es: escenario.json

source: To create this file in the recorder, you first of course need to have run some transactions. In the image above - it has a 0 next to Transactions Recorded. So this isn't the right moment to save transactions because - well because there aren't any. Each time you make a transaction, that number will increment. Then when you are ready, click the floppy disk icon and the scenario.json file will be created.
es: Para crear este archivo en el registrador, primero necesita, por supuesto, haber realizado algunas transacciones. En la imagen de arriba - tiene un 0 junto a Transacciones registradas. Así que este no es el momento adecuado para grabar transacciones porque - bueno porque no hay ninguna. Cada vez que realice una transacción, ese número se incrementará. Entonces, cuando esté listo, haga clic en el icono del disquete y se creará el archivo scenario.json.
fr_fr: Pour créer ce fichier dans l'enregistreur, vous devez bien entendu avoir effectué quelques transactions. Dans l'image ci-dessus, il y a un 0 à côté de Transactions enregistrées. Ce n'est donc pas le bon moment pour enregistrer des transactions, parce que - eh bien, parce qu'il n'y en a pas. Chaque fois que vous effectuez une transaction, ce nombre s'incrémente. Lorsque vous êtes prêt, cliquez sur l'icône de la disquette et le fichier scenario.json sera créé.
it: Per creare questo file nel registratore naturalmente devi aver prima eseguito alcune transazioni. Nell'immagine sopra - ha uno 0 vicino a Transazioni Registrate. Quindi non è il momento giusto per salvare le transazioni perché - beh perché non ce ne sono. Ogni volta che fai una transazione, quel numero aumenterà. Poi quando vuoi, clicca nell'icona floppy disk e il file scenario.json verrà creato.
zh_cn: 要在记录器中创建此文件，您首先当然需要运行一些事务。 在上图中 - 记录的交易旁边有一个 0。 所以现在不是保存交易的正确时机，因为——好吧，因为没有交易。 每次您进行交易时，该数字都会增加。 然后当你准备好时，点击软盘图标，就会创建scenario.json文件。

source: The JSON file below is an example of the scenario.json file.
es: El siguiente archivo JSON es un ejemplo del archivo scenario.json.
fr_fr: Le fichier JSON ci-dessous est un exemple du fichier scenario.json.
it: Il file JSON sottostante è un esempio del file scenario.json.
zh_cn: 下面的 JSON 文件是 scenario.json 文件的一个示例。

source: In it, 3 transactions are executed:
es: En él se ejecutan 3 transacciones:
fr_fr: Trois transactions y sont exécutées :
it: In esso sono eseguite 3 transazioni:
zh_cn: 在其中，执行了 3 个事务：

source: The first corresponds to the deployment of the lib testLib.
es: La primera corresponde al despliegue de la lib testLib.
fr_fr: La première correspond au déploiement de la librairie testLib.
it: Il primo corrisponde alla distribuzione della libreria testLib.
zh_cn: 第一个对应lib testLib的部署。

source: The second corresponds to the deployment of the contract test with the first parameter of the constructor set to 11. That contract depends on a library. The linkage is done using the property linkReferences. In that case we use the address of the previously created library : created{1512830014773}. The number is the id (timestamp) of the transaction that led to the creation of the library.
es: El segundo corresponde al despliegue del contrato prueba con el primer parámetro del constructor fijado en 11. Ese contrato depende de una biblioteca. La vinculación se realiza mediante la propiedad linkReferences. En ese caso utilizamos la dirección de la biblioteca previamente creada : creada{1512830014773}. El número es el id (marca de tiempo) de la transacción que llevó a la creación de la biblioteca.
fr_fr: Le second correspond au déploiement du contrat test dont le premier paramètre du constructeur est fixé à 11. Ce contrat dépend d'une bibliothèque. Le lien est fait en utilisant la propriété linkReferences. Dans ce cas, nous utilisons l'adresse de la bibliothèque précédemment créée : created{1512830014773}. Le numéro est l'identifiant (horodatage) de la transaction qui a conduit à la création de la bibliothèque.
it: Il secondo corrisponde alla distribuzione del contratto di test con il primo parametro del costrutto impostato a 11. Quel contratto dipende da una libreria. Il collegamento è fatto utilizzando la proprietà linkReferences. In quel caso utilizziamo l'indirizzo della libreria creata in precedenza: created{1512830014773}. Il numero è l'id (timestamp) della transazione che ha portato alla creazione della libreria.
zh_cn: 第二个对应于合约测试的部署，构造函数的第一个参数设置为 11。该合约依赖于一个库。 链接是使用属性 linkReferences 完成的。 在这种情况下，我们使用之前创建的库的地址：created{1512830014773}。 该数字是导致创建库的事务的 Id(时间戳)。

source: The third record corresponds to the call to the function set of the contract test (the property to is set to: created{1512830015080}) . Input parameters are 1 and 0xca35b7d915458ef540ade6068dfe2f44e8fa733c
es: El tercer registro corresponde a la llamada al conjunto de funciones de la prueba de contrato (la propiedad to se establece en: created{1512830015080}) . Los parámetros de entrada son 1 y 0xca35b7d915458ef540ade6068dfe2f44e8fa733c
fr_fr: Le troisième enregistrement correspond à l'appel à la fonction set du contrat test (la propriété to est fixée à : created{1512830015080}). Les paramètres d'entrée sont 1 et 0xca35b7d915458ef540ade6068dfe2f44e8fa733c
it: Il terzo record corrisponde alla chiamata della funzione impostata nel contratto di test (la proprietà è impostata a: created{1512830015080}). I parametri di input sono 1 e 0xca35b7d915458ef540ade6068dfe2f44e8fa733c
zh_cn: 第三条记录对应合约测试的函数集的调用(属性to设置为：created{1512830015080})。 输入参数为 1 和 0xca35b7d915458ef540ade6068dfe2f44e8fa733c

source: All these transactions are created using the value of the accounts account{0}.
es: Todas estas transacciones se crean utilizando el valor de la cuenta{0}.
fr_fr: Toutes ces transactions sont créées en utilisant la valeur du compte{0}.
it: Tutte le transazioni sono create utilizzando il valore degli account account{0}.
zh_cn: 所有这些交易都是使用账户 account{0} 的值创建的。

source: Settings
es: Ajustes
fr_fr: Paramètres
it: Impostazioni
zh_cn: 设置

source: To get to Settings click the gear a the very bottom of the icon panel.
es: Para acceder a Ajustes, haga clic en el engranaje situado en la parte inferior del panel de iconos.
fr_fr: Pour accéder aux paramètres, cliquez sur la roue dentée située tout en bas du panneau d'icônes.
it: Per arrivare a Impostazioni clicca sulla rotella proprio alla fine del pannello delle icone.
zh_cn: 要进入设置，请单击图标面板最底部的齿轮。

source: You can find a link to the homepage (if you closed it) as well as a link to our Gitter Channel and for you aesthetes out there, we now have a rather large list of themes.
es: Puede encontrar un enlace a la página de inicio (si la cerró), así como un enlace a nuestro canal Gitter y, para los estetas que andan por ahí, ahora tenemos una lista bastante amplia de temas.
fr_fr: Vous pouvez trouver un lien vers la page d'accueil (si vous l'avez fermée) ainsi qu'un lien vers notre canal Gitter et pour les esthètes, nous avons maintenant une liste assez large de thèmes.
it: Puoi trovare il collegamento alla pagina iniziale (se l'hai chiusa) e anche il link al nostro Canale Gitter e per gli esteti là fuori abbiamo ora un elenco di temi abbastanza grande.
zh_cn: 您可以找到指向主页的链接(如果您关闭了它) 以及指向我们的 Gitter 频道的链接，对于那些在那里的美学家来讲，我们现在有一个相当大的主题列表。

source: Another important settings:
es: Otra configuración importante:
fr_fr: Un autre paramètre important :
it: Altre impostazioni importanti:
zh_cn: 另一个重要设置：

source: Text wrap: controls if the text in the editor should be wrapped.
es: Ajuste de texto: controla si el texto en el editor debe ser ajustado.
fr_fr: Enveloppe du texte : permet de contrôler si le texte dans l'éditeur doit être enveloppé.
it: Text wrap: controlla se il testo nell'editor debba essere avvolto.
zh_cn: 文本换行：控制编辑器中的文本是否应换行。

source: Enable optimization: defines if the compiler should enable optimization during compilation. Enabling this option saves execution gas. It is useful to enable optimization for contracts ready to be deployed in production but could lead to some inconsistencies when debugging such a contract.
es: Activar optimización: define si el compilador debe activar la optimización durante la compilación. Activar esta opción ahorra gas de ejecución. Es útil habilitar la optimización para los contratos listos para ser desplegados en producción, pero podría dar lugar a algunas incoherencias al depurar un contrato de este tipo.
fr_fr: Activer l'optimisation : définit si le compilateur doit activer l'optimisation pendant la compilation. L'activation de cette option permet d'économiser du gaz d'exécution. Il est utile d'activer l'optimisation pour les contrats prêts à être déployés en production, mais cela peut entraîner des incohérences lors du débogage d'un tel contrat.
it: Abilita l'ottimizzazione: definisce se il compilatore debba abilitare l'ottimizzazione durante la compilazione. Abilitare quest'opzione risparmia gas di esecuzione. È utile abilitare l'ottimizzazione per contratti pronti per essere distribuiti in produzione ma potrebbe portare ad alcune incosistenze quando si fa il debugging di questi contratti.
zh_cn: 启用优化：定义编译器是否应在编译期间启用优化。 启用此选项可节省执行gas。 为准备在生产中部署的合约启用优化很有用，但在调试此类合约时可能会导致一些不一致。

source: Solidity Editor
es: Editor de solidez
it: Editore Solidity
zh_cn: Solidity 编译器

source: The Remix editor recompiles the code each time the current file is changed or another file is selected. It also provides syntax highlighting mapped to solidity keywords.
es: El editor Remix recompila el código cada vez que se modifica el archivo actual o se selecciona otro archivo. También proporciona resaltado de sintaxis asignado a palabras clave de solidez.
fr_fr: L'éditeur Remix recompile le code chaque fois que le fichier en cours est modifié ou qu'un autre fichier est sélectionné. Il fournit également une mise en évidence de la syntaxe en fonction des mots-clés de Solidity.
it: L'editor di Remix ricompila il codice ogni volta che il file corrente viene cambiato o quando un altro file è selezionato. Fornisce inoltre l'evidenziamento della sintassi, mappata a parole chiave di solidity.
zh_cn: 每次更改当前文件或选择另一个文件时，Remix 编辑器都会重新编译代码。 它还提供映射到可靠关键字的语法突出显示。

source: Here's the list of some important features:
es: He aquí la lista de algunas características importantes:
fr_fr: Voici la liste de quelques caractéristiques importantes :
it: Qui c'è l'elenco di alcune caratteristiche importanti:
zh_cn: 以下是一些重要功能的列表：

source: It display opened files as tabs.
es: Muestra los archivos abiertos como pestañas.
fr_fr: Il affiche les fichiers ouverts sous forme d'onglets.
it: Mostra i file aperti come schede.
zh_cn: 它将打开的文件显示为选项卡。

source: Compilation Warning and Error are displayed in the gutter
es: La advertencia y el error de compilación se muestran en la cuneta
fr_fr: Les avertissements et les erreurs de compilation sont affichés dans la gouttière.
it: Avvisi di Compilazione ed Errori sono visualizzati nel riquadro
zh_cn: 编译警告和错误显示在装订线中

source: Remix saves the current file continuously (5s after the last changes)
es: Remix guarda el archivo actual de forma continua (5s después de los últimos cambios)
fr_fr: Remix enregistre le fichier actuel en continu (5s après les dernières modifications)
it: Remix salva costantemente il file corrente (5s dopo l'ultima modifica)
zh_cn: Remix 连续保存当前文件(最后一次更改后 5 秒)

source: +/- on the top left corner enable you to increase/decrease the font size of the editor
es: +/- en la esquina superior izquierda le permiten aumentar/disminuir el tamaño de letra del editor
fr_fr: Les touches +/- situées dans le coin supérieur gauche vous permettent d'augmenter/diminuer la taille de la police de l'éditeur.
it: +/- nell'angolo in alto a sinistra ti permette di aumentare/diminuire la grandezza del font dell'editor
zh_cn: 左上角的 +/- 使您可以增加/减少编辑器的字体大小

source: Solidity Static Analysis
es: Análisis estático Solidity
fr_fr: Analyse statique de Solidity
it: Analisi Statica di Solidity
zh_cn: Solidity 静态分析

source: Static code analysis is a process to debug the code by examining it and without actually executing the code.
es: El análisis estático de código es un proceso para depurar el código examinándolo y sin ejecutar realmente el código.
fr_fr: L'analyse statique du code est un processus qui permet de déboguer le code en l'examinant sans l'exécuter.
it: L'analisi statica del codice è un processo per fare il debug del codice esaminandolo senza eseguirlo.
zh_cn: 静态代码分析是通过检查代码而不实际执行代码来调试代码的过程。

source: Solidity Static Analysis plugin performs static analysis on Solidity smart contracts once they are compiled. It checks for security vulnerabilities and bad development practices, among other issues. This plugin comes with Solidity environment of Remix IDE. It can also be activated individually from Plugin Manager.
es: El complemento Solidity Static Analysis realiza un análisis estático de los contratos inteligentes Solidity una vez compilados. Comprueba si existen vulnerabilidades de seguridad y malas prácticas de desarrollo, entre otras cuestiones. Este plugin viene con el entorno Solidity de Remix IDE. También puede activarse individualmente desde el Gestor de plugins.
fr_fr: Le plugin Solidity Static Analysis effectue une analyse statique des contrats intelligents Solidity une fois qu'ils sont compilés. Il vérifie les vulnérabilités de sécurité et les mauvaises pratiques de développement, entre autres. Ce plugin est fourni avec l'environnement Solidity de l'IDE Remix. Il peut également être activé individuellement à partir du gestionnaire de plugins.
it: Il plugin di Analisi Statica di Solidity esegue l'analisi statica su contratti intelligenti di Solidity una volta che sono compilati. Controlla possibili vulnerabilità di sicurezza e cattive pratice di sviluppo, tra le varie problematiche. Questo plugin viene assieme all'ambiente Solidity della IDE Remix. Può anche essere attivato individualmente dal Gestore di Plugin.
zh_cn: Solidity 静态分析插件在编译后对 Solidity 智能合约进行静态分析。 它检查安全漏洞和不良开发实践等问题。 这个插件带有 Remix IDE 的 Solidity 环境。 它也可以从插件管理器单独激活。

source: How to use
es: Cómo utilizarlo
fr_fr: Comment l'utiliser ?
it: Come si usa
zh_cn: 如何使用

source: If you select this plugin, you will see a number of modules listed along with checkboxes, one Auto run checkbox and a Run button.
es: Si selecciona este plugin, verá una serie de módulos enumerados junto con casillas de verificación, una casilla de verificación de ejecución automática y un botón Ejecutar.
fr_fr: Si vous sélectionnez ce plugin, vous verrez un certain nombre de modules listés avec des cases à cocher, une case à cocher Exécution automatique et un bouton Exécuter.
it: Se scegli questo plugin vedrai il numero di moduli elencati assieme alle caselle di controllo, una casella di controllo per Auto esecuzione e un pulsante Esegui.
zh_cn: 如果您选择此插件，您将看到许多模块与复选框、一个自动运行复选框和一个运行按钮一起列出。

source: By default, all modules are selected for analysis and a new analysis is performed at each compilation.
es: Por defecto, se seleccionan todos los módulos para el análisis y se realiza un nuevo análisis en cada compilación.
fr_fr: Par défaut, tous les modules sont sélectionnés pour l'analyse et une nouvelle analyse est effectuée à chaque compilation.
it: Di default, tutti i moduli sono selezionati per l'analisi e nuove analisi vengono fatte ad ogni compilazione.
zh_cn: 默认情况下，选择所有模块进行分析，并在每次编译时执行新的分析。
