Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Contract/Program to be tested: Value.sol
es: Contrato/Programa a probar: Valor.sol
fr_fr: Contrat/Programme à tester : Value.sol
it: Contratto/Programma da testare: Value.sol
zh_cn: 要测试的合约/程序：Value.sol

source: Test contract/program: Value_test.sol
es: Contrato/programa de prueba: Valor_prueba.sol
fr_fr: Contrat/programme de test : Value_test.sol
it: Test del contratto/programma: Value_test.sol
zh_cn: 测试合约/程序：Value_test.sol

source: Unit Testing Plugin
es: Plugin de pruebas unitarias
fr_fr: Plugin de test unitaire
it: Plugin di Test di Unità
zh_cn: 单元测试插件

source: Click the double check icon to get to the Solidity Unit Testing plugin.
es: Haga clic en el icono de doble check para acceder al plugin Solidity Unit Testing.
fr_fr: Cliquez sur l'icône de la double vérification pour accéder au plugin Solidity Unit Testing.
it: Fare clic sull'icona della doppia spunta per accedere al plugin Solidity Unit Testing.
zh_cn: 单击双重检查图标以访问 Solidity 单元测试插件。

source: If you haven't used this plugin before and are not seeing double check icon, you have to activate it from Remix plugin manager.
es: Si no ha utilizado este plugin antes y no ve el icono de doble check, tiene que activarlo desde el gestor de plugins Remix.
fr_fr: Si vous n'avez pas utilisé ce plugin auparavant et que vous ne voyez pas l'icône de double vérification, vous devez l'activer à partir du gestionnaire de plugins Remix.
it: Se non hai mai usato questo plugin e non vedi l'icona del doppio controllo, devi attivarlo dal gestore dei plugin di Remix.
zh_cn: 如果您之前没有使用过这个插件并且没有看到双重检查图标，您必须从 Remix 插件管理器中激活它。

source: Go to the plugin manager (by click the plug icon) and load up the unit testing plugin.
es: Vaya al gestor de plugins (haciendo clic en el icono del plugin) y cargue el plugin de pruebas unitarias.
fr_fr: Allez dans le gestionnaire de plugins (en cliquant sur l'icône du plugin) et chargez le plugin de test unitaire.
it: Vai nel gestore dei plugin (facendo clic sull'icona del plugin) e carica il plugin per i test delle unità.
zh_cn: 转到插件管理器(通过单击插件图标) 并加载单元测试插件。

source: Now double check icon will appear on the left side icon bar. Clicking on icon will load the unit testing module in the side panel.
es: Ahora aparecerá el icono de doble comprobación en la barra de iconos lateral izquierda. Al hacer clic en el icono se cargará el módulo de pruebas unitarias en el panel lateral.
fr_fr: L'icône de double vérification apparaît alors dans la barre d'icônes de gauche. En cliquant sur l'icône, le module de test unitaire sera chargé dans le panneau latéral.
it: A questo punto, nella barra delle icone di sinistra apparirà l'icona della doppia spunta. Facendo clic sull'icona si caricherà il modulo di test delle unità nel pannello laterale.
zh_cn: 现在仔细检查图标将出现在左侧图标栏上。 单击图标将在侧面板中加载单元测试模块。

source: Alternatively, just select Solidity environment from remix IDE home page. This will activate Solidity Unit Testing plugin along with Solidity Compiler, Deploy & Run Transactions & Solidity Static Analysis plugins.
es: Alternativamente, sólo tiene que seleccionar el entorno Solidity en la página de inicio del IDE remix. Esto activará el plugin Solidity Unit Testing junto con los plugins Solidity Compiler, Deploy & Run Transactions y Solidity Static Analysis.
fr_fr: Vous pouvez également sélectionner l'environnement Solidity à partir de la page d'accueil de l'IDE remix. Cela activera le plugin Solidity Unit Testing ainsi que les plugins Solidity Compiler, Deploy & Run Transactions et Solidity Static Analysis.
it: In alternativa, basta selezionare l'ambiente Solidity dalla pagina iniziale di remix IDE. Questo attiverà il plugin Solidity Unit Testing insieme ai plugin Compilatore di Solidity, Distribuisci & Esegui Transazioni e Analisi statica di Solidity.
zh_cn: 或者，只需从 remix IDE 主页中选择 Solidity 环境。 这将激活 Solidity 单元测试插件以及 Solidity 编译器、部署和运行事务以及 Solidity 静态分析插件。

source: Generate
es: Genere
fr_fr: Générer
it: Genera
zh_cn: 生成

source: Select a solidity file which you want to test and click on the button Generate. It will generate a new sample solidity test file in the current folder suffixed with _test. This file contains the minimum you need for running unit testing.
es: Seleccione un archivo de solidez que desee probar y pulse el botón Generar. Se generará un nuevo archivo de prueba solidity de muestra en la carpeta actual con el sufijo _test. Este archivo contiene lo mínimo que necesita para ejecutar pruebas unitarias.
fr_fr: Sélectionnez un fichier Solidity que vous souhaitez tester et cliquez sur le bouton Générer. Un nouveau fichier de test Solidity sera généré dans le dossier courant avec l'extension _test. Ce fichier contient le minimum dont vous avez besoin pour effectuer des tests unitaires.
it: Seleziona il file solidity che vuoi testare e fai clic sul pulsante Genera. Verrà generato un nuovo file di test solidity di esempio nella cartella corrente con il suffisso _test. Questo file contiene il minimo indispensabile per eseguire i test delle unità.
zh_cn: 选择您要测试的solidity 文件，然后单击按钮Generate。 它将在当前文件夹中生成一个新的样本可靠性测试文件，后缀为_test。 此文件包含运行单元测试所需的最低要求。

source: Write Tests
es: Pruebas de escritura
fr_fr: Rédiger des tests
it: Scrivi dei Test
zh_cn: 编写测试

source: Write tests to check the functionality of your contract. Remix injects a built-in assert library which can be used for testing. Visit the library documentation here.
es: Escriba pruebas para comprobar la funcionalidad de su contrato. Remix inyecta una biblioteca assert incorporada que puede utilizarse para realizar pruebas. Visite la documentación de la biblioteca aquí.
fr_fr: Ecrivez des tests pour vérifier la fonctionnalité de votre contrat. Remix injecte une bibliothèque d'assertions intégrée qui peut être utilisée pour les tests. Consultez la documentation de la bibliothèque ici.
it: Scrivi dei test per verificare la funzionalità del tuo contratto. Remix fornisce una libreria di assert integrata che può essere utilizzata per i test. Visita la documentazione della libreria qui.
zh_cn: 编写测试来检查合约的功能。 Remix 注入了一个可用于测试的内置断言库。 在此处访问库文档。

source: Apart from this, Remix allows usage of some special functions to make testing more structural. They are:
es: Aparte de esto, Remix permite utilizar algunas funciones especiales para hacer las pruebas más estructurales. Éstas son:
fr_fr: En outre, Remix permet d'utiliser certaines fonctions spéciales pour rendre les tests plus structurés. Ces fonctions sont les suivantes :
it: Oltre a questo, Remix permette di utilizzare alcune funzioni speciali per rendere i test più strutturali. Esse sono:
zh_cn: 除此之外，Remix 允许使用一些特殊功能来使测试更加结构化。 他们是：

source: beforeEach() - Runs before each test
es: beforeEach() - Se ejecuta antes de cada prueba
fr_fr: beforeEach() - S'exécute avant chaque test
it: beforeEach() - Eseguita prima di ogni test
zh_cn: beforeEach() - 在每次测试之前运行

source: beforeAll() - Runs before all tests
es: beforeAll() - Se ejecuta antes de todas las pruebas
fr_fr: beforeAll() - S'exécute avant tous les tests
it: beforeAll() - Eseguita prima di tutti i test
zh_cn: beforeAll() - 在所有测试之前运行

source: afterEach() - Runs after each test
es: afterEach() - Se ejecuta después de cada prueba
fr_fr: afterEach() - S'exécute après chaque test
it: afterEach() - Eseguita dopo ogni test
zh_cn: afterEach() - 每次测试后运行

source: afterAll() - Runs after all tests
es: afterAll() - Se ejecuta después de todas las pruebas
fr_fr: afterAll() - S'exécute après tous les tests
it: afterAll() - Eseguita dopo tutti i test
zh_cn: afterAll() - 在所有测试之后运行

source: To get started, see this simple example.
es: Para empezar, vea este sencillo ejemplo.
fr_fr: Pour commencer, voyez cet exemple simple.
it: Per iniziare, vedi questo semplice esempio.
zh_cn: 要开始，请参阅这个简单的示例。

source: Run
es: Ejecute
fr_fr: Exécuter
it: Esegui
zh_cn: 运行

source: Once you are done with writing tests, select the _test.sol files in the list and click on the button Run to execute the tests in the selected files. The execution will run in a separate environment and the result will be displayed below.
es: Una vez que haya terminado de escribir las pruebas, seleccione los archivos _test.sol de la lista y pulse el botón Ejecutar para ejecutar las pruebas de los archivos seleccionados. La ejecución se llevará a cabo en un entorno independiente y el resultado se mostrará a continuación.
fr_fr: Une fois que vous avez terminé la rédaction des tests, sélectionnez les fichiers _test.sol dans la liste et cliquez sur le bouton Exécuter pour exécuter les tests dans les fichiers sélectionnés. L'exécution se fera dans un environnement séparé et le résultat sera affiché ci-dessous.
it: Una volta terminata la scrittura dei test, seleziona i file _test.sol nell'elenco e fai clic sul pulsante Esegui per eseguire i test nei file selezionati. L'esecuzione avverrà in un ambiente separato e il risultato sarà visualizzato di seguito.
zh_cn: 完成编写测试后，在列表中选择 _test.sol 文件，然后单击按钮运行以在所选文件中执行测试。 执行将在单独的环境中运行，结果将显示在下方。

source: If you have selected multiple files to run the tests and want to stop the execution, click on Stop button. It will stop execution after running the tests for current file.
es: Si ha seleccionado varios archivos para ejecutar las pruebas y desea detener la ejecución, pulse el botón Detener. Detendrá la ejecución después de ejecutar las pruebas para el archivo actual.
fr_fr: Si vous avez sélectionné plusieurs fichiers pour exécuter les tests et que vous souhaitez arrêter l'exécution, cliquez sur le bouton Arrêter. L'exécution s'arrêtera après l'exécution des tests pour le fichier en cours.
it: Se hai selezionato più file per eseguire i test e vuoi interrompere l'esecuzione, fai clic sul pulsante Interrompi. L'esecuzione verrà interrotta dopo l'esecuzione dei test per il file attuale.
zh_cn: 如果您选择了多个文件来运行测试并想要停止执行，请单击停止按钮。 运行当前文件的测试后，它将停止执行。

source: Customization
es: Personalización
fr_fr: Personnalisation
it: Personalizzazione
zh_cn: 自定义

source: Remix facilitates users with various types of customizations to test a contract properly.
es: Remix facilita a los usuarios varios tipos de personalizaciones para probar un contrato correctamente.
fr_fr: Remix offre aux utilisateurs différents types de personnalisation pour tester correctement un contrat.
it: Remix agevola gli utenti con vari tipi di personalizzazioni per testare correttamente un contratto.
zh_cn: Remix 帮助用户通过各种类型的自定义来正确测试合约。

source: 1. Custom Compiler Context
es: 1. Contexto de compilador personalizado
fr_fr: 1. Contexte du compilateur personnalisé
it: 1. Contesto del Compilatore Personalizzato
zh_cn: 1. 自定义编译器上下文

source: Solidity Unit Testing refers Solidity Compiler plugin for compiler configurations. One can provide customized inputs for Compiler, EVM Version & Enable Optimization and these will be the configuration settings used for contract compilation before running unit tests.
es: Solidity Unit Testing hace referencia al plugin Solidity Compiler para las configuraciones del compilador. Uno puede proporcionar entradas personalizadas para Compilador, Versión EVM y Activar Optimización y estos serán los ajustes de configuración utilizados para la compilación de contratos antes de ejecutar las pruebas unitarias.
fr_fr: Solidity Unit Testing fait référence au plugin Solidity Compiler pour les configurations du compilateur. Vous pouvez fournir des entrées personnalisées pour le compilateur, la version EVM et l'activation de l'optimisation. Ces paramètres de configuration seront utilisés pour la compilation du contrat avant l'exécution des tests unitaires.
it: Solidity Unit Testing fa riferimento al plugin Compilatore di Solidity per le configurazioni del compilatore. Si possono fornire input personalizzati per Compilatore, Versione EVM & Abilita ottimizzazione e queste saranno le impostazioni di configurazione utilizzate per la compilazione del contratto prima dell'esecuzione dei test delle unità.
zh_cn: Solidity 单元测试是指用于编译器配置的 Solidity Compiler 插件。 可以为编译器、EVM 版本和启用优化提供自定义输入，这些将是在运行单元测试之前用于合约编译的配置设置。

source: 2. Custom Transaction Context
es: 2. Contexto de transacción personalizado
fr_fr: 2. Contexte de transaction personnalisé
it: 2. Contesto della Transazione Personalizzato
zh_cn: 2. 自定义交易上下文

source: For a contract method interaction, prime parameters of transaction are from address, value & gas. Usually, we need to test a method's behaviour under different values of these parameters.
es: Para la interacción de un método de contrato, los parámetros principales de la transacción son de dirección, valor y gas. Normalmente, necesitamos probar el comportamiento de un método bajo diferentes valores de estos parámetros.
fr_fr: Pour l'interaction d'une méthode contractuelle, les principaux paramètres de la transaction sont l'adresse, la valeur et le gaz. En général, nous devons tester le comportement d'une méthode en fonction de différentes valeurs de ces paramètres.
it: Per l'interazione del metodo di un contratto, i parametri principali della transazione sono l'indirizzo, il valore e il carburante. Di solito, è necessario testare il comportamento di un metodo con diversi valori di questi parametri.
zh_cn: 对于合约方法交互，交易的主要参数来自地址、价值和gas。 通常，我们需要测试一个方法在这些参数的不同值下的行为。

source: Remix provides the functionality of custom msg.sender & msg.value of transaction using method devdoc like:
es: Remix proporciona la funcionalidad de personalizar msg.sender & msg.value de la transacción utilizando el método devdoc como:
fr_fr: Remix fournit la fonctionnalité de personnaliser msg.sender & msg.value de la transaction en utilisant la méthode devdoc comme :
it: Remix fornisce la funzionalità di personalizzare msg.sender e msg.value della transazione utilizzando il metodo devdoc in questo modo:
zh_cn: Remix 使用方法 devdoc 提供了自定义 msg.sender 和 msg.value 的功能，例如：

source: Things to keep in mind while using custom transaction context:
es: Aspectos a tener en cuenta al utilizar el contexto de transacción personalizado:
fr_fr: Ce qu'il faut garder à l'esprit lors de l'utilisation d'un contexte de transaction personnalisé :
it: Cose da tenere a mente quando si usa un contesto di transazione personalizzato:
zh_cn: 使用自定义事务上下文时要记住的事项：

source: Parameters must be defined in devdoc of related method
es: Los parámetros deben estar definidos en el devdoc del método relacionado
fr_fr: Les paramètres doivent être définis dans la devdoc de la méthode concernée.
it: I parametri devono essere definiti nel devdoc del metodo correlato
zh_cn: 参数必须在相关方法的devdoc中定义

source: Each parameter key should be prefixed with a hash (#) and end with a colon following a space (: ) like #sender: & #value:
es: Cada clave de parámetro debe ir precedida de una almohadilla (#) y terminar con dos puntos después de un espacio (: ) como #remitente: & #valor:
fr_fr: Chaque clé de paramètre doit être précédée d'un dièse (#) et se terminer par deux points après un espace ( : ), comme #sender : & #value :
it: Ogni chiave di parametro deve essere preceduta da un cancelletto (#) e terminare con i due punti seguiti da uno spazio (: ), come #mittente: & #valore:
zh_cn: 每个参数键都应以哈希 (#) 为前缀，并以冒号结尾，后跟一个空格 (: ) ，例如 #sender: & #value:

source: For now, customization is available for parameters sender & value only
es: Por ahora, la personalización sólo está disponible para los parámetros remitente y valor
fr_fr: Pour l'instant, la personnalisation n'est disponible que pour les paramètres "sender" et "value".
it: Per il momento, la personalizzazione è disponibile solo per i parametri mittente e valore
zh_cn: 目前，自定义仅适用于参数 sender 和 value

source: Sender is from address of a transaction which is accessed using msg.sender inside a contract method. It should be defined in a fixed format as 'account-<account_index>'
es: El remitente es la dirección de una transacción a la que se accede utilizando msg.sender dentro de un método de contrato. Debe definirse en un formato fijo como 'cuenta-<account_index>'.
fr_fr: L'expéditeur est l'adresse d'une transaction à laquelle on accède en utilisant msg.sender dans une méthode de contrat. Il doit être défini dans un format fixe comme "account-<account_index>".
it: Il mittente deriva dall'indirizzo di una transazione a cui si accede utilizzando msg.sender all'interno di un metodo di contratto. Deve essere definito in un formato prestabilito come 'account-<account_index>'
zh_cn: 发件人来自使用合约方法中的 msg.sender 访问的交易地址。 它应该以固定格式定义为 'account-<account_index>'

source: <account_index> varies from 0-2 before remix-ide release v0.10.0 and 0-9 afterwards
es: <account_index> varía de 0-2 antes del lanzamiento de remix-ide v0.10.0 y de 0-9 después
fr_fr: <account_index> varie de 0-2 avant la sortie de la version 0.10.0 de remix-ide et de 0-9 après.
it: <account_index> varia da 0-2 prima del rilascio di remix-ide v0.10.0 e da 0-9 in seguito
zh_cn: <account_index> 在 remix-ide v0.10.0 发布之前从 0-2 变化，之后从 0-9 变化

source: remix_accounts.sol must be imported in your test file to use custom sender
es: remix_accounts.sol debe ser importado en su archivo de prueba para utilizar el remitente personalizado
fr_fr: remix_accounts.sol doit être importé dans votre fichier de test pour utiliser l'expéditeur personnalisé.
it: remix_accounts.sol deve essere importato nel file di prova per utilizzare il mittente personalizzato
zh_cn: 必须在您的测试文件中导入 remix_accounts.sol 才能使用自定义发件人

source: Value is value sent along with a transaction in wei which is accessed using msg.value inside a contract method. It should be a number.
es: El valor es el valor enviado junto con una transacción en wei al que se accede utilizando msg.value dentro de un método de contrato. Debe ser un número.
fr_fr: La valeur est la valeur envoyée lors d'une transaction dans l'UEO, à laquelle on accède en utilisant msg.value à l'intérieur d'une méthode de contrat. Il doit s'agir d'un nombre.
it: Il valore è il valore inviato con una transazione in wei, a cui si accede utilizzando msg.value all'interno di un metodo di contratto. Dovrebbe essere un numero.
zh_cn: 价值是与 wei 中的交易一起发送的价值，可以使用合约方法中的 msg.value 访问。 它应该是一个数字。

source: Regarding gas, Remix estimates the required gas for each transaction internally. Still if a contract deployment fails with Out-of-Gas error, it tries to redeploy it by doubling the gas. Deployment failing with double gas will show error: contract deployment failed after trying twice: The contract code couldn't be stored, please check your gas limit
es: En cuanto al gas, Remix estima internamente el gas necesario para cada transacción. Aún así, si el despliegue de un contrato falla con el error Out-of-Gas, intenta volver a desplegarlo duplicando el gas. El despliegue que falle con el doble de gas mostrará el error: el despliegue del contrato falló después de intentarlo dos veces: El código del contrato no pudo ser almacenado, por favor compruebe su límite de gas
fr_fr: En ce qui concerne le gaz, Remix estime en interne le gaz nécessaire pour chaque transaction. Toutefois, si le déploiement d'un contrat échoue avec l'erreur "Out-of-Gas", il tente de le redéployer en doublant la quantité de gaz. Un déploiement qui échoue avec une double quantité de gaz affichera l'erreur suivante : le déploiement du contrat a échoué après deux tentatives : le code du contrat n'a pas pu être stocké, veuillez vérifier votre limite de gaz.
it: Per quanto riguarda il carburante, Remix stima internamente il carburante necessario per ogni transazione. Tuttavia, se la distribuzione di un contratto fallisce con un errore di esaurimento del carburante, tenta di distribuirlo nuovamente raddoppiando il carburante. Se la distribuzione fallisce con il doppio del carburante, viene visualizzato l'errore: Distribuzione del contratto fallita dopo aver provato due volte: il codice del contratto non ha potuto essere archiviato, si prega di controllare il limite di carburante
zh_cn: 关于 gas，Remix 在内部估计每笔交易所需的 gas。 尽管如此，如果合约部署因 Out-of-Gas 错误而失败，它会尝试通过将 gas 加倍来重新部署它。 双重gas部署失败将显示错误：尝试两次后合约部署失败：无法存储合约代码，请检查您的gas限制

source: Various test examples can be seen in examples section.
es: Puede ver varios ejemplos de prueba en la sección de ejemplos.
fr_fr: Vous trouverez divers exemples de tests dans la section des exemples.
it: Nella sezione Esempi si possono vedere vari esempi di test.
zh_cn: 在示例部分可以看到各种测试示例。

source: Points to remember
es: Puntos a recordar
fr_fr: Points à retenir
it: Punti da ricordare
zh_cn: 要记住的要点

source: A test contract cannot have a method with parameters. Having one such method will show error: Method 'methodname' can not have parameters inside a test contract
es: Un contrato de prueba no puede tener un método con parámetros. Si tiene un método de este tipo se producirá un error: El método 'methodname' no puede tener parámetros dentro de un contrato de prueba
fr_fr: Un contrat de test ne peut pas avoir de méthode avec des paramètres. L'existence d'une telle méthode entraînera une erreur : La méthode "nom de la méthode" ne peut pas avoir de paramètres à l'intérieur d'un contrat de test.
it: Un contratto di test non può avere un metodo con parametri. La presenza di un metodo di questo tipo mostrerà un errore: Il metodo 'methodname' non può avere parametri all'interno di un contratto di test
zh_cn: 测试合约不能有带参数的方法。 拥有一种这样的方法将显示错误：方法'methodname'在测试合约中不能有参数

source: Number of test accounts are 3 before remix-ide release v0.10.0 and 10 afterwards
es: El número de cuentas de prueba son 3 antes del lanzamiento de remix-ide v0.10.0 y 10 después
fr_fr: Le nombre de comptes de test est de 3 avant la sortie de la version 0.10.0 de remix-ide et de 10 après.
it: Il numero di account di prova è di 3 prima del rilascio di remix-ide v0.10.0 e di 10 dopo
zh_cn: 在 remix-ide v0.10.0 发布之前，测试账户数量为 3，之后为 10

source: A test file which imports remix_accounts.sol might not compile successfully with Solidity Compiler plugin but it will work fine with Solidity Unit Testing plugin.
es: Es posible que un archivo de prueba que importe remix_accounts.sol no compile correctamente con el complemento Solidity Compiler, pero funcionará correctamente con el complemento Solidity Unit Testing.
fr_fr: Un fichier de test qui importe remix_accounts.sol peut ne pas se compiler avec le plugin Solidity Compiler mais fonctionnera parfaitement avec le plugin Solidity Unit Testing.
it: Un file di prova che importa remix_accounts.sol potrebbe non essere compilato con il plugin Compilatore di Solidity, ma funzionerà bene con il plugin Solidity Unit Testing.
zh_cn: 导入 remix_accounts.sol 的测试文件可能无法使用 Solidity Compiler 插件成功编译，但它可以与 Solidity Unit Testing 插件一起正常工作。

source: remix-tests is the module which works underneath of remix-ide Solidity Unit Testing plugin.
es: remix-tests es el módulo que funciona por debajo de remix-ide Solidity Unit Testing plugin.
fr_fr: remix-tests est le module qui fonctionne sous le plugin remix-ide Solidity Unit Testing.
it: remix-tests è il modulo che lavora alla base del plugin Solidity Unit Testing di remix-ide.
zh_cn: remix-tests 是在 remix-ide Solidity 单元测试插件下工作的模块。

source: remix-tests is an NPM package. It can also be used as a CLI/CI solution, supporting node.js. Find more information about this type of usage in the remix-tests repository
es: remix-tests es un paquete NPM. También puede utilizarse como una solución CLI/CI, compatible con node.js. Encuentre más información sobre este tipo de uso en el repositorio remix-tests
fr_fr: remix-tests est un paquet NPM. Il peut également être utilisé comme une solution CLI/CI, supportant node.js. Vous trouverez plus d'informations sur ce type d'utilisation dans le dépôt remix-tests.
it: remix-tests è un pacchetto NPM. Può essere usato anche come soluzione CLI/CI, supportando node.js. Per maggiori informazioni su questo tipo di utilizzo, consultare l'archivio di remix-tests
zh_cn: remix-tests 是一个 NPM 包。 它也可以用作 CLI/CI 解决方案，支持 node.js。 在 remix-tests 存储库中查找有关此类用法的更多信息
