Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: From Remix IDE, in the Plugin Manager, activate the remixd plugin. This plugin is a websocket plugin and it has no UI other than a modal dialog box.
es: Desde el IDE Remix, en el Gestor de plugins, active el plugin remixd. Este plugin es un plugin de websocket y no tiene más interfaz de usuario que un cuadro de diálogo modal.
fr_fr: Depuis Remix IDE, dans le Plugin Manager, activez le plugin remixd. Ce plugin est un plugin websocket et il n'a pas d'interface utilisateur autre qu'une boîte de dialogue modale.
it: Dalla IDE Remix, nel Gestore di Plugin, attiva il plugin remixd. Questo plugin è un plugin websocket e non ha altra UI se non quella del box modale di dialogo.
zh_cn: 在 Remix IDE 的插件管理器中，激活 remixd 插件。 这个插件是一个 websocket 插件，除了一个模态对话框，它没有 UI。

source: This modal will ask confirmation
es: Este modal le pedirá confirmación
fr_fr: Cette fenêtre modale vous demandera de confirmer
it: Questo modale chiederà conferma
zh_cn: 此模式将要求确认

source: Accepting this dialog will start a session.
es: Al aceptar este diálogo se iniciará una sesión.
fr_fr: En acceptant ce dialogue, vous démarrez une session.
it: L'accettazione di questo dialogo inizierà la sessione.
zh_cn: 接受此对话框将启动会话。

source: If you do not have remixd running in the background - another modal will open up and it will say:
es: Si no tiene remixd ejecutándose en segundo plano - se abrirá otro modal que dirá:
fr_fr: Si remixd ne tourne pas en arrière-plan, une autre fenêtre modale s'ouvrira :
it: Se non hai remixd in esecuzione in background - un altro modale si aprirà e dirà:
zh_cn: 如果您没有在后台运行 remixd background - another 模式将打开，它会说：

source: Assuming you don't get the 2nd modal, your connection to the remixd daemon is successful. The shared folder will be available in the file explorer.
es: Suponiendo que no le aparezca el segundo modal, su conexión con el demonio remixd ha tenido éxito. La carpeta compartida estará disponible en el explorador de archivos.
fr_fr: Si vous n'obtenez pas la deuxième fenêtre modale, votre connexion au démon remixd est réussie. Le dossier partagé sera disponible dans l'explorateur de fichiers.
it: Assumendo che tu non riceva il secondo modale, la tua connessione al daemon remixd è avvenuta con successo. La cartella condivisa sarà disponibile nell'esploratore di file.
zh_cn: 假设您没有获得第二个模式，您与 remixd 守护程序的连接是成功的。 共享文件夹将在文件资源管理器中可用。

source: When you click the activation of remixd is successful - there will NOT be an icon that loads in the icon panel.
es: Cuando haga clic en la activación de remixd tiene éxito - NO habrá un icono que se carga en el panel de iconos.
fr_fr: Lorsque vous cliquez sur l'activation de remixd est réussie - il n'y aura PAS d'icône qui se charge dans le panneau d'icônes.
it: Quando clicchi l'attivazione di remixd sarà riuscita - NON ci sarà un'icona di caricamento nell'icona del pannello.
zh_cn: 当您单击 remixd 激活成功时 - 图标面板中不会加载图标。

source: Click the File Explorers icon and in the swap panel you should now see the folder for localhost.
es: Haga clic en el icono Exploradores de archivos y en el panel de intercambio debería ver ahora la carpeta correspondiente a localhost.
fr_fr: Cliquez sur l'icône de l'explorateur de fichiers et, dans le panneau d'échange, vous devriez maintenant voir le dossier de localhost.
it: Clicca l'icona dell'Esploratore di File e nel pannello di scambio dovresti ora vedere la cartella per localhost.
zh_cn: 单击文件资源管理器图标，在交换面板中，您现在应该看到 localhost 的文件夹。

source: Click on the localhost connection icon:
es: Haga clic en el icono de conexión localhost:
fr_fr: Cliquez sur l'icône de connexion localhost :
it: Clicca sull'icona del collegamento a localhost:
zh_cn: 单击本地主机连接图标：

source: Remix Github Tutorials
es: Remezclar tutoriales de Github
fr_fr: Remixer les tutoriels Github
it: Tutorial di Remix su Github
zh_cn: Remix Github 教程

source: There are a series of tutorials in our github repo remix-workshops.
es: Hay una serie de tutoriales en nuestro repo de github remix-workshops.
fr_fr: Il existe une série de tutoriels dans notre répertoire github remix-workshops.
it: Ci sono una serie di tutorial nella nostra repo di github chiamata remix-workshops.
zh_cn: 我们的 github 库 remix-workshops 中有一系列教程。

source: We are in the process of upgrading these tutorials to use the new Remix layout.
es: Estamos actualizando estos tutoriales para que utilicen el nuevo diseño de Remix.
fr_fr: Nous sommes en train de mettre à jour ces tutoriels pour qu'ils utilisent la nouvelle mise en page de Remix.
it: Siamo in procinto di aggiornare questi tutorial utilizzando il nuovo layout di Remix.
zh_cn: 我们正在升级这些教程以使用新的 Remix 布局。

source: In this repo there tutorials for all levels.
es: En este repo hay tutoriales para todos los niveles.
fr_fr: Dans ce répertoire, vous trouverez des tutoriels pour tous les niveaux.
it: In questa repo ci sono tutorial per ogni livello.
zh_cn: 在这个 repo 中有所有级别的教程。

source: There are tutorials for specific remix functionalities like:
es: Hay tutoriales para funcionalidades específicas de la remezcla como:
fr_fr: Il existe des tutoriels pour des fonctionnalités spécifiques du remix comme :
it: Ci sono tutorial per funzionalità specifiche di remix come:
zh_cn: 有针对特定Remix功能的教程，例如：

source: Deploying
es: Desplegando
fr_fr: Déploiement
it: Distribuire
zh_cn: 部署

source: Testing
es: Pruebas
fr_fr: Essais
it: Testare
zh_cn: 测试

source: Remix Plugin Development
es: Desarrollo de plugins Remix
fr_fr: Développement du plugin Remix
it: Sviluppo di Plugin per Remix
zh_cn: Remix插件开发

source: Other
es: Otros
fr_fr: Autre
it: Altro
zh_cn: 其它

source: Additional external workshops
es: Talleres externos adicionales
fr_fr: Ateliers externes supplémentaires
it: Workshop esterni aggiuntivi
zh_cn: 其他外部研讨会

source: The Deploy & Run module allows you to send transactions to the current environment.
es: El módulo Despliegue y ejecución le permite enviar transacciones al entorno actual.
fr_fr: Le module Deploy & Run vous permet d'envoyer des transactions dans l'environnement actuel.
it: Il modulo di Distribuisci & Esegui ti permette d'inviare transazioni all'ambiente corrente.
zh_cn: Deploy & Run 模块允许您将事务发送到当前环境。

source: To use this module, you need to have a contract compiled. So, if there is a contract name in the <b>CONTRACT</b> select box (the select box is under the VALUE input field), you can use this module. If nothing is there or you do not see the contract you want, you need to select a contract in the editor to make it active, go to a compiler module and compile it, and then come back to Deploy & Run.
es: Para utilizar este módulo, necesita tener un contrato compilado. Por lo tanto, si hay un nombre de contrato en la casilla de selección <b>CONTRATO</b> (la casilla de selección está debajo del campo de entrada VALOR), puede utilizar este módulo. Si no hay nada o no ve el contrato que desea, tiene que seleccionar un contrato en el editor para activarlo, ir a un módulo compilador y compilarlo, y luego volver a Despliegue y Ejecución.
fr_fr: Pour utiliser ce module, vous devez avoir compilé un contrat. Donc, s'il y a un nom de contrat dans la boîte de sélection <b>CONTRACT</b> (la boîte de sélection se trouve sous le champ de saisie VALUE), vous pouvez utiliser ce module. S'il n'y a rien ou si vous ne voyez pas le contrat que vous voulez, vous devez sélectionner un contrat dans l'éditeur pour le rendre actif, aller dans un module de compilation et le compiler, puis revenir à Deploy & Run.
it: Per utilizzare questo modulo, hai bisogno di avere un contratto compilato. Per cui, se c'è il nome di un contratto nel box di selezione <b>CONTRATTO</b> (il box di selezione è sotto il campo di inserimento VALORE), puoi utilizzare questo modulo. Se non c'è nulla o se non vedi il contratto che vuoi, devi selezionare un contratto nell'editor per renderlo attivo, vai in un modulo compilatore e compilalo, e poi ritorna a Distribuisci & Esegui.
zh_cn: 要使用这个模块，你需要编译一个合约。 因此，如果 <b>CONTRACT</b> 选择框(选择框在 VALUE 输入字段下方) 中有合约名称，则可以使用该模块。 如果什么都没有或者你没有看到你想要的合约，你需要在编辑器中选择一个合约来激活它，去一个编译器模块并编译它，然后再回到部署和运行。

source: Environment
es: Medio ambiente
fr_fr: Environnement
it: Ambiente
zh_cn: 环境

source: JavaScript VM: All the transactions will be executed in a sandbox blockchain in the browser. This means nothing will be persisted when you reload the page. The JsVM is its own blockchain and on each reload it will start a new blockchain, the old one will not be saved.
es: JavaScript VM: Todas las transacciones se ejecutarán en una blockchain sandbox en el navegador. Esto significa que no se persistirá nada al recargar la página. La JsVM es su propia blockchain y en cada recarga iniciará una nueva blockchain, la antigua no se guardará.
fr_fr: JavaScript VM : Toutes les transactions seront exécutées dans un bac à sable (sandbox blockchain) dans le navigateur. Cela signifie que rien ne sera conservé lorsque vous rechargerez la page. La JsVM est sa propre blockchain et à chaque rechargement, elle démarre une nouvelle blockchain, l'ancienne n'étant pas sauvegardée.
it: JavaScript VM: Tutte le transazioni verranno eseguite in una blockchain sandbox nel browser. Questo significa che nulla rimarrà quando ricaricherai la pagina. La JsVM è la sua stessa blockchain e a ogni ricaricamento inizializzerà una nuova blockchain, la vecchia non verrà salvata.
zh_cn: JavaScript VM：所有交易都将在浏览器的沙箱区块链中执行。 这意味着重新加载页面时不会保留任何内容。 JsVM 是它自己的区块链，每次重新加载时都会启动一个新的区块链，旧的不会被保存。

source: Injected Provider: Remix will connect to an injected web3 provider. Metamask is an example of a provider that inject web3.
es: Proveedor inyectado: Remix se conectará a un proveedor web3 inyectado. Metamask es un ejemplo de proveedor que inyecta web3.
fr_fr: Fournisseur injecté : Remix se connectera à un fournisseur web3 injecté. Metamask est un exemple de fournisseur qui injecte web3.
it: Provider Iniettato: Remix si connetterà a un provider web3 iniettato. Metamask è un esempio di un provider che inietta web3.
zh_cn: Injected Provider：Remix 将连接到Injected的 web3 provider。 Metamask 是Injected web3 的提供程序的一个示例。

source: Web3 Provider: Remix will connect to a remote node. You will need to provide the URL to the selected provider: geth, parity or any Ethereum client.
es: Proveedor Web3: Remix se conectará a un nodo remoto. Deberá proporcionar la URL del proveedor seleccionado: geth, parity o cualquier cliente Ethereum.
fr_fr: Fournisseur Web3 : Remix se connectera à un nœud distant. Vous devrez fournir l'URL du fournisseur sélectionné : geth, parity ou n'importe quel client Ethereum.
it: Provider Web3: Remix si connetterà a un nodo remoto. Dovrai fornire l'URL al provider selezionato: geth, parity o qualsiasi altro client Ethereum.
zh_cn: Web3 Provider：Remix 将连接到远程节点。 您需要提供所选提供商的 URL：geth、parity 或任何以太坊客户端。

source: More about Web3 Provider
es: Más información sobre el proveedor Web3
fr_fr: Plus d'informations sur Web3 Provider
it: Di più sul Provider Web3
zh_cn: 关于更多 Web3 Provider

source: If you are using Geth & https://remix.ethereum.org, please use the following Geth command to allow requests from Remix:
es: Si utiliza Geth y https://remix.ethereum.org, utilice el siguiente comando de Geth para permitir las peticiones de Remix:
fr_fr: Si vous utilisez Geth et https://remix.ethereum.org, veuillez utiliser la commande Geth suivante pour autoriser les requêtes provenant de Remix :
it: Se stai utilizzando Geth & https://remix.ethereum.org, per favore utilizza il seguente comando Geth per permettere richieste da Remix:
zh_cn: 如果您使用 Geth 和 https://remix.ethereum.org，请使用以下 Geth 命令来允许来自 Remix 的请求：

source: Also see Geth Docs about the rpc server
es: Consulte también Geth Docs sobre el servidor rpc
fr_fr: Consultez également la documentation de Geth sur le serveur rpc.
it: Inoltre vedi la Documentazione Geth riguardante il server rpc
zh_cn: 另请参阅有关 rpc 服务器的 Geth Docs

source: To run Remix using https://remix.ethereum.org & a local test node, use this Geth command:
es: Para ejecutar Remix utilizando https://remix.ethereum.org y un nodo de prueba local, utilice este comando Geth:
fr_fr: Pour exécuter Remix à l'aide de https://remix.ethereum.org et d'un nœud de test local, utilisez cette commande Geth :
it: Per eseguire Remix utilizzando https://remix.ethereum.org & un nodo di test locale, utilizza questo comando Geth:
zh_cn: 要使用 https://remix.ethereum.org 和本地测试节点运行 Remix，请使用以下 Geth 命令：

source: If you are using remix-alpha or a local version of remix - replace the url of the --rpccorsdomain with the url of Remix that you are using.
es: Si está utilizando remix-alpha o una versión local de remix - sustituya la url del --rpccorsdomain por la url de Remix que esté utilizando.
fr_fr: Si vous utilisez remix-alpha ou une version locale de remix, remplacez l'url de --rpccorsdomain par l'url de Remix que vous utilisez.
it: Se stai utilizzando remix-alpha o una versione locale di remix - sostituisci l'url di --rpccorsdomain con l'url di Remix che stai utilizzando.
zh_cn: 如果您使用的是 remix-alpha 或本地版本的 remix - 将 --rpccorsdomain 的 url 替换为您正在使用的 Remix 的 url。

source: To run Remix Desktop & a local test node, use this Geth command:
es: Para ejecutar Remix Desktop & un nodo de prueba local, utilice este comando Geth:
fr_fr: Pour exécuter Remix Desktop et un nœud de test local, utilisez cette commande Geth :
it: Per eseguire Remix Desktop & un nodo locale di test, utilizza questo comando:
zh_cn: 要运行 Remix Desktop 和本地测试节点，请使用以下 Geth 命令：

source: Also see Geth Docs on Dev mode
es: Véase también Geth Docs on Dev mode
fr_fr: Voir aussi la documentation Geth sur le mode Dev
it: Inoltre vedi la Documentazione Geth riguardante la modalità Dev
zh_cn: 另请参阅 Dev 模式的 Geth 文档

source: The Web3 Provider Endpoint for a local node is http://localhost:8545
es: El punto final del proveedor Web3 para un nodo local es http://localhost:8545.
fr_fr: Le point de terminaison du fournisseur Web3 pour un nœud local est http://localhost:8545.
it: L'Endpoint Provider Web3 per un nodo locale è http://localhost:8545
zh_cn: 本地节点的 Web3 Provider Endpoint 是 http://localhost:8545

source: WARNING: Don't get lazy. It is a bad idea to use the Geth flag <b>--rpccorsdomain</b> with a wildcard: --rpccorsdomain *
es: ADVERTENCIA: No sea perezoso. Es una mala idea utilizar la bandera Geth <b>--rpccorsdomain</b> con un comodín: --rpccorsdomain *
fr_fr: AVERTISSEMENT : Ne soyez pas paresseux. C'est une mauvaise idée d'utiliser le drapeau Geth <b>--rpccorsdomain</b> avec un joker : --rpccorsdomain *
it: ATTENZIONE: Non impigrirti. Non è una buona idea utilizzare il flag Geth <b>--rpccorsdomain</b> con una wildcard: --rpccorsdomain *
zh_cn: 警告：不要偷懒。 将 Geth 标志 <b>--rpccorsdomain</b> 与通配符一起使用是个坏主意：--rpccorsdomain *

source: If you put the wildcard *, it means everyone can request the node. Whereas, if you put a URL, it restricts the urls to just that one - e.g. --rpccorsdomain 'https://remix-alpha.ethereum.org'
es: Si pone el comodín *, significa que todo el mundo puede solicitar el nodo. Mientras que si pone una URL, restringe las urls sólo a esa - por ejemplo --rpccorsdomain 'https://remix-alpha.ethereum.org'
fr_fr: Si vous mettez le caractère générique *, cela signifie que tout le monde peut demander le noeud. Par contre, si vous mettez une URL, cela restreint les urls à cette seule URL - par exemple --rpccorsdomain 'https://remix-alpha.ethereum.org'
it: Se metti la wildcard *, significa che chiunque può richiedere il nodo. Quando invece, se metti un URL, restringi gli url possibili a uno solo - es. --rpccorsdomain 'https://remix-alpha.ethereum.org'
zh_cn: 如果放通配符*，则表示每个人都可以请求该节点。 然而，如果你放置一个 URL，它会将 URL 限制在那个 URL 上——例如 --rpccorsdomain 'https://remix-alpha.ethereum.org'

source: Only use --rpccorsdomain * when using a test chain AND using only test accounts. For real accounts or on the mainchain specify the url.
es: Utilice --rpccorsdomain * sólo cuando utilice una cadena de prueba Y utilice sólo cuentas de prueba. Para cuentas reales o en la cadena principal especifique la url.
fr_fr: N'utilisez --rpccorsdomain * que lorsque vous utilisez une chaîne de test ET que vous n'utilisez que des comptes de test. Pour les comptes réels ou sur la chaîne principale, spécifiez l'url.
it: Utilizza --rpccorsdomain * solo quando stai utilizzando una blockchain di test E solo quando utilizzi account di test. Per account veri, o che sono sulla blockchain principale, specifica l'url.
zh_cn: 仅在使用测试链且仅使用测试帐户时使用 --rpccorsdomain *。 对于真实账户或在主链上指定 url。

source: Account:
es: Cuenta:
fr_fr: Compte :
zh_cn: 账户：

source: Account: the list of accounts associated with the current environment (and their associated balances). On the JsVM, you have a choice of 5 accounts. If using Injected Web3 with MetaMask, you need to change the account in MetaMask.
es: Cuenta: la lista de cuentas asociadas al entorno actual (y sus saldos asociados). En la JsVM, puede elegir entre 5 cuentas. Si utiliza Injected Web3 con MetaMask, deberá cambiar la cuenta en MetaMask.
fr_fr: Compte : la liste des comptes associés à l'environnement actuel (et leurs soldes associés). Sur la JsVM, vous avez le choix entre 5 comptes. Si vous utilisez Injected Web3 avec MetaMask, vous devez changer le compte dans MetaMask.
it: Account: la lista degli account associati con l'ambiente corrente (e i loro bilanci associati). Sulla JsVM, puoi avere la scelta di 5 account. Se utilizzi Web3 Iniettato con Metamask, devi cambiare l'account in Metamask.
zh_cn: 账户：与当前环境关联的账户列表(及其关联的余额)。 在 JsVM 上，您可以选择 5 个账户。 如果将 Injected Web3 与 MetaMask 一起使用，则需要更改 MetaMask 中的账户。

source: Gas Limit:
es: Límite de gas:
fr_fr: Limite de gaz :
it: Limite del Gas:
zh_cn: Gas限制：

source: This sets the maximum amount of gas that will be allowed for all the transactions created in Remix.
es: Esto fija la cantidad máxima de gas que se permitirá para todas las transacciones creadas en Remix.
fr_fr: Ceci définit la quantité maximale de gaz qui sera autorisée pour toutes les transactions créées dans Remix.
it: Questo configura un ammontare massimo di gas che verrà permesso per tutte le transazioni create in Remix.
zh_cn: 这设置了在 Remix 中创建的所有交易允许的最大gas量。

source: Value:
es: Valor:
fr_fr: Valeur :
it: Valore:
zh_cn: 值：

source: This sets the amount of ETH, WEI, GWEI etc that is sent to a contract or a payable function. ( Note: payable functions have a red button). The value is always reset to 0 after each transaction execution). The Value field is NOT for gas.
es: Establece la cantidad de ETH, WEI, GWEI etc que se envía a un contrato o a una función pagadera. ( Nota: las funciones pagaderas tienen un botón rojo). El valor siempre se pone a 0 después de cada ejecución de transacción). El campo Valor NO es para el gas.
fr_fr: Ceci définit le montant d'ETH, WEI, GWEI etc. qui est envoyé à un contrat ou à une fonction payable. (Note : les fonctions payables ont un bouton rouge). La valeur est toujours remise à 0 après l'exécution de chaque transaction). Le champ Valeur n'est PAS destiné au gaz.
it: Questo imposta l'ammontare di ETH, WEI, GWEI ecc che viene inviato a un contratto o una funzione pagabile. (Nota: le funzioni pagabili hanno un pulsante rosso). Il valore è sempre resettato a 0 dopo ogni transazione eseguita. Il campo Valore NON è per il gas.
zh_cn: 这设置了发送到合约或应付函数的 ETH、WEI、GWEI 等数量。(注：应付功能有一个红色按钮)。 每次事务执行后，该值始终重置为 0)。 值字段不适用于gas。

source: Initiate Instance
es: Iniciar Instancia
fr_fr: Initier l'instance
it: Inizializza Istanza
zh_cn: 启动实例

source: In the image above, the select box is set to Ballot. This select box will contain the list of compiled contracts.
es: En la imagen de arriba, la casilla de selección está configurada como Boleta. Esta caja de selección contendrá la lista de contratos compilados.
fr_fr: Dans l'image ci-dessus, la boîte de sélection est définie sur Bulletin de vote. Cette boîte de sélection contient la liste des contrats compilés.
it: Nell'immagine sopra, il box di selezione è impostato su Scrutinio. Questa box di selezione conterrà l'elenco dei contratti compilati.
zh_cn: 在上图中，选择框设置为 Ballot。 此选择框将包含已编译合约的列表。

source: Deploy send a transaction that deploys the selected contract. When the transaction is mined, the newly created instance will be added (this might take several seconds). Note that if the constructor has parameters, you need to specify them.
es: Desplegar envía una transacción que despliega el contrato seleccionado. Cuando se extraiga la transacción, se añadirá la instancia recién creada (esto puede tardar varios segundos). Tenga en cuenta que si el constructor tiene parámetros, deberá especificarlos.
fr_fr: Déployer envoie une transaction qui déploie le contrat sélectionné. Lorsque la transaction est analysée, l'instance nouvellement créée est ajoutée (cela peut prendre plusieurs secondes). Notez que si le constructeur a des paramètres, vous devez les spécifier.
it: Deploy invia una transazione che distribuisce il contratto selezionato. Quando la transazione è estratta, la nuova istanza creata sarà aggiunta (questo potrebbe richiedere diversi secondi). Nota che se il costruttore ha dei parametri, dovrai specificarli.
zh_cn: 部署发送部署所选合约的事务。 当交易被挖掘时，新创建的实例将被添加(这也许需要几秒钟)。 请注意，如果构造函数有参数，则需要指定它们。

source: At Address this is used at access a contract that has already been deployed. It assumes that the given address is an instance of the selected contract. Note: There's no check at this point, so be careful when using this feature, and be sure you trust the contract at that address.
es: En Dirección se utiliza para acceder a un contrato que ya ha sido desplegado. Asume que la dirección dada es una instancia del contrato seleccionado. Nota: No hay ninguna comprobación en este punto, así que tenga cuidado al utilizar esta función y asegúrese de que confía en el contrato de esa dirección.
fr_fr: À l'adresse Cette option est utilisée pour accéder à un contrat qui a déjà été déployé. Elle suppose que l'adresse donnée est une instance du contrat sélectionné. Note : Il n'y a pas de vérification à ce stade, donc soyez prudent lorsque vous utilisez cette fonctionnalité, et assurez-vous que vous avez confiance dans le contrat à cette adresse.
it: At Address questo è utilizzato per accedere un contratto che è già stato distribuito. Assume che l'indirizzo dato sia un'istanza del contratto selezionato. Nota: Non c'è un controllo a questo punto, quindi fai attenzione quando utilizzi questa caratteristica, assicurati di poterti fidare del contratto a quell'indirizzo.
zh_cn: 在 Address 这用于访问已经部署的合约。 它假设给定的地址是所选合约的一个实例。 注意：此时没有检查，因此在使用此功能时要小心，并确保您信任该地址的合约。

source: Pending Instances
es: Instancias pendientes
fr_fr: Instances en attente
it: Istanze Pendenti
zh_cn: 待处理的实例

source: Validating a transaction takes several seconds. During this time, the GUI shows it in a pending mode. When the transaction is mined, the number of pending transactions is updated and the transaction is added to the log (see terminal).
es: La validación de una transacción tarda varios segundos. Durante este tiempo, la interfaz gráfica de usuario la muestra en modo pendiente. Cuando la transacción es minada, el número de transacciones pendientes se actualiza y la transacción se añade al registro (ver terminal).
fr_fr: La validation d'une transaction prend plusieurs secondes. Pendant ce temps, l'interface graphique l'affiche en mode "en attente". Lorsque la transaction est traitée, le nombre de transactions en attente est mis à jour et la transaction est ajoutée au journal (voir le terminal).
it: Validare una transazione può metterci diversi secondi. Durante questo tempo la GUI la mostrerà in modalità pendente. Quando la transazione è estratta, il numero delle transazioni pendenti viene aggiornato e la transazione viene aggiunta al registro (vedi terminale).
zh_cn: 验证交易需要几秒钟。 在此期间，GUI 将其显示为挂起模式。 当交易被挖掘时，挂起交易的数量被更新并且交易被添加到日志中(见终端)。

source: Using the ABI
es: Utilización del ABI
fr_fr: Utilisation de l'ABI
it: Utilizzare l'ABI
zh_cn: 使用 ABI
