Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: For CI implementation example, see Su Squares contract and Travis build that uses remix-tests for continuous integration testing.
es: Para ver un ejemplo de implementación de CI, consulte el contrato Su Squares y la compilación Travis que utiliza remix-tests para las pruebas de integración continua.
fr_fr: Pour un exemple de mise en œuvre de l'intégration continue, voir le contrat Su Squares et la construction Travis qui utilise remix-tests pour les tests d'intégration continue.
it: Per un esempio di implementazione CI, vedere il contratto Su Squares e la versione di Travis che utilizza remix-test per i test di integrazione continua.
zh_cn: 对于 CI 实现示例，请参阅使用 remix-tests 进行持续集成测试的 Su Squares 合约和 Travis 构建。

source: Assert
zh_cn: 断言

source: General
fr_fr: Général
it: Generale
zh_cn: 常规

source: `Solidity documentation <https://solidity.readthedocs.io>`__
fr_fr: `Documentation Solidity <https://solidity.readthedocs.io>`__
it: `Documentazione Solidity <https://solidity.readthedocs.io>`__
zh_cn: `Solidity 文档 <https://solidity.readthedocs.io>`__

source: Terminal
it: Terminale
zh_cn: 终端

source: Stop
fr_fr: Arrêter
it: Ferma
zh_cn: 停止

source: actual: <uint | int | bool | address | bytes32 | string>
fr_fr: actuel : <uint | int | bool | address | bytes32 | string>
