Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: The other JSON file is named contractName.json . The contractName.json file contains the compilation's artifact that is needed for linking a library to the file. It contains the link to the libraries, the bytecode, the deployed bytecode, the gas estimation, the method identifiers, and the ABI.
es: El otro archivo JSON se llama contractName.json . El archivo contractName.json contiene el artefacto de la compilación que es necesario para enlazar una biblioteca al archivo. Contiene el enlace a las bibliotecas, el código de byte, el código de byte desplegado, la estimación del gas, los identificadores del método y el ABI.
fr_fr: L'autre fichier JSON est nommé contractName.json . Le fichier contractName.json contient l'artefact de compilation nécessaire pour lier une bibliothèque au fichier. Il contient le lien vers les bibliothèques, le bytecode, le bytecode déployé, l'estimation des gaz, les identifiants de méthode et l'ABI.
it: L'altro file JSON è chiamato contractName.json . Il file contractName.json contiene l'artefatto di compilazione necessario per collegare una libreria al file. Contiene il collegamento alle librerie, il bytecode, il bytecode distribuito, la stima del carburante, gli identificatori dei metodi e l'ABI.
zh_cn: 另一个 JSON 文件名为 contractName.json 。 contractName.json 文件包含将库链接到文件所需的编译工件。 它包含库的链接、字节码、部署的字节码、gas估算、方法标识符和 ABI。

source: In order to generate these artifact files, the Generate contract metadata box in the General settings section of the Settings module needs to be checked. The these metadatas files will then be generated when you compile a file and will be placed in the artifacts folder - which you can see in the Files Explorers plugin.
es: Para poder generar estos archivos de artefactos, es necesario marcar la casilla Generar metadatos contractuales en la sección Configuración General del módulo Configuración. Estos archivos de metadata se generarán cuando se compila un archivo y se colocará en la carpeta de artefactos - que se puede ver en el plugin Archivos Explorers.
fr_fr: Pour générer ces fichiers d'artefacts, vous devez cocher la case Générer les métadonnées du contrat dans la section Paramètres généraux du module Paramètres. Ces fichiers de métadonnées seront alors générés lorsque vous compilerez un fichier et seront placés dans le dossier des artefacts - que vous pouvez voir dans le plugin Explorateur de fichiers.
it: Per generare questi file artefatti, è necessario selezionare la casella Genera metadati del contratto nella sezione Impostazioni generali del modulo Impostazioni. I file di metadati verranno quindi generati quando si compila un file e saranno inseriti nella cartella degli artefatti, visibile nel plugin Esplora File.
zh_cn: 为了生成这些artifact文件，需要选中设置模块的常规设置部分中的生成合约元数据框。 这些元数据文件将在您编译文件时生成，并将放置在 artifacts 文件夹中 - 您可以在 Files Explorers 插件中看到该文件夹。

source: You can write scripts that can access either of these files.
es: Puede escribir scripts que tengan acceso a cualquiera de estos archivos.
fr_fr: Vous pouvez écrire des scripts qui peuvent accéder à l'un ou l'autre de ces fichiers.
it: È possibile scrivere script in grado di accedere a uno di questi file.
zh_cn: 你可以编写脚本来访问这两个文件中的任何一个。

source: Library Deployment with filename.json
es: Despliegue de la biblioteca con filename.json
fr_fr: Déploiement de bibliothèques avec filename.json
it: Distribuzione della Libreria con filename.json
zh_cn: 使用 filename.json 部署库

source: By default Remix automatically deploys needed libraries.
es: Por defecto, Remix implementa automáticamente las bibliotecas necesarias.
fr_fr: Par défaut, Remix déploie automatiquement les bibliothèques nécessaires.
it: Per impostazione predefinita, Remix distribuisce automaticamente le librerie necessarie.
zh_cn: 默认情况下，Remix 会自动部署所需的库。

source: When you open the metadata file for the libraries - artifact/filename.json you will see the following sections:
es: Cuando abra el archivo de metadatos para las bibliotecas - artifact/filename.json verá las siguientes secciones:
fr_fr: Lorsque vous ouvrez le fichier de métadonnées pour les bibliothèques - artefact/filename.json, vous verrez les sections suivantes :
it: Quando si apre il file dei metadati delle librerie - artifact/filename.json - si vedranno le seguenti sezioni:
zh_cn: 当您打开库的元数据文件 - artifact/filename.json 时，您将看到以下部分：

source: linkReferences contains a map representing libraries which depend on the current contract. Values are addresses of libraries used for linking the contract.
es: linkReferences contiene un mapa que representa las bibliotecas que dependen del contrato actual. Los valores son las direcciones de las bibliotecas utilizadas para vincular el contrato.
fr_fr: <code>linkReferences</code> contient une carte représentant les bibliothèques qui dépendent du contrat actuel. Les valeurs sont les adresses des bibliothèques utilisées pour relier le contrat.
it: linkReferences contiene una mappa che rappresenta le librerie che dipendono dal contratto attuale. I valori sono gli indirizzi delle librerie utilizzate per il collegamento del contratto.
zh_cn: linkReferences 包含一个表示依赖于当前合约的库的映射。 值是用于链接合约的程序库的地址。

source: autoDeployLib defines if the libraries should be auto deployed by Remix or if the contract should be linked with libraries described in linkReferences
es: autoDeployLib define si las librerías deben ser desplegadas automáticamente por Remix o si el contrato debe estar vinculado con las librerías descritas en linkReferences
fr_fr: <code>autoDeployLib</code> définit si les bibliothèques doivent être automatiquement déployées par Remix ou si le contrat doit être lié avec les bibliothèques décrites dans <code>linkReferences</code>.
it: autoDeployLib definisce se le librerie devono essere distribuite automaticamente da Remix o se il contratto deve essere collegato con le librerie descritte in linkReferences
zh_cn: autoDeployLib 定义库是否应由 Remix 自动部署，或者合约是否应与 linkReferences 中描述的程序库链接

source: Note that Remix will resolve addresses corresponding to the current network. By default, a configuration key follows the form: <network_name>:<networkd_id>, but it is also possible to define <network_name> or <network_id> as keys.
es: Tenga en cuenta que Remix resolverá las direcciones correspondientes a la red actual. Por defecto, una clave de configuración sigue el formulario: <network_name>:<networkd_id>, pero también es posible definir <network_name> o <network_id> como llaves.
fr_fr: Notez que Remix résoudra les adresses correspondant au réseau actuel. Par défaut, une clé de configuration suit la forme : <network_name>:<networkd_id>, mais il est également possible de définir <network_name> ou <network_id> comme clés.
it: Si noti che Remix risolverà gli indirizzi corrispondenti alla rete corrente. Per impostazione predefinita, una chiave di configurazione segue la forma: <network_name>:<networkd_id>, ma è anche possibile definire <network_name> o <network_id> come chiavi.
zh_cn: 请注意，Remix 将解析与当前网络对应的地址。 默认情况下，配置键遵循以下形式：<network_name>:<networkd_id>，但也可以将 <network_name> 或 <network_id> 定义为键。

source: Here is a sample metadata file for linking a library:
es: Aquí hay un archivo de metadatos de ejemplo para enlazar una biblioteca:
fr_fr: Voici un exemple de fichier de métadonnées pour lier une bibliothèque :
it: Ecco un esempio di file di metadati per il collegamento di una libreria:
zh_cn: 这是用于链接库的示例元数据文件：

source: Creating and Deploying a Contract
es: Crear y desplegar un contrato
fr_fr: Création et déploiement d'un contrat
it: Creazione e distribuzione di un contratto
zh_cn: 创建和部署合约

source: There are 3 type of environments Remix can be plugged to: Javascript VM, Injected provider, or Web3 provider. (for details see Running transactions)
es: Hay 3 tipos de entornos que Remix se pueden conectar a: proveedor de VM Javascript, Inyectado o proveedor Web3. (para más detalles ver las transacciones en ejecución)
fr_fr: Il y a 3 types d'environnements sur lesquels Remix peut être branché : Javascript VM, fournisseur injecté, ou fournisseur Web3. (pour plus de détails, voir Exécuter des transactions)
it: Ci sono 3 tipi di ambienti a cui Remix può essere collegato: Javascript VM, Injected provider o Web3 provider. (per i dettagli vedere Esecuzione delle transazioni)
zh_cn: Remix 可以插入 3 种类型的环境：Javascript VM、Injected 提供程序或 Web3 提供程序。 (有关详细信息，请参阅运行事务)

source: Both Web3 provider and Injected provider require the use of an external tool.
es: Tanto el proveedor Web3 como el proveedor Inyectado requieren el uso de una herramienta externa.
fr_fr: Le fournisseur Web3 et le fournisseur injecté nécessitent tous deux l'utilisation d'un outil externe.
it: Sia il Web3 provider che Injected provider richiedono l'uso di uno strumento esterno.
zh_cn: Web3 提供商和 Injected 提供商都需要使用外部工具。

source: The external tool for Web3 provider is an Ethereum node and for Injected provider Metamask.
es: La herramienta externa para el proveedor Web3 es un nodo Ethereum y para el proveedor Inyected Metamask.
fr_fr: L'outil externe pour le fournisseur Web3 est un nœud Ethereum et pour le fournisseur injecté Metamask.
it: Lo strumento esterno per il Web3 provider è un nodo Ethereum e per Injected provider Metamask.
zh_cn: Web3 提供商的外部工具是以太坊节点和 Injected 提供商 Metamask。

source: The JavaScript VM mode is convenient because each execution runs in your browser and you don't need any other software or Ethereum node to run it.
es: El modo VM JavaScript es conveniente porque cada ejecución se ejecuta en su navegador y no necesita ningún otro software o nodo Ethereum para ejecutarlo.
fr_fr: Le mode JavaScript VM est pratique car chaque exécution se déroule dans votre navigateur et vous n'avez besoin d'aucun autre logiciel ou nœud Ethereum pour l'exécuter.
it: La modalità JavaScript VM è comoda perché ogni esecuzione viene effettuata nel browser e non è necessario alcun altro software o nodo Ethereum per eseguirla.
zh_cn: JavaScript VM 模式很方便，因为每次执行都在您的浏览器中运行，您不需要任何其他软件或以太坊节点来运行它。

source: So, it is the easiest test environment - no setup required!
es: Por lo tanto, es el entorno de prueba más fácil - ¡no se requiere ninguna configuración!
fr_fr: Il s'agit donc de l'environnement de test le plus simple - aucune installation n'est nécessaire !
it: Si tratta quindi dell'ambiente di test più semplice, che non richiede alcuna configurazione!
zh_cn: 因此，它是最简单的测试环境 - 无需设置！

source: But keep in mind that reloading the browser when you are in the Javascript VM will restart Remix in an empty state.
es: Pero ten en cuenta que recargar el navegador cuando estás en la máquina virtual Javascript reiniciará Remix en un estado vacío.
fr_fr: Mais gardez à l'esprit que recharger le navigateur lorsque vous êtes dans la VM Javascript redémarrera Remix dans un état vide.
it: Tieni però presente che ricaricando il browser quando sei nella VM Javascript, Remix si riavvierà in uno stato vuoto.
zh_cn: 但请记住，当您在 Javascript VM 中时重新加载浏览器会以空状态重新启动 Remix。

source: For performance purposes ( which is to say - for testing in an environment that is closest to the mainnet), it might also be better to use an external node.
es: Para propósitos de rendimiento (es decir, para probar en un entorno más cercano al mainnet), también podría ser mejor usar un nodo externo.
fr_fr: Pour des raisons de performance (c'est-à-dire pour des tests dans un environnement qui est le plus proche du réseau principal), il peut également être préférable d'utiliser un nœud externe.
it: Ai fini delle prestazioni (cioè per i test in un ambiente più simile alla rete principale), potrebbe essere meglio utilizzare un nodo esterno.
zh_cn: 出于性能目的(也就是说 - 在最接近主网的环境中进行测试)，使用外部节点可能会更好。

source: Selecting the VM mode
es: Seleccionando el modo VM
fr_fr: Sélection du mode VM
it: Selezionare la modalità VM
zh_cn: 选择 VM 模式

source: Make sure the VM mode is selected. All accounts displayed in Accounts should have 100 ether.
es: Asegúrese de que el modo VM está seleccionado. Todas las cuentas mostradas en los clientes deben tener 100 éter.
fr_fr: Assurez-vous que le mode VM est sélectionné. Tous les comptes affichés dans Comptes doivent avoir 100 éther.
it: Assicurarsi che sia selezionata la modalità VM. Tutti gli account visualizzati in Account dovrebbero avere 100 ether.
zh_cn: 确保选择了 VM 模式。 Accounts 中显示的所有账户都应该有 100 个ETH。

source: Sample contract
es: Contrato de ejemplo
fr_fr: Contrat d'exemple
it: Contratto di esempio
zh_cn: 合约示范

source: This contract is very basic. The goal is to quickly start to create and to interact with a sample contract.
es: Este contrato es muy básico, el objetivo es comenzar rápidamente a crear e interactuar con un contrato de muestra.
fr_fr: Ce contrat est très basique. L'objectif est de commencer rapidement à créer et à interagir avec un exemple de contrat.
it: Questo contratto è molto semplice. L'obiettivo è quello di iniziare rapidamente a creare e interagire con un contratto di esempio.
zh_cn: 这份合约非常基础。 目标是快速开始创建示例合约并与之交互。

source: Deploying an instance
es: Despliega una instancia
fr_fr: Déploiement d'une instance
it: Distribuire un'istanza
zh_cn: 部署实例

source: The Compile tab displays information related to the current contract (note that there can be more than one) (see compile).
es: La ficha de compilación muestra información relacionada con el contrato actual (tenga en cuenta que puede haber más de uno) (ver compilación).
fr_fr: L'onglet Compiler affiche des informations relatives au contrat en cours (notez qu'il peut y en avoir plusieurs) (voir Compiler).
it: La scheda Compilazione visualizza le informazioni relative al contratto attuale (si noti che possono essercene più di uno) (vedere Compilazione).
zh_cn: 编译选项卡显示与当前合约相关的信息(注意可以有多个)(参见编译)。

source: Moving on, in the Run tab select, JavaScript VM to specify that you are going to deploy an instance of the contract in the JavaScript VM state.
es: Activando, en la pestaña Ejecutar, seleccionar, VM JavaScript para especificar que va a desplegar una instancia del contrato en el estado de la máquina virtual JavaScript.
fr_fr: Dans l'onglet Exécuter, sélectionnez VM JavaScript pour spécifier que vous allez déployer une instance du contrat dans l'état VM JavaScript.
it: Proseguendo, nella scheda Esegui seleziona JavaScript VM per specificare che stai per distribuire un'istanza del contratto nello stato JavaScript VM.
zh_cn: 继续，在 Run 选项卡中选择 JavaScript VM，以指定您将在 JavaScript VM 状态下部署合同实例。

source: The constructor of Ballot.sol needs a parameter (of type uint8). Give any value and click on Deploy.
es: El constructor de Ballot.sol necesita un parámetro (de tipo uint8). Dele un valor cualquiera y haga clic en Desplegar.
fr_fr: Le constructeur de Ballot.sol a besoin d'un paramètre (de type uint8). Donnez-lui une valeur quelconque et cliquez sur Deploy.
it: Il costruttore di Ballot.sol ha bisogno di un parametro (di tipo uint8). Indica un valore qualsiasi e fai clic su Deploy.
zh_cn: Ballot.sol 的构造函数需要一个参数(类型为 uint8)。 给出任何值并单击部署。

source: The transaction which deploys the instance of Ballot is created.
es: Se crea la transacción que despliega la instancia de Ballot.
fr_fr: La transaction qui déploie l'instance de Ballot est créée.
it: Viene creata la transazione che distribuisce l'istanza di Ballot.
zh_cn: 创建部署 Ballot 实例的事务。

source: In a "normal" blockchain, it can take several seconds to execute. This is the time for the transaction to be mined. However, because we are using the JavaScript VM, our execution is immediate.
es: En una blockchain "normal", puede tardar varios segundos en ejecutarse. Este es el tiempo que tarda la transacción en ser minada. Sin embargo, como estamos utilizando la VM JavaScript, nuestra ejecución es inmediata.
fr_fr: Dans une blockchain "normale", l'exécution peut prendre plusieurs secondes. C'est le temps nécessaire pour que la transaction soit minée. Cependant, comme nous utilisons la VM JavaScript, notre exécution est immédiate.
it: In una blockchain "normale", l'esecuzione può richiedere diversi secondi. Questo è il tempo necessario alla transazione per essere processata. Tuttavia, poiché stiamo utilizzando la VM JavaScript, l'esecuzione è immediata.
zh_cn: 在“正常”区块链中，执行可能需要几秒钟。 这是交易被挖掘的时间。 但是，因为我们使用的是 JavaScript VM，所以我们的执行是立即的。

source: The terminal will inform you about the transaction. You can see details there and start debugging.
es: El terminal le informará de la transacción. Allí podrá ver los detalles e iniciar la depuración.
fr_fr: Le terminal vous informe de la transaction. Vous pouvez y voir les détails et commencer le débogage.
it: Il terminale ti informerà della transazione. È possibile visualizzare i dettagli e avviare il debug.
zh_cn: 终端机将通知您有关交易的信息。 您可以在那里查看详细信息并开始调试。

source: The newly created instance is displayed in the run tab.
es: La instancia recién creada aparece en la pestaña de ejecución.
fr_fr: L'instance nouvellement créée est affichée dans l'onglet d'exécution.
it: L'istanza appena creata viene visualizzata nella scheda di esecuzione.
zh_cn: 新创建的实例显示在运行选项卡中。

source: Interacting with an instance
es: Interactuar con una instancia
fr_fr: Interagir avec une instance
it: Interagire con un'istanza
zh_cn: 与实例交互

source: This new instance contains 3 actions which corresponds to the 3 functions (setP, setPN, get). Clicking on SetP or SetPN will create a new transaction.
es: Esta nueva instancia contiene 3 acciones que corresponden a las 3 funciones (setP, setPN, get). Al hacer clic en SetP o SetPN se creará una nueva operación.
fr_fr: Cette nouvelle instance contient 3 actions qui correspondent aux 3 fonctions (setP, setPN, get). En cliquant sur SetP ou SetPN, vous créez une nouvelle transaction.
it: Questa nuova istanza contiene 3 azioni che corrispondono alle 3 funzioni (setP, setPN, get). Facendo clic su SetP o SetPN si crea una nuova transazione.
zh_cn: 这个新实例包含对应于 3 个函数(setP、setPN、get) 的 3 个动作。 单击 SetP 或 SetPN 将创建一个新事务。

source: Note that SetP is payable (red button) : it is possible to send value (Ether) to the contract.
es: Observe que SetP es pagable (botón rojo) : es posible enviar valor (Ether) al contrato.
fr_fr: Notez que SetP est payable (bouton rouge) : il est possible d'envoyer de la valeur (Ether) au contrat.
it: Si noti che SetP è "pagabile" (pulsante rosso): è possibile inviare valore (Ether) al contratto.
zh_cn: 请注意，SetP 是应付(红色按钮)：可以向合约发送值(以太币)。

source: SetPN is not payable (orange button - depending on the theme) : it is not possible to send value (Ether) to the contract.
es: SetPN no es pagable (botón naranja - según el tema) : no es posible enviar valor (Ether) al contrato.
fr_fr: SetPN n'est pas payable (bouton orange - selon le thème) : il n'est pas possible d'envoyer de la valeur (Ether) au contrat.
it: SetPN non è "pagabile" (pulsante arancione - a seconda del tema): non è possibile inviare valore (Ether) al contratto.
zh_cn: SetPN 不支付(橙色按钮 - 取决于主题)：无法向合约发送值(以太币)。

source: Clicking on get will not execute a transaction (usually its a blue button - depending on the theme). It doesn't execute a transaction because a get does not modify the state (variable value) of this instance.
es: Al hacer clic en get no se ejecuta una transacción (normalmente es un botón azul - dependiendo del tema). No ejecuta una transacción porque un get no modifica el estado (valor de la variable) de esta instancia.
fr_fr: Cliquer sur get n'exécutera pas de transaction (il s'agit généralement d'un bouton bleu - en fonction du thème). Il n'exécute pas de transaction parce qu'un get ne modifie pas l'état (la valeur de la variable) de cette instance.
it: Cliccando su "get" non si esegue una transazione (di solito è un pulsante blu, a seconda del tema). Non esegue una transazione perché un "get" non modifica lo stato (valore della variabile) di questa istanza.
zh_cn: 单击获取不会执行交易(通常是蓝色按钮 - 取决于主题)。 它不会执行事务，因为 get 不会修改此实例的状态(变量值)。

source: As get is view you can see the return value just below the action.
es: Como get es view puede ver el valor de retorno justo debajo de la acción.
fr_fr: Comme get is view, vous pouvez voir la valeur de retour juste en dessous de l'action.
it: Con la visualizzazione get is puoi vedere il valore ritornato subito sotto l'azione.
zh_cn: 作为 get 视图，您可以在操作下方看到返回值。

source: Debugger
es: Depurador
fr_fr: Débogueur
zh_cn: 调试器

source: This module allows you to debug the transaction. It can be used to deploy transactions created from Remix and already mined transactions. (debugging works only if the current environment provides the necessary features).
es: Este módulo le permite depurar la transacción. Puede utilizarse para desplegar transacciones creadas a partir de Remix y transacciones ya minadas. (La depuración sólo funciona si el entorno actual proporciona las características necesarias).
fr_fr: Ce module vous permet de déboguer la transaction. Il peut être utilisé pour déployer des transactions créées à partir de Remix et des transactions déjà minées. (le débogage ne fonctionne que si l'environnement actuel fournit les fonctionnalités nécessaires).
it: Questo modulo ti permette di fare il debug della transazione. Può essere utilizzato per distribuire le transazioni create da Remix e per transazioni già minate. (il debugging funziona solo se l'ambiente corrente fornisce le caratteristiche necessarie).
zh_cn: 该模块允许您调试事务。 它可用于部署从 Remix 创建的交易和已挖掘的交易。(仅当当前环境提供必要的功能时，调试才有效)。

source: To get to the debugger - you can click the debug button in the terminal when a successful or failed transaction appears there. You can also load the module from the plugin manager and then click the bug in the icon panel. Or you can get to the debugger by running the debug command in the console.
es: Para acceder al depurador, puede hacer clic en el botón de depuración del terminal cuando aparezca allí una transacción correcta o fallida. También puede cargar el módulo desde el gestor de plugins y luego hacer clic en el error en el panel de iconos. O puede llegar al depurador ejecutando el comando de depuración en la consola.
fr_fr: Pour accéder au débogueur, vous pouvez cliquer sur le bouton de débogage dans le terminal lorsqu'une transaction réussie ou échouée y apparaît. Vous pouvez également charger le module à partir du gestionnaire de plugins, puis cliquer sur le bogue dans le panneau d'icônes. Vous pouvez également accéder au débogueur en lançant la commande debug dans la console.
it: Per arrivare al debugger - puoi cliccare il pulsante debug nel terminale quando una transazione appare con successo o fallisce. Puoi anche caricare il modulo dal gestore plugin e poi cliccare l'insetto nel pannello con le icone. Puoi arrivare al debugger anche eseguendo un comando debug dalla console.
zh_cn: 要进入调试器 - 当成功或失败的事务出现在终端时，您可以单击终端中的调试按钮。 您还可以从插件管理器加载模块，然后单击图标面板中的错误。 或者，您可以通过在控制台中运行调试命令来访问调试器。

source: To learn more about how to use this tool go to the debugger tutorial.
es: Para saber más sobre cómo utilizar esta herramienta, vaya al tutorial del depurador.
fr_fr: Pour en savoir plus sur l'utilisation de cet outil, consultez le tutoriel sur le débogueur.
it: Per saperne di più su come utilizzare questo strumento vai al tutorial per il debugger.
zh_cn: 要了解有关如何使用此工具的更多信息，请访问调试器教程。

source: FAQ
es: Preguntas Frecuentes (FAQ)
it: Domande Frequenti
zh_cn: 常见问题

source: Solidity compiler
es: Compilador Solidity
fr_fr: Compilateur Solidity
it: Compilatore per Solidity
zh_cn: Solidity 编译器

source: Q: Error: compiler might be in a non-sane state
es: P: Error: el compilador podría estar en un estado no cuerdo
fr_fr: Q : Erreur : le compilateur n'est peut-être pas dans un état normal.
it: D: Errore: il compilatore potrebbe essere in uno stato non sano
zh_cn: 问：错误：编译器可能处于非正常状态
