Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: ethers.HDNode: A Hierarchical Deterministic Wallet represents a large tree of private keys which can reliably be reproduced from an initial seed.
es: ethers.HDNode: Un monedero determinista jerárquico representa un gran árbol de claves privadas que pueden reproducirse de forma fiable a partir de una semilla inicial.
fr_fr: ethers.HDNode : Un portefeuille déterministe hiérarchique représente un grand arbre de clés privées qui peut être reproduit de manière fiable à partir d'une graine initiale.
it: ethers.HDNode: Un Portafoglio Gerarchico Deterministico rappresenta un albero grande di chiavi private che può essere riprodotto in modo affidabile da un seme iniziale.
zh_cn: ethers.HDNode：分层确定性钱包代表一棵大树的私钥，可以从初始种子可靠地复制。

source: ethers.Interface: The Interface Object is a meta-class that accepts a Solidity (or compatible) Application Binary Interface (ABI) and populates functions to deal with encoding and decoding the parameters to pass in and results returned.
es: ethers.Interface: El objeto interfaz es una metaclase que acepta una interfaz binaria de aplicación (ABI) de Solidity (o compatible) y rellena funciones para ocuparse de la codificación y descodificación de los parámetros a pasar y los resultados devueltos.
fr_fr: ethers.Interface : L'objet interface est une méta-classe qui accepte une interface ABI (Application Binary Interface) de Solidity (ou compatible) et remplit des fonctions pour gérer l'encodage et le décodage des paramètres à transmettre et des résultats renvoyés.
it: ethers.Interface: L'Interfaccia Oggetto è una meta-classe che accetta un'Interfaccia Binaria di Applicazione (ABI) di Solidity (o compatibile) e popola le funzioni per trattare con codifica e decodifica i parametri da passare dentro e i risultati ritornati.
zh_cn: ethers.Interface：接口对象是一个元类，它接受一个 Solidity(或兼容的)应用程序二进制接口(ABI)并填充函数来处理编码和解码要传入的参数和返回的结果。

source: ethers.providers: A Provider abstracts a connection to the Ethereum blockchain, for issuing queries and sending state changing transactions.
es: ethers.providers: Un proveedor abstrae una conexión a la blockchain de Ethereum, para emitir consultas y enviar transacciones que cambian de estado.
fr_fr: ethers.providers : Un fournisseur abstrait une connexion à la blockchain Ethereum, pour l'émission de requêtes et l'envoi de transactions changeant d'état.
it: ethers.providers: Un Provider astrae una connessione alla blockchain Ethereum, per emettere interrogazioni e inviare transazioni di cambiamento di stato.
zh_cn: ethers.providers：提供商抽象出于以太坊区块链的连接，用于发出查询和发送状态变化的交易。

source: ethers.SigningKey: The SigningKey interface provides an abstraction around the secp256k1 elliptic curve cryptography library.
es: ethers.SigningKey: La interfaz SigningKey proporciona una abstracción en torno a la biblioteca de criptografía de curva elíptica secp256k1.
fr_fr: ethers.SigningKey : L'interface SigningKey fournit une abstraction autour de la bibliothèque de cryptographie à courbe elliptique secp256k1.
it: ethers.SigningKey: L'interfaccia SigningKey fornisce un'astrazione attorno alla libreria crittografica di curva ellittica secp256k1.
zh_cn: ethers.SigningKey：SigningKey 接口提供了围绕 secp256k1 椭圆曲线密码库的抽象。

source: ethers.utils: The utility functions exposed in both the ethers umbrella package and the ethers-utils.
es: ethers.utils: Las funciones de utilidad expuestas tanto en el paquete paraguas ethers como en el ethers-utils.
fr_fr: ethers.utils : Les fonctions utilitaires exposées à la fois dans le paquet ethers umbrella et dans le paquet ethers-utils.
it: ethers.utils: Le funzioni di utilità espongono sia il pacchetto ombrello di ethers sia le utilità di ethers.
zh_cn: ethers.utils：ethers 伞包和 ethers-utils 中公开的实用程序函数。

source: ethers.utils.AbiCoder: Create a new ABI Coder object
es: ethers.utils.AbiCoder: Crear un nuevo objeto ABI Coder
fr_fr: ethers.utils.AbiCoder : Créer un nouvel objet ABI Coder
it: ethers.utils.AbiCoder: Crea un nuovo oggetto ABI Coder
zh_cn: ethers.utils.AbiCoder：创建一个新的 ABI Coder 对象

source: ethers.utils.RLP: This encoding method is used internally for several aspects of Ethereum, such as encoding transactions and determining contract addresses.
es: ethers.utils.RLP: Este método de codificación se utiliza internamente para varios aspectos de Ethereum, como la codificación de las transacciones y la determinación de las direcciones de los contratos.
fr_fr: ethers.utils.RLP : Cette méthode d'encodage est utilisée en interne pour plusieurs aspects d'Ethereum, tels que l'encodage des transactions et la détermination des adresses des contrats.
it: ethers.utils.RLP: Questo metodo di codifica è utilizzato internamente per molti aspetti di Ethereum, come ad esempio per codificare transazioni e determinare l'indirizzo dei contratti.
zh_cn: ethers.utils.RLP：这种编码方法在内部用于以太坊的几个方面，例如编码交易和确定合约地址。

source: ethers.Wallet: A wallet manages a private/public key pair which is used to cryptographically sign transactions and prove ownership on the Ethereum network.
es: ethers.Wallet: Un monedero gestiona un par de claves privada/pública que se utiliza para firmar criptográficamente las transacciones y demostrar la propiedad en la red Ethereum.
fr_fr: ethers.Wallet : Un wallet gère une paire de clés privée/publique qui est utilisée pour signer cryptographiquement les transactions et prouver la propriété sur le réseau Ethereum.
it: ethers.Wallet: un portafoglio gestisce una coppia chiave privata/pubblica che viene utilizzata per firmare crittograficamente le transazioni e dimostrare la proprietà sulla rete Ethereum.
zh_cn: ethers.Wallet：钱包管理私钥/公钥对，用于对交易进行加密签名并证明以太坊网络的所有权。

source: ethers.version: Contains the version of the ethers container object.
es: ethers.version: Contiene la versión del objeto contenedor ethers.
fr_fr: ethers.version : Contient la version de l'objet conteneur ethers.
it: ethers.version: Contiene la versione dell'oggetto contenitore di ethers.
zh_cn: ethers.version：包含Eth容器对象的版本。

source: web3.bzz: Bzz module for interacting with the swarm network.
es: web3.bzz: Módulo Bzz para interactuar con la red del enjambre.
fr_fr: web3.bzz : module Bzz pour interagir avec le réseau de l'essaim.
it: web3.bzz: Il modulo Bzz per interagire con la rete swarm.
zh_cn: web3.bzz：用于与 swarm 网络交互的 Bzz 模块。

source: web3.eth: Eth module for interacting with the Ethereum network.
es: web3.eth: Módulo Eth para interactuar con la red Ethereum.
fr_fr: web3.eth : Module Eth pour interagir avec le réseau Ethereum.
it: web3.eth: Il modulo Eth per interagire con la rete Ethereum.
zh_cn: web3.eth：用于与以太坊网络交互的 Eth 模块。

source: web3.eth.accounts: The web3.eth.accounts contains functions to generate Ethereum accounts and sign transactions and data.
es: web3.eth.accounts: web3.eth.accounts contiene funciones para generar cuentas Ethereum y firmar transacciones y datos.
fr_fr: web3.eth.accounts : Le site web3.eth.accounts contient des fonctions permettant de générer des comptes Ethereum et de signer des transactions et des données.
it: web3.eth.accounts: Lo web3.eth.accounts contiene funzioni per generare account Ethereum e firmare transazioni e dati.
zh_cn: web3.eth.accounts：web3.eth.accounts 包含生成以太坊账户以及签署交易和数据的功能。

source: web3.eth.abi: The web3.eth.abi functions let you de- and encode parameters to ABI (Application Binary Interface) for function calls to the EVM (Ethereum Virtual Machine).
es: web3.eth.abi: Las funciones web3.eth.abi le permiten de- y codificar parámetros a ABI (Application Binary Interface) para llamadas de función a la EVM (Ethereum Virtual Machine).
fr_fr: web3.eth.abi : Les fonctions web3.eth.abi vous permettent de dé- et d'encoder des paramètres à l'ABI (Application Binary Interface) pour les appels de fonction à l'EVM (Ethereum Virtual Machine).
it: web3.eth.abi: Le funzioni web3.eth.abi ti permettono di de- e codificare parametri in ABI (Interfaccia Binaria dell' Applicazione) per chiamate della funzione alla EVM (Macchina Virtuale di Ethereum).
zh_cn: web3.eth.abi：web3.eth.abi 函数让您可以将参数解译和编码为 ABI(应用程序二进制接口)，以便对 EVM(以太坊虚拟机)进行函数调用。

source: web3.eth.ens: The web3.eth.ens functions let you interacting with ENS.
es: web3.eth.ens: Las funciones web3.eth.ens le permiten interactuar con ENS.
fr_fr: web3.eth.ens : Les fonctions web3.eth.ens vous permettent d'interagir avec ENS.
it: web3.eth.ens: Le funzioni web3.eth.ens ti permettono di interagire con ENS.
zh_cn: web3.eth.ens：web3.eth.ens 函数让你与 ENS 交互

source: web3.eth.Iban: The web3.eth.Iban function lets convert Ethereum addresses from and to IBAN and BBAN.
es: web3.eth.Iban: La función web3.eth.Iban permite convertir direcciones Ethereum de y a IBAN y BBAN.
fr_fr: web3.eth.Iban : La fonction web3.eth.Iban permet de convertir les adresses Ethereum de et vers IBAN et BBAN.
it: web3.eth.Iban: La funzione web3.eth.Iban ti permette di convertire indirizzi Ethereum da e a IBAN e BBAN.
zh_cn: web3.eth.Iban：web3.eth.Iban 函数允许将以太坊地址从 IBAN 和 BBAN 转换为 IBAN 和 BBAN。

source: web3.eth.net: Net module for interacting with network properties.
es: web3.eth.net: Módulo de red para interactuar con las propiedades de la red.
fr_fr: web3.eth.net : Module réseau permettant d'interagir avec les propriétés du réseau.
it: web3.eth.net: Modulo net per interagire con le proprietà di rete.
zh_cn: web3.eth.net：用于与网络属性交互的网络模块。

source: web3.eth.personal: Personal module for interacting with the Ethereum accounts.
es: web3.eth.personal: Módulo personal para interactuar con las cuentas de Ethereum.
fr_fr: web3.eth.personal : Module personnel pour interagir avec les comptes Ethereum.
it: web3.eth.personal: Modulo personale per interagire con gli account di Ethereum.
zh_cn: web3.eth.personal：用于与以太坊账户交互的个人模块。

source: web3.eth.subscribe: The web3.eth.subscribe function lets you subscribe to specific events in the blockchain.
es: web3.eth.subscribe: La función web3.eth.subscribe le permite suscribirse a eventos específicos en el blockchain.
fr_fr: web3.eth.subscribe : La fonction web3.eth.subscribe vous permet de vous abonner à des événements spécifiques de la blockchain.
it: web3.eth.subscribe: La funzione web3.eth.subscribe ti permette di iscriverti a eventi specifici nella blockchain.
zh_cn: web3.eth.subscribe：web3.eth.subscribe 功能让您可以订阅区块链中的特定事件。

source: web3.givenProvider: When using web3.js in an Ethereum compatible browser, it will set with the current native provider by that browser. Will return the given provider by the (browser) environment, otherwise null.
es: web3.givenProvider: Cuando se utiliza web3.js en un navegador compatible con Ethereum, se establecerá con el proveedor nativo actual por ese navegador. Devolverá el proveedor dado por el entorno (del navegador), en caso contrario null.
fr_fr: web3.givenProvider : Lorsque vous utilisez web3.js dans un navigateur compatible Ethereum, il sera défini avec le fournisseur natif actuel de ce navigateur. Retourne le fournisseur donné par l'environnement (du navigateur), sinon null.
it: web3.givenProvider: Quando utilizzi web3.js in un browser compatibile con Ethereum, fisserà il provider corrente nativo da quel browser. Ritornerà il provider dato dall'ambiente (del browser), altrimenti nullo.
zh_cn: web3.givenProvider：在以太坊兼容的浏览器中使用 web3.js 时，它将由该浏览器设置为当前的本地提供程序。 将由(浏览器)环境返回给定的提供者，否则为空。

source: web3.modules: Contains the version of the web3 container object.
es: web3.modules: Contiene la versión del objeto contenedor web3.
fr_fr: web3.modules : Contient la version de l'objet conteneur web3.
it: web3.modules: Contengono la versione dell'oggetto contenitore di web3.
zh_cn: web3.modules：包含 web3 容器对象的版本。

source: web3.providers: Contains the current available providers.
es: web3.proveedores: Contiene los proveedores disponibles actualmente.
fr_fr: web3.providers : Contient les fournisseurs actuellement disponibles.
it: web3.providers: Contiene i provider attualmente disponibili.
zh_cn: web3.providers：包含当前可用的供应商。

source: web3.shh: Shh module for interacting with the whisper protocol
es: web3.shh: Módulo shh para interactuar con el protocolo whisper
fr_fr: web3.shh : Module Shh pour interagir avec le protocole whisper
it: web3.shh: Il modulo shh per interagire con il protocollo whisper
zh_cn: web3.shh：用于与 Whisper 协议交互的 Shh 模块

source: web3.utils: This package provides utility functions for Ethereum dapps and other **web3.js packages.
es: web3.utils: Este paquete proporciona funciones de utilidad para dapps Ethereum y otros paquetes **web3.js.
fr_fr: web3.utils : Ce paquet fournit des fonctions utilitaires pour les dapps Ethereum et d'autres **paquets web3.js.
it: web3.utils: Questo pacchetto fornisce funzioni di utilità per le dApp di Ethereum e altri pacchetti **web3.js.
zh_cn: web3.utils：该包为以太坊 dapps 和其他 **web3.js 包提供实用功能。

source: web3.version: Contains the version of the web3 container object.
es: web3.version: Contiene la versión del objeto contenedor web3.
fr_fr: web3.version : Contient la version de l'objet conteneur web3.
it: web3.version: Contiene la versione dell'oggetto contenitore di web3.
zh_cn: web3.version：包含 web3 容器对象的版本。

source: web3.eth.clearSubscriptions();: Resets subscriptions.
es: web3.eth.clearSubscriptions();: Restablece las suscripciones.
fr_fr: web3.eth.clearSubscriptions(); : Réinitialise les abonnements.
it: web3.eth.clearSubscriptions();: Resetta le iscrizioni.
zh_cn: web3.eth.clearSubscriptions();：重置订阅。

source: web3.eth.Contract(jsonInterface[, address][, options]): The **web3.eth.Contract object makes it easy to interact with smart contracts on the ethereum blockchain.
es: web3.eth.Contrato(jsonInterfaz[, dirección][, opciones]): El objeto **web3.eth.Contract facilita la interacción con los contratos inteligentes en la blockchain de ethereum.
fr_fr: web3.eth.Contract(jsonInterface[, address][, options]) : L'objet **web3.eth.Contract facilite l'interaction avec les contrats intelligents sur la blockchain ethereum.
it: web3.eth.Contract(jsonInterface[, address][, options]): L'oggetto **web3.eth.Contract rende facile l'interazione con i contratti intelligenti sulla blockchain Ethereum.
zh_cn: web3.eth.Contract(jsonInterface[, address][, options])：**web3.eth.Contract 对象可以轻松地与以太坊区块链上的智能合约进行交互。

source: web3.eth.accounts.create([entropy]);: The web3.eth.accounts contains functions to generate Ethereum accounts and sign transactions and data.
es: web3.eth.accounts.create([entropy]);: web3.eth.accounts contiene funciones para generar cuentas Ethereum y firmar transacciones y datos.
fr_fr: web3.eth.accounts.create([entropy]); : Le site web3.eth.accounts contient des fonctions permettant de générer des comptes Ethereum et de signer des transactions et des données.
it: web3.eth.accounts.create([entropy]);: La web3.eth.accounts contiene funzioni per generare account Ethereum e firmare transazioni e dati.
zh_cn: web3.eth.accounts.create([entropy]);：web3.eth.accounts 包含生成以太坊账户和签署交易和数据的功能。

source: Remixd: Access your Local Filesystem
es: Remixd: Acceda a su sistema de archivos local
fr_fr: Remixd : Accédez à votre système de fichiers local
it: Remixd: Accedi al tuo Sistema di File Locale
zh_cn: Remixd：访问您的本地文件系统

source: To give the Remix-ide (the web app) access to a folder on your local computer, you need to use remixd.
es: Para dar acceso a Remix-ide (la aplicación web) a una carpeta de su ordenador local, necesita utilizar remixd.
fr_fr: Pour donner à Remix-ide (l'application web) l'accès à un dossier sur votre ordinateur local, vous devez utiliser remixd.
it: Per dare accesso a una cartella del tuo computer locale alla Remix-IDE (l'applicazione web), devi utilizzare remixd.
zh_cn: 要让 Remix-ide(网络应用程序) 访问本地计算机上的文件夹，您需要使用 remixd。

source: remixd is both the name of an npm module and the name of a Remix-plugin. You need to install the plugin (from the plugin manager) and you need to install the remixd npm module.
es: remixd es a la vez el nombre de un módulo npm y el nombre de un plugin Remix. Necesita instalar el plugin (desde el gestor de plugins) y necesita instalar el módulo npm remixd.
fr_fr: remixd est à la fois le nom d'un module npm et le nom d'un plugin Remix. Vous devez installer le plugin (à partir du gestionnaire de plugins) et vous devez installer le module npm remixd.
it: remixd è sia il nome di un modulo npm che il nome di un plugin di Remix. È necessario installare il plugin (dal gestore di plugin) e il modulo npm chiamato remixd.
zh_cn: remixd 既是 npm 模块的名称，也是 Remix-plugin 的名称。 您需要安装插件(从插件管理器)，并且需要安装 remixd npm 模块。

source: NOTE: you need to install the remixd npm module & Run its command before activating the remixd plugin.
es: NOTA: necesita instalar el módulo npm remixd y ejecutar su comando antes de activar el plugin remixd.
fr_fr: NOTE : vous devez installer le module npm remixd et exécuter sa commande avant d'activer le plugin remixd.
it: NOTA: dovrai installare il modulo npm remixd & Eseguire il suo comando prima di attivare il plugin remixd.
zh_cn: 注意：在激活 remixd 插件之前，您需要安装 remixd npm 模块并运行它的命令。

source: The code of remixd is here .
es: El código de remixd está aquí .
fr_fr: Le code de remixd est ici .
it: Il codice di remixd è qui .
zh_cn: Remixd 的代码在这里。

source: remixd Installation
es: Instalación remixd
fr_fr: Installation remixd
it: Installazione di remixd
zh_cn: remixd安装

source: remixd can be globally installed using the following command: npm install -g remixd
es: remixd puede instalarse globalmente mediante el siguiente comando: npm install -g remixd
fr_fr: remixd peut être installé globalement en utilisant la commande suivante : npm install -g remixd
it: remixd può essere installato globalmente utilizzando il comando seguente: npm install -g remixd
zh_cn: remixd 可以使用以下命令全局安装： npm install -g remixd

source: Or just install it in the directory of your choice by removing the -g flag: npm install remixd
es: O simplemente instálelo en el directorio de su elección eliminando la bandera -g: npm install remixd
fr_fr: Vous pouvez également l'installer dans le répertoire de votre choix en supprimant le drapeau -g : npm install remixd
it: O semplicemente installalo in una cartella a tua scelta rimuovendo il flag -g: npm install remixd
zh_cn: 或者通过删除 -g 标志将其安装在您选择的目录中： npm install remixd

source: remixd Command
es: Comando remixd
fr_fr: Commande remixd
it: Comando remixd
zh_cn: remixd命令

source: From the terminal, the command remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> will start remixd and will share the given folder with remix-ide.
es: Desde el terminal, el comando remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> iniciará remixd y compartirá la carpeta dada con remix-ide.
fr_fr: Dans le terminal, la commande remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> lancera remixd et partagera le dossier donné avec remix-ide.
it: Dal terminale, il comando remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> inizializzerà remixd e condividerà la cartella data con la remix-ide.
zh_cn: 从终端，命令 remixd -s <absolute-path-to-the-shared-folder> --remix-ide <your-remix-ide-URL-instance> 将启动 remixd 并将与 remix-ide 共享给定文件夹。

source: For example, to use remixd with Remix IDE, use this command: remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org
es: Por ejemplo, para utilizar remixd con Remix IDE, utilice este comando: remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org
fr_fr: Par exemple, pour utiliser remixd avec Remix IDE, utilisez la commande suivante : remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org
it: Ad esempio, per utilizzare remixd con la IDE Remix, utilizza il comando: remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org
zh_cn: 例如，要将 remixd 与 Remix IDE 一起使用，请使用以下命令：remixd -s <absolute-path-to-the-shared-folder> --remix-ide https://remix.ethereum.org

source: Make sure that if you use https://remix.ethereum.org (secure http) in the remixd command (like in the example above), that you are also pointing your browser to https://remix.ethereum.org and not to http://remix.ethereum.org (plain old insecure http). Or if you want to use http in the browser use http in the remixd command.
es: Asegúrese de que si utiliza https://remix.ethereum.org (http seguro) en el comando remixd (como en el ejemplo anterior), que también está apuntando su navegador a https://remix.ethereum.org y no a http://remix.ethereum.org (http inseguro a secas). O si desea utilizar http en el navegador utilice http en el comando remixd.
fr_fr: Assurez-vous que si vous utilisez https://remix.ethereum.org (http sécurisé) dans la commande remixd (comme dans l'exemple ci-dessus), vous faites également pointer votre navigateur vers https://remix.ethereum.org et non vers http://remix.ethereum.org (http non sécurisé). Ou si vous voulez utiliser http dans le navigateur, utilisez http dans la commande remixd.
it: Se utilizzi https://remix.ethereum.org (http sicuro) nel comando remixd (come nell'esempio sopra) assicurati di puntare anche il tuo browser su https://remix.ethereum.org e non su http://remix.ethereum.org (vecchio e http non sicuro). Oppure se vuoi utilizzare http nel browser utilizza http anche nel comando remixd.
zh_cn: 确保如果您在 remixd 命令中使用 https://remix.ethereum.org (安全 http) (如上面的示例)，您也将浏览器指向 https://remix.ethereum.org 而不是 到 http://remix.ethereum.org(普通旧的不安全的 http)。 或者，如果您想在浏览器中使用 http，请在 remixd 命令中使用 http。

source: The folder is shared using a websocket connection between Remix IDE and remixd.
es: La carpeta se comparte mediante una conexión websocket entre Remix IDE y remixd.
fr_fr: Le dossier est partagé en utilisant une connexion websocket entre Remix IDE et remixd.
it: La cartella condivisa utilizzando una connessione websocket tra Remix IDE e remixd.
zh_cn: 该文件夹使用 Remix IDE 和 remixd 之间的 websocket 连接共享。

source: Be sure the user executing remixd has read/write permission on the folder.
es: Asegúrese de que el usuario que ejecuta remixd tiene permiso de lectura/escritura en la carpeta.
fr_fr: Assurez-vous que l'utilisateur qui exécute remixd a les droits de lecture/écriture sur le dossier.
it: Assicurati che l'utente che esegue il comando remixd abbia permessi di scrittura/lettura sulla cartella.
zh_cn: 确保执行 remixd 的用户对该文件夹具有读/写权限。

source: There is an option to run remixd in read-only mode, use --read-only flag.
es: Existe una opción para ejecutar remixd en modo de sólo lectura, utilice la bandera --read-only.
fr_fr: Il existe une option pour exécuter remixd en mode lecture seule, utilisez le drapeau --read-only.
it: C'è un'opzione per eseguire remixd in modalità solo lettura, utilizza il flag --read-only.
zh_cn: 有一个选项可以在只读模式下运行 remixd，使用 --read-only 标志。

source: Warning!
es: ¡Atención!
fr_fr: Attention !
it: Attenzione!
zh_cn: 警告！

source: remixd provides full read and write access to the given folder for any application that can access the TCP port 65520 on your local host.
es: remixd proporciona acceso completo de lectura y escritura a la carpeta dada para cualquier aplicación que pueda acceder al puerto TCP 65520 en su host local.
fr_fr: remixd fournit un accès complet en lecture et en écriture au dossier donné pour toute application qui peut accéder au port TCP 65520 sur votre hôte local.
it: remixd fornisce un accesso completo di lettura e scrittura a una data cartella per qualsiasi applicazione che ha accesso alla porta TCP 65520 del tuo host locale.
zh_cn: remixd 为可以访问本地主机上的 TCP 端口 65520 的任何应用程序提供对给定文件夹的完全读写访问权限。

source: After the command is running, activate the remixd plugin.
es: Una vez ejecutado el comando, active el plugin remixd.
fr_fr: Une fois la commande lancée, activez le plugin remixd.
it: Dopo l'esecuzione del comando, attiva il plugin remixd.
zh_cn: 命令运行后，激活 remixd 插件。
