Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: A: Old versions of solidity compiler had this problem with chrome. Please change the compiler version in Solidity Plugin to the newer one or use another browser.
es: R: Las versiones antiguas del compilador Solidity tenían este problema con Chrome. Por favor, cambie la versión del compilador en Solidity Plugin por la más reciente o utilice otro navegador.
fr_fr: R : Les anciennes versions du compilateur Solidity avaient ce problème avec Chrome. Veuillez changer la version du compilateur dans Solidity Plugin pour la plus récente ou utiliser un autre navigateur.
it: R: Una vecchia versione del compilatore solidity aveva questo problema con Chrome. Per favore cambia la versione del compilatore in Plugin Solidity a una nuova oppure utilizza un browser differente.
zh_cn: 答：旧版本的solidity 编译器在chrome 中存在这个问题。 请将 Solidity Plugin 中的编译器版本更改为较新的版本或使用其他浏览器。

source: Q: I’m getting an issue with Maximum call stack exceed and various other errors, can't compile.
es: P: Estoy recibiendo un problema con la pila de llamada máxima excede y varios otros errores, no se puede compilar.
fr_fr: Q : J'ai un problème avec Maximum call stack exceed et d'autres erreurs, je ne peux pas compiler.
it: D: Ho un problema con Stack di chiamate massimo superato e vari altri errori, non posso compilare.
zh_cn: 问：我遇到了最大调用堆栈超出和其他各种错误的问题，无法编译。

source: A: Try a different browser or a newer solidity compiler version.
es: R: Pruebe con otro navegador o con una versión más reciente del compilador de solidity.
fr_fr: R : Essayez un autre navigateur ou une version plus récente du compilateur Solidity.
it: R: Prova un browser differente o una versione nuova di compilatore solidity.
zh_cn: 答：尝试不同的浏览器或更新的solidity 编译器版本。

source: Q: How to verify a contract that imports other contracts?
es: P: ¿Cómo verificar un contrato que importa otros contratos?
fr_fr: Q : Comment vérifier un contrat qui importe d'autres contrats ?
it: D: Come posso verificare un contratto che importa altri contratti?
zh_cn: 问：如何验证导入其他合约的合约？

source: A: The verification tool does not recursively go through the import statments in a contract. So can only verify a 'flattened' contract.
es: R: La herramienta de verificación no recorre recursivamente las declaraciones de importación de un contrato. Por tanto, sólo puede verificar un contrato "aplanado".
fr_fr: R : L'outil de vérification ne parcourt pas de manière récursive les déclarations d'importation d'un contrat. Il ne peut donc vérifier qu'un contrat "aplati".
it: R: Lo strumento di verifica non passa le dichiarazioni d'importazione ricorsivamente in un contratto. Perciò puoi solo verificare contratti "appiattiti".
zh_cn: 答：验证工具不会递归地遍历合约中的导入语句。 所以只能验证一个“扁平化”的合约。

source: There is a plugin called Flattener which will stuff all the original code and the imported code into a single file.
es: Existe un plugin llamado Flattener que embutirá todo el código original y el código importado en un único archivo.
fr_fr: Il existe un plugin appelé Flattener qui regroupe tout le code original et le code importé dans un seul fichier.
it: C'è un plugin chiamato Flattener che inserisce tutto il codice originale e il codice importato in un unico file.
zh_cn: 有一个名为 Flattener 的插件，它将所有原始代码和导入的代码填充到一个文件中。

source: Deploy & Run
es: Despliegue y ejecución
fr_fr: Déployer & Exécuter
it: Distribuisci & Esegui
zh_cn: 部署和运行

source: Q: I am using an Infura endpoint in my app, but when I try to deploy against that endpoint in remix IDE selecting "web3 provider" and putting my endpoint in, it's telling me that it can't connect
es: P: Estoy usando un endpoint Infura en mi app, pero cuando intento desplegar contra ese endpoint en remix IDE seleccionando "proveedor web3" y poniendo mi endpoint, me dice que no puede conectar
fr_fr: Q : J'utilise un point de terminaison Infura dans mon application, mais lorsque j'essaie de déployer contre ce point de terminaison dans Remix IDE en sélectionnant "web3 provider" et en mettant mon point de terminaison, il me dit qu'il ne peut pas se connecter.
it: D: Sto utilizzando un endpoint Infura nella mia applicazione ma quando cerco di distribuire utilizzando l'endpoint nella IDE Remix selezionando "web3 provider" e inserendoci il mio endpoint mi dice che non può connettersi
zh_cn: 问：我在我的应用程序中使用 Infura 端点，但是当我尝试在 remix IDE 中选择“web3 提供程序”并放入我的端点时针对该端点进行部署时，它告诉我它无法连接

source: A: If the endpoint you are using is http, it won't work.
es: R: Si el punto final que está utilizando es http, no funcionará.
fr_fr: R : Si le point de terminaison que vous utilisez est http, cela ne fonctionnera pas.
it: R: Se l'endpoint che stai utilizzando è http, non funzionerà.
zh_cn: 答：如果您使用的端点是http，它将无法正常工作。

source: Q: Where is deploy button?
es: P: ¿Dónde está el botón de despliegue?
fr_fr: Q : Où se trouve le bouton de déploiement ?
it: D: Dove si trova il pulsante di distribuzione?
zh_cn: 问：部署按钮在哪里？

source: A: Its in the Deploy & Run module. If you haven't activated that module, you should do that by clicking Deploy & Run module in the Plugin Manager. You could also activate everything you need to work with solidity on the landing page ( click the remix logo at the top left for the screen) and click the "Solidity" button in the environment section.
es: R: Está en el módulo Deploy & Run. Si no ha activado ese módulo, debería hacerlo haciendo clic en el módulo Deploy & Run en el Gestor de Plugins. También podría activar todo lo necesario para trabajar con solidez en la página de inicio ( haga clic en el logotipo de remix en la parte superior izquierda para la pantalla) y haga clic en el botón "Solidez" en la sección de entorno.
fr_fr: R : C'est dans le module Deploy & Run. Si vous n'avez pas activé ce module, vous devez le faire en cliquant sur le module Deploy & Run dans le Plugin Manager. Vous pouvez également activer tout ce dont vous avez besoin pour travailler avec Solidity sur la page d'accueil (cliquez sur le logo remix en haut à gauche de l'écran) et cliquez sur le bouton "Solidity" dans la section environnement.
it: R: Si trova nel modulo Distribuisci & Esegui. Se non hai attivato quel modulo, puoi farlo cliccando il modulo Distribuisci & Esegui dal Gestore di Plugin. Puoi anche attivare tutto ciò che ti serve per lavorare con Solidity dalla pagina di arrivo (clicca sul logo di Remix nell'angolo in alto a sinistra dello schermo) e clicca sul pulsante "Solidity" nella sezione ambiente.
zh_cn: 答: 它在 Deploy & Run 模块中。 如果您尚未激活该模块，则应通过单击插件管理器中的部署和运行模块来执行此操作。 您还可以在登录页面上激活使用 Solidity 所需的所有内容(单击屏幕左上角的 remix 徽标)，然后单击环境部分中的“Solidity”按钮。

source: Q: How to pass a tuple to a public function in Remix?
es: P: ¿Cómo pasar una tupla a una función pública en Remix?
fr_fr: Q : Comment passer un tuple à une fonction publique dans Remix ?
it: D: Come passare una tupla a una funzione pubblica in Remix?
zh_cn: 问：如何将元组传递给 Remix 中的公共函数？

source: A: Pass it as an array [].
es: R: Páselo como una matriz [].
fr_fr: R : Transmettez-le sous la forme d'un tableau [].
it: R: Passala come un array [].
zh_cn: 答：将其作为数组 [] 传递。

source: Q: How to input a struct as input to a parameter of a function in the Deploy & Run module?
es: P: ¿Cómo introducir una estructura como entrada a un parámetro de una función en el módulo Deploy & Run?
fr_fr: Q : Comment saisir une structure en tant que paramètre d'une fonction dans le module Deploy & Run ?
it: D: Come inserire una struttura come un input in un parametro di una funzione nel modulo Distribuisci & Esegui?
zh_cn: 问：如何在Deploy & Run模块中输入一个struct作为函数参数的输入？

source: A: For inputting a struct, just like a tuple, pass it in as an array []. Also you need to put in the line:
es: R: Para introducir una estructura, al igual que una tupla, pásela como una matriz []. También tiene que poner la línea
fr_fr: R : Pour saisir une structure, tout comme un tuple, passez-la sous la forme d'un tableau []. Vous devez également ajouter la ligne :
it: R: Per inserire una struttura, proprio come una tupla, passala come un array []. Inoltre dovrai inserire nella riga:
zh_cn: 答：输入一个结构体，就像一个元组一样，将它作为一个数组[] 传入。 您还需要输入以下内容：

source: pragma experimental ABIEncoderV2; at the top of the solidity file.
es: pragma experimental ABIEncoderV2; en la parte superior del archivo solidity.
fr_fr: pragma experimental ABIEncoderV2 ; au début du fichier solidity.
it: pragma experimental ABIEncoderV2; all'inizio del file solidity.
zh_cn: pragma 实验性 ABIEncoderV2； 在solidity文件的顶部。

source: For example, here's a solidity file with a struct is an input parameter.
es: Por ejemplo, aquí hay un archivo solidity con un struct es un parámetro de entrada.
fr_fr: Par exemple, voici un fichier Solidity dont le paramètre d'entrée est une structure.
it: Per esempio, questo è un file solidity con una struttura come parametro d'ingresso.
zh_cn: 例如，这里有一个带有 struct 的solidity 文件作为输入参数。

source: The input of initPeepToPeeps takes a struct. If you input [1,2] the transaction will go through.
es: La entrada de initPeepToPeeps toma un struct. Si introduce [1,2] la operación se realizará.
fr_fr: L'entrée de initPeepToPeeps prend une structure. Si vous entrez [1,2], la transaction sera effectuée.
it: L'input di initPeepToPeeps prende una struttura. Se inserisci [1,2] la transazione passerà.
zh_cn: InitPeepToPeeps 的输入采用结构。 如果您输入 [1,2]，则交易将通过。

source: Q: Where do plugin developers go with their questions?
es: P: ¿A dónde van los desarrolladores de plugins con sus preguntas?
fr_fr: Q : Où les développeurs de plugins posent-ils leurs questions ?
it: D: Dove possono fare domande gli sviluppatori di plugin?
zh_cn: 问：插件开发人员会去哪里解决他们的问题？

source: A: The Gitter Remix plugin developers room https://gitter.im/ethereum/remix-dev-plugin
es: R: La sala de desarrolladores del plugin Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
fr_fr: R : La salle des développeurs du plugin Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
it: R: La stanza per sviluppatori di plugin in Gitter Remix https://gitter.im/ethereum/remix-dev-plugin
zh_cn: 答: Gitter Remix 插件开发者室 https://gitter.im/ethereum/remix-dev-plugin

source: File Explorers
es: Exploradores de archivos
fr_fr: Explorateur de fichiers
it: Esploratori di File
zh_cn: 文件资源管理器

source: To get to the File Explorers module - click the file explorers icon.
es: Para acceder al módulo Exploradores de archivos - haga clic en el icono de exploradores de archivos.
fr_fr: Pour accéder au module Explorateurs de fichiers - cliquez sur l'icône explorateurs de fichiers.
it: Per ottenere il modulo Esploratori di File - clicca l'icona di esploratori di file.
zh_cn: 要进入文件资源管理器模块 - 单击文件资源管理器图标。

source: The basic files explorer lists all the files stored in your browser's browser storage. You can see them in the browser folder.
es: El explorador básico de archivos enumera todos los archivos almacenados en el almacén del navegador. Puede verlos en la carpeta del navegador.
fr_fr: L'explorateur de fichiers de base répertorie tous les fichiers stockés dans le stockage de votre navigateur. Vous pouvez les voir dans le dossier du navigateur.
it: L'esploratore di file di base elenca tutti i file memorizzati nella memoria del browser del tuo browser. Puoi vederli nella cartella del browser.
zh_cn: 基本文件资源管理器列出了存储在浏览器浏览器存储中的所有文件。 您可以在浏览器文件夹中看到它们。

source: Important Note: Clearing the browser storage will permanently delete all the solidity files stored there. This is an inherent limitation of a browser-based IDE. However, if you want to store files outside of the browser and on your computer's filesystem, use Remixd or use the desktop version of Remix-IDE. RemixD enables you to have access to a selected folder on your hard drive. Remix Desktop is a version of Remix-IDE in an Electron app.
es: Nota importante: Borrar el almacenamiento del navegador eliminará permanentemente todos los archivos de solidity almacenados allí. Esta es una limitación inherente a un IDE basado en navegador. Sin embargo, si desea almacenar archivos fuera del navegador y en el sistema de archivos de su ordenador, utilice Remixd o utilice la versión de escritorio de Remix-IDE. RemixD le permite acceder a una carpeta seleccionada de su disco duro. Remix Desktop es una versión de Remix-IDE en una aplicación Electron.
fr_fr: Remarque importante: le nettoyage du stockage du navigateur supprimera définitivement tous les fichiers de solidité qui y sont stockés. Ceci est une limitation inhérente à un IDE basé sur le navigateur. Cependant, si vous voulez stocker des fichiers en dehors du navigateur et sur le système de fichiers de votre ordinateur, utilisez Remixd ou utilisez la version bureau de Remix-IDE. RemixD vous permet d'avoir accès à un dossier sélectionné sur votre disque dur. Remix Desktop est une version de Remix-IDE dans une application Electron.
it: Nota Importante: La pulizia della memoria del browser eliminerà in maniera permanente tutti i file solidity memorizzati. C'è una limitazione inerente a un IDE basata sul browser. Ad ogni modo, se vuoi memorizzare i file fuori dal browser e in un sistema di file di un computer, utilizza Remixd o usa la versione desktop di Remix-IDE. RemixD ti permette di avere accesso a una cartella selezionata nel tuo disco fisso. Remix Desktop è una versione di Remix-IDE in una applicazione Electron.
zh_cn: 重要提示：清除浏览器存储将永久删除存储在那里的所有 Solidity 文件。 这是基于浏览器的 IDE 的固有限制。 但是，如果您想在浏览器之外和计算机的文件系统上存储文件，请使用 Remixd 或使用 Remix-IDE 的桌面版本。 RemixD 使您可以访问硬盘驱动器上的选定文件夹。 Remix Desktop 是 Electron 应用程序中的 Remix-IDE 版本。

source: You can rename, remove or add new files to the file explorer.
es: Puede renombrar, eliminar o añadir nuevos archivos al explorador de archivos.
fr_fr: Vous pouvez renommer, supprimer ou ajouter de nouveaux fichiers dans l'explorateur de fichiers.
it: Puoi rinominare, rimuovere o aggiungere nuovi file all'esploratore di file.
zh_cn: 您可以在文件资源管理器中重命名、删除或添加新文件。

source: We will start by reviewing the icons in the image above.
es: Empezaremos revisando los iconos de la imagen superior.
fr_fr: Nous commencerons par examiner les icônes de l'image ci-dessus.
it: Inizieremo rivedendo le icone nell'immagine sopra.
zh_cn: 我们将从查看上图中的图标开始。

source: The book icon - A. is the link to the module's documentation.
es: El icono del libro - A. es el enlace a la documentación del módulo.
fr_fr: L'icône de livre - A. est le lien vers la documentation du module.
it: L'icona libro - A. è il link al modulo di documentazione.
zh_cn: 书本图标 - A. 是模块文档的链接。

source: The icons to the right of the browser file explorer in the image above only appear for browser storage.
es: Los iconos a la derecha del explorador de archivos del navegador en la imagen superior sólo aparecen para el almacenamiento del navegador.
fr_fr: Les icônes situées à droite de l'explorateur de fichiers du navigateur dans l'image ci-dessus n'apparaissent que pour le stockage dans le navigateur.
it: Le icone sulla destra dell'esploratore di file del browser nell'immagine sopra appaiono solo per la memoria del browser.
zh_cn: 上图中浏览器文件浏览器右侧的图标仅用于浏览器存储。

source: Create new File
es: Crear nuevo archivo
fr_fr: Créer un nouveau fichier
it: Crea un nuovo File
zh_cn: 创建新文件

source: The icon marked B. above. Creates a new file.
es: El icono marcado B. arriba. Crea un nuevo archivo.
fr_fr: L'icône marquée B. ci-dessus. Crée un nouveau fichier.
it: L'icona segnalata con B. sopra, crea un nuovo file.
zh_cn: 上面标有 B. 的图标。 创建一个新文件。

source: Publish to Gist
es: Publicar en Gist
fr_fr: Publier sur le Gist
it: Pubblica su Gist
zh_cn: 发布到 Gist

source: The icon marked C. above. Publishes all files from the browser folder to a gist. Only file in the root of browser will be published. Files in subfolders will not be publish to the Gist. Gist API has changed in 2018 and requires users to be authenticated to be able to publish a gist.
es: El icono marcado C. arriba. Publica todos los archivos de la carpeta del navegador en un gist. Sólo se publicarán los archivos de la raíz del navegador. Los archivos de las subcarpetas no se publicarán en el Gist. La API de Gist ha cambiado en 2018 y requiere que los usuarios estén autentificados para poder publicar un gist.
fr_fr: L'icône marquée C. ci-dessus. Publie tous les fichiers du dossier du navigateur dans une gist. Seuls les fichiers situés à la racine du navigateur seront publiés. Les fichiers des sous-dossiers ne seront pas publiés dans la Gist. L'API Gist a changé en 2018 et exige que les utilisateurs soient authentifiés pour pouvoir publier une gist.
it: L'icona segnata con C. sopra. Pubblica tutti i file dalla cartella del browser a un gist. Solo i file nella cartella root del browser verranno pubblicati. I file nelle cartelle sottostanti non verranno pubblicati nel Gist. Gist API è cambiato dal 2018 e richiede all'utente di autenticarsi per permettere di pubblicare un gist.
zh_cn: 上面标有 C. 的图标。 将浏览器文件夹中的所有文件发布到 gist。 只会发布浏览器根目录中的文件。 子文件夹中的文件不会发布到 Gist。 Gist API 在 2018 年发生了变化，要求用户经过身份验证才能发布 gist。

source: Click this link to Github tokens setup and select Generate new token. Then check the Create gists checkbox and generate a new token.
es: Haga clic en este enlace a la configuración de tokens de Github y seleccione Generar nuevo token. A continuación, marque la casilla Crear gists y genere un nuevo token.
fr_fr: Cliquez sur ce lien vers la configuration des jetons Github et sélectionnez Generate new token (Générer un nouveau jeton). Cochez ensuite la case Créer des gists et générez un nouveau jeton.
it: Clicca questo link al setup dei token Github e seleziona Genera un nuovo token. Poi clicca la casella di controllo Crea gists e genera un nuovo token.
zh_cn: 单击此链接到 Github 令牌设置并选择生成新代币。 然后选中 Create gists 复选框并生成一个新代币。

source: Take the token and paste it in Remix's Settings module in the Github Access Token section. And then click Save. Now you should be able to use the feature.
es: Tome el token y péguelo en el módulo Configuración de Remix en la sección Token de acceso a Github. Y luego haga clic en Guardar. Ahora debería poder utilizar la función.
fr_fr: Prenez le jeton et collez-le dans le module Settings de Remix dans la section Github Access Token. Cliquez ensuite sur Enregistrer. Vous devriez maintenant être en mesure d'utiliser la fonctionnalité.
it: Prendi il token e copialo nel modulo Impostazioni di Remix nella sezione Token di Accesso Github. E poi clicca Salva. Adesso dovresti essere in grado di utilizzare questa impostazione.
zh_cn: 获取代币并将其粘贴到 Remix 的设置模块中的 Github 访问代币部分。 然后单击保存。 现在您应该可以使用该功能了。

source: Create a folder
es: Crear una carpeta
fr_fr: Créer un dossier
it: Crea una cartella
zh_cn: 创建一个文件夹

source: The icon marked D. above. Creates a new folder in browser file explorer.
es: El icono marcado D. arriba. Crea una nueva carpeta en el explorador de archivos del navegador.
fr_fr: L'icône marquée D. ci-dessus. Crée un nouveau dossier dans l'explorateur de fichiers du navigateur.
it: L'icona segnata con D. sopra. Crea una nuova cartella in un esploratore di file del browser.
zh_cn: 上面标有 D. 的图标。 在浏览器文件资源管理器中创建一个新文件夹。

source: Context Menu (Right Click)
es: Menú contextual (botón derecho del ratón)
fr_fr: Menu contextuel (Clic droit)
it: Menu di Contesto (Clic Destro)
zh_cn: 上下文菜单(右键单击)

source: Right click on a file or a folder and the context menu will appear.
es: Haga clic con el botón derecho del ratón sobre un archivo o una carpeta y aparecerá el menú contextual.
fr_fr: Cliquez avec le bouton droit de la souris sur un fichier ou un dossier et le menu contextuel apparaît.
it: Clic destro su un file o una cartella e apparirà il menu di contesto.
zh_cn: 右键单击文件或文件夹，将出现上下文菜单。

source: You can rename or delete a selected file or a folder. You can also create a folder.
es: Puede renombrar o eliminar un archivo seleccionado o una carpeta. También puede crear una carpeta.
fr_fr: Vous pouvez renommer ou supprimer un fichier ou un dossier sélectionné. Vous pouvez également créer un dossier.
it: Puoi rinominare o eliminare un file o una cartella selezionati. Puoi anche creare una cartella.
zh_cn: 您可以重命名或删除选定的文件或文件夹。 您也可以创建一个文件夹。

source: To create a file with the context menu, right click on a folder to get the Create File option. A file will be created inside that folder.
es: Para crear un archivo con el menú contextual, haga clic con el botón derecho en una carpeta para obtener la opción Crear archivo. Se creará un archivo dentro de esa carpeta.
fr_fr: Pour créer un fichier à l'aide du menu contextuel, cliquez avec le bouton droit de la souris sur un dossier pour obtenir l'option Créer un fichier. Un fichier sera créé dans ce dossier.
it: Per creare un file con il menu di contesto, fai clic destro su una cartella e seleziona l'opzione Crea File. Un file verrà creato dentro a quella cartella.
zh_cn: 要使用上下文菜单创建文件，请右键单击文件夹以获取“创建文件”选项。 将在该文件夹中创建一个文件。

source: The functionality of the context menu also works with RemixD (which gives you have access to a folder on your hard drive).
es: La funcionalidad del menú contextual también funciona con RemixD (que le permite acceder a una carpeta de su disco duro).
fr_fr: La fonctionnalité du menu contextuel fonctionne également avec RemixD (qui vous donne accès à un dossier sur votre disque dur).
it: La funzionalità del menu di contesto funziona anche con RemixD (questo ti permette di avere accesso a una cartella nel tuo disco fisso).
zh_cn: 上下文菜单的功能也适用于 RemixD(它使您可以访问硬盘驱动器上的文件夹)。

source: Note: When working with RemixD, you need to open and close the localhost folder to refresh the view.
es: Nota: Cuando trabaje con RemixD, deberá abrir y cerrar la carpeta localhost para actualizar la vista.
fr_fr: Remarque : lorsque vous travaillez avec RemixD, vous devez ouvrir et fermer le dossier localhost pour rafraîchir la vue.
it: Nota: Quando lavori con RemixD, devi aprire e chiudere la cartella localhost per ricaricare la visualizzazione.
zh_cn: 注意：使用 RemixD 时，您需要打开和关闭 localhost 文件夹以刷新视图。

source: Importing Source Files in Solidity
es: Importación de archivos fuente en Solidity
fr_fr: Importation des fichiers sources dans Solidity
it: Importa un File Origine in Solidity
zh_cn: 在 Solidity 中导入源文件

source: There are multiple techniques for importing files into Remix.
es: Existen múltiples técnicas para importar archivos en Remix.
fr_fr: Il existe plusieurs techniques pour importer des fichiers dans Remix.
it: Ci sono varie tecniche per importare file in Remix.
zh_cn: 将文件导入 Remix 有多种技术。

source: For a tutorial about importing files click here. You can also find this tutorial in the Remix Workshops plugin.
es: Para ver un tutorial sobre la importación de archivos, haga clic aquí. También puede encontrar este tutorial en el plugin Remix Workshops.
fr_fr: Pour un tutoriel sur l'importation de fichiers, cliquez ici. Vous pouvez également trouver ce tutoriel dans le plugin Remix Workshops.
it: Per un tutorial su come importare file clicca qui. Puoi anche trovare questo tutorial nel plugin di Remix Workshops.
zh_cn: 有关导入文件的教程，请单击此处。 您还可以在 Remix Workshops 插件中找到本教程。

source: For a detailed explanation of the import keyword see the Solidity documentation
es: Para una explicación detallada de la palabra clave import consulte la documentación de Solidity
fr_fr: Pour une explication détaillée du mot-clé import, voir la documentation Solidity.
it: Per una spiegazione dettagliata della parola chiave d'importazione vedi la documentazione di Solidity
zh_cn: 有关 import 关键字的详细说明，请参阅 Solidity 文档

source: Here are a some of the main methods of importing a file:
es: Estos son algunos de los principales métodos para importar un archivo:
fr_fr: Voici quelques-unes des principales méthodes d'importation d'un fichier :
it: Qui ci sono alcune dei metodi principali per importare un file:
zh_cn: 以下是导入文件的一些主要方法：

source: Importing a file from the browser's local storage
es: Importar un archivo desde el almacenamiento local del navegador
fr_fr: Importation d'un fichier à partir de la mémoire locale du navigateur
it: Importare un file dalla memoria locale del browser
zh_cn: 从浏览器的本地存储导入文件
