Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Remix Assert Library
es: Librería de activos Remix
fr_fr: Bibliothèque Remix Assert
it: Libreria Assert di Remix
zh_cn: Remix 断言库

source: Assert.ok(value[, message])
es: Assert.ok(valor[, mensaje])

source: Assert.equal(actual, expected[, message])
es: Assert.equal(actual, esperado[, mensaje])

source: Assert.notEqual(actual, expected[, message])
es: Assert.notEqual(actual, esperado[, mensaje])

source: Assert.greaterThan(value1, value2[, message])
es: Assert.mayorque(valor1, valor2[, mensaje])

source: Assert.lesserThan(value1, value2[, message])
es: Assert.menosque(valor1, valor2[, mensaje])

source: value: <bool>
es: valor: <bool>
fr_fr: valeur : <bool>

source: message: <string>
es: mensaje: <string>

source: Tests if value is truthy. message is returned in case of failure.
es: Prueba si el valor es verdadero. El mensaje se devuelve en caso de error.
fr_fr: Teste si la valeur est vraie. Le message est retourné en cas d'échec.
it: Verifica se il valore è vero. meggage viene restituito in caso di fallimento.
zh_cn: 测试`value`是否正确。 失败则返回对应的`message`。

source: Examples:
es: Ejemplos:
fr_fr: Exemples :
it: Esempi:
zh_cn: 示例：

source: expected: <uint | int | bool | address | bytes32 | string>
es: esperado: <uint | int | bool | address | bytes32 | string>
fr_fr: attendu : <uint | int | bool | address | bytes32 | string>

source: Tests if actual & expected values are same. message is returned in case of failure.
es: Pruebas si los valores reales y esperados son iguales. El mensaje se devuelve en caso de error.
fr_fr: Teste si les valeurs actuelles et attendues sont identiques. Le message est retourné en cas d'échec.
it: Verifica se i valori actual ed expected sono uguali. meggage viene restituito in caso di fallimento.
zh_cn: 测试实际值和预期值是否相同。 失败则返回对应的消息。

source: Tests if actual & expected values are not same. message is returned in case of failure.
es: Pruebas si los valores reales y esperados no son iguales. El mensaje se devuelve en caso de error.
fr_fr: Teste si les valeurs actuelles et attendues sont différentes. Le message est retourné en cas d'échec.
it: Verifica se i valori actual ed expected non sono uguali. meggage viene restituito in caso di fallimento.
zh_cn: 测试实际值和预期值是否不同。 如果失败则返回对应的消息。

source: value1: <uint | int>
es: valor1: <uint | int>
fr_fr: valeur 1 : <uint | int>
zh_cn: value2: <uint | int>

source: value2: <uint | int>
es: valor2: <uint | int>
fr_fr: valeur 2 : <uint | int>

source: Tests if value1 is greater than value2. message is returned in case of failure.
es: Prueba si el valor es verdadero. El mensaje se devuelve en caso de error.
fr_fr: Teste si la valeur 1 est supérieure à la valeur 2. Le message est retourné en cas d'échec.
it: Testa se value 1 è maggiore di value2. meggage viene restituito in caso di fallimento.
zh_cn: 测试 value1 是否大于 value2。 失败时返回对应的消息。

source: Tests if value1 is lesser than value2. message is returned in case of failure.
es: Prueba si el valor es verdadero. El mensaje se devuelve en caso de error.
fr_fr: Teste si la valeur 1 est inférieure à la valeur 2. Le message est retourné en cas d'échec.
it: Testa se value 1 è minore di value2. meggage viene restituito in caso di fallimento.
zh_cn: 测试 value1 是否小于 value2。 失败时返回消息。

source: Code Contribution Guide
es: Guía de Contribución de Código
fr_fr: Guide de contribution au code source
it: Guida al contributo del codice
zh_cn: 代码贡献指南

source: Remix is an open source tool and we encourage everyone to help us improve it. Please opening issues, give feedback or contribute by a pulling request to our codebase.
es: Remix es una herramienta de código abierto y estamos animando a todos a ayudarnos a mejorarlo. Puedes abrir un issue, dar un feedback o contribuir con un pull request en nuestro código fuente.
fr_fr: Remix est un outil open source et nous encourageons quiconque à nous aider à améliorer notre outil. Vous pouvez contribuer en rapportant des erreurs, en nous envoyant vos commentaires ou en contribuant à notre code base avec un pull request.
it: Remix è uno strumento open source ed incoraggiamo tutti ad aiutarci a migliorarlo. Per favore, aprite problemi, fate feedback o contribuite con una richiesta di inserimento al nostro codice base.
zh_cn: Remix 是一个开源工具，我们鼓励大家帮助我们改进它。 请开启issue、提供反馈或通过pull request向我们的代码库做出贡献。

source: The Remix application is built with JavaScript and it doesn't use any frameworks. We rely on a selected set of npm modules, like yo-yo, csjs-inject and among others. Check out the package.json files in the Remix submodules to learn more about the stack.
es: La aplicación Remix está construida en JavaScript y no usa framework alguno. Confiamos en una serie de módulos de npm como yo-yo y csjs-inject entre otros. Revisa los archivos package.json en los submódulos de Remix para saber más sobre su stack.
fr_fr: L'application Remix est construite avec JavaScript et n'utilise aucun framework. Nous comptons sur un ensemble de modules npm sélectionnés comme yo-yo, csjs-inject et d'autres. Consultez les fichiers package.json dans les sous-modules Remix pour en savoir plus sur la pile.
it: L'applicazione Remix è costruita con JavaScripto e non utilizza alcun framework. Ci affidiamo a un insieme selezionato di moduli npm, come yo-yo, csjs-inject ed altri. Consulta i file package.json nei sottomoduli in Remix per saperne di più dello stack.
zh_cn: Remix 应用程序是基于 JavaScript 构建的，它不使用任何框架。 我们依赖一组选定的 npm 模块，例如 yo-yo、csjs-inject 等。 查看 Remix 子模块中的 package.json 文件以了解有关技术栈的更多信息。

source: To learn more, please visit our GitHub page.
es: Para saber más, puedes visitar nuestra página de GitHub.
fr_fr: Pour en savoir plus, veuillez consulter notre page GitHub.
it: Per saperne di più, visita la pagina Github.
zh_cn: 要了解更多信息，请访问我们的 GitHub 页面。

source: Community Support
es: Soporte de la Comunidad
fr_fr: Support de la Communauté
it: Supporto della community
zh_cn: 社区支持

source: We know that blockchain ecosystem is very new and that lots of information is scattered around the web. That is why we created a community support channel where we and other users try to answer your questions if you get stuck using Remix. Please, join the community and ask for help.
es: Sabemos que el ecosistema blockchain es muy nuevo y hay mucha información dispersa en la web. Por esa razón, hemos creado un canal comunitario de soporte en donde tratamos de responder todas tus preguntas si te quedas varado usando Remix. Por favor, únete a nuestra comunidad y pide ayuda.
fr_fr: Nous savons que l'écosystème de la blockchain est très récent et que de nombreuses informations sont dispersées sur le Web. C'est pourquoi nous avons créé un canal de soutien de la communauté où nous, ainsi que d'autres utilisateurs essayons de répondre à vos questions si vous êtes coincé dans l'utilisation de Remix. Rejoignez la Communauté et demandez de l'aide.
it: Sappiamo che l'ecosistema blockchain è molto nuovo e che molte informazioni sono sparse nel web. Per questo motivo abbiamo creato un canale di supporto della community dove noi ed altri utenti tentano di rispondere alle vostre domande se rimanete bloccati in Remix. Unitevi alla community e chiedete aiuto.
zh_cn: 我们知道区块链生态系统是非常新的，并且大量信息分散在网络上。 这就是为什么我们创建了一个社区支持频道，如果您在使用 Remix 时遇到问题，我们和其他用户会尝试回答您的问题。 请加入社区并寻求帮助。

source: For anyone who is interested in developing a custom plugin for Remix or who wants to contribute to the codebase, we opened a contributors' channel especially for developers working on Remix tools.
es: Para cualquiera que esté interesado en desarrollar un plugin personalizado para Remix o quien quiera contribuir al código fuente, hemos abierto un canal de contribuidores, especialmente para desarrolladores que trabajen en herramientas para Remix.
fr_fr: Pour tous ceux qui sont intéressés par le développement d'un plugin personnalisé pour Remix ou qui veulent contribuer au code de base, nous avons ouvert un canal dédié aux contributeurs spécialement pour les développeurs qui travaillent sur les outils Remix.
it: Per tutti coloro che sono interessati a sviluppare un plugin personalizzato per Remix o che vogliono contribuire al codice di base, abbiamo aperto un canale di collaborazione appositamente per gli sviluppatori che lavorano sugli strumenti di Remix.
zh_cn: 对于有兴趣为 Remix 开发自定义插件或想要为代码库做出贡献的任何人，我们都开设了一个贡献者频道，特别是针对使用 Remix 工具的开发人员。

source: We would kindly ask you to respect the space and to use it for getting help with your work and the developers' channel for discussions related to working on Remix codebase. If you have ideas for collaborations or you want to promote your project, try to find some more appropriate channels to do so. Or you can contact the main contributors directly on Gitter or Twitter.
es: Le rogamos que respete el espacio y que lo utilice para obtener ayuda en su trabajo y en el canal de los desarrolladores para las discusiones relacionadas con el trabajo en base al código Remix. Si tienes ideas de colaboración o quieres promocionar tu proyecto, intenta encontrar algunos canales más apropiados para hacerlo. O puede ponerse en contacto con los principales colaboradores directamente en Gitter o Twitter.
fr_fr: Nous vous prions de respecter cet espace et de l'utiliser pour obtenir de l'aide avec votre travail et le canal des développeurs pour les discussions relatives au travail sur le code Remix. Si vous avez des idées de collaboration ou si vous voulez promouvoir votre projet, essayez de trouver des canaux plus appropriés pour le faire. Vous pouvez également contacter les principaux contributeurs directement sur Gitter ou Twitter.
it: Ti chiediamo gentilmente di rispettare questo spazio e di usarlo per ricevere aiuto nel tuo lavoro, mentre il canale degli sviluppatori è per le discussioni relative al lavoro sul codice di Remix. Se hai idee per collaborazioni o vuoi promuovere il tuo progetto, cerca di trovare canali più appropriati per farlo. Oppure puoi contattare direttamente i principali collaboratori su Gitter o Twitter.
zh_cn: 我们恳请您尊重这个空间，并使用它来获得工作帮助，并使用开发人员的频道来讨论与 Remix 代码库相关的讨论。 如果您有合作的想法或想推广您的项目，请尝试找到一些更合适的渠道来这样做。 或者您可以直接在 Gitter 或 Twitter 上联系主要贡献者。

source: Compiler (Solidity)
es: Compilador (Solidity)
fr_fr: Compilateur (Solidity)
it: Compilatore (Solidity)
zh_cn: 编译器(Solidity)

source: Clicking the Solidity icon in the icon panel brings you to the Solidty Compiler.
es: Haciendo click en el ícono de Solidity dentro del panel del ícono te lleva al Compilador de Solidity.
fr_fr: En cliquant sur l'icône Solidity dans le panneau d'icônes, vous accédez au Compilateur Solidty.
it: Cliccando l'icona Solidity nel pannelo delle icone si accese al compilatore Solidity.
zh_cn: 单击图标面板中的 Solidity 图标，您将进入 Solidity 编译器

source: Compiling is triggered when you click the compile button ( D. in image below). If you want the file to be compiled each time the file is saved or when another file is selected - check the auto compile checkbox ( E. in image below).
es: La compilación se activa cuando hace clic en el botón de compilación ( D. en la imagen de abajo). Si desea que el archivo sea compilado cada vez que el archivo es guardado o cuando otro archivo es seleccionado - marque la casilla de auto compilación ( E. en la imagen de abajo).
fr_fr: La compilation est déclenchée lorsque vous cliquez sur le bouton de compilation (D. dans l'image ci-dessous). Si vous souhaitez que le fichier soit compilé à chaque fois qu'il est sauvegardé ou lorsqu'un autre fichier est sélectionné : cochez la case de compilation automatique (E. dans l'image ci-dessous).
it: La compilazione viene attivata quando si fa clic sul pulsante Compila (D. nell'immagine sottostante). Se si desidera che il file venga compilato ogni volta che viene salvato o quando viene selezionato un altro file, selezionare la casella di controllo Compilazione automatica (E. nell'immagine seguente).
zh_cn: 单击编译按钮(下图中的 D.) 会触发编译。 如果您希望在每次保存文件或选择另一个文件时编译文件 - 选中自动编译复选框(下图中的 E.)。

source: Since the Solidity version 0.5.7, it is possible to compile Yul files. Please read the (solidity documentation about Yul) which contain some code examples. You can use the language dropdown ( B. in image below) to switch the language. This dropdown list is only available for versions greater than or equal to 0.5.7.
es: Desde la versión 0.5.7 de Solidity, es posible compilar archivos de Yul. Por favor, lea la (documentación de solidez sobre Yul) que contiene algunos ejemplos de código. Puede utilizar el menú desplegable de idioma ( B. en la imagen de abajo) para cambiar el idioma. Esta lista desplegable sólo está disponible para versiones mayores o iguales a 0.5.7.
fr_fr: Depuis la version 0.5.7 de Solidity, il est possible de compiler des fichiers Yul. Veuillez consulter la documentation sur Yul qui contient des exemples de code. Vous pouvez utiliser le menu déroulant de la langue (B. dans l'image ci-dessous) pour changer de langue. Cette liste déroulante n'est disponible que pour les versions supérieures ou égales à la 0.5.7.
it: Dalla versione 0.5.7 di Solidity è possibile compilare i file Yul. Si prega di leggere la (documentazione di Solidity su Yul) che contiene alcuni esempi di codice. È possibile utilizzare il menu a tendina della lingua (B. nell'immagine sottostante) per cambiare la lingua. Questo elenco a tendina è disponibile solo per le versioni superiori o uguali alla 0.5.7.
zh_cn: 从 Solidity 版本 0.5.7 开始，可以编译 Yul 文件。 请阅读包含一些代码示例的(有关 Yul 的可靠文档)。 您可以使用语言下拉菜单(下图中的 B.) 来切换语言。 此下拉列表仅适用于大于或等于 0.5.7 的版本。

source: The fork selection dropdown list ( C. in image below) allows to compile code against a specific ethereum hard fork. The compiler default corresponds to the default hard fork used by a specific version. Please go to "Compilation Details" ( G. in image below) in the settings of Metadata section to see the harfork name used for the current compilation.
es: La lista desplegable de selección de bifurcaciones ( C en la imagen de abajo) permite compilar código contra un tenedor duro de ethereum específico. El compilador por defecto corresponde al fork duro por defecto usado por una versión específica. Por favor, vaya a "Detalles de la compilación" ( G. en la imagen de abajo) en la configuración de la sección de metadatos para ver el nombre de harfork usado para la compilación actual.
fr_fr: La liste déroulante de sélection de fork (C. dans l'image ci-dessous) permet de compiler du code avec un fork majeur spécifique d'Ethereum. La valeur par défaut du compilateur correspond au fork par défaut utilisé par une version spécifique. Veuillez vous rendre sur "Détails de compilation" (G. dans l'image ci-dessous) dans les paramètres de la section Metadata pour voir le nom de fork majeur utilisé pour la compilation actuelle.
it: L'elenco a tendina per la selezione della biforcazione (C. nell'immagine sottostante) consente di compilare il codice per una specifica biforcazione dura di Ethereum. Il valore predefinito del compilatore corrisponde alla biforcazione dura predefinita utilizzata da una versione specifica. Per visualizzare il nome della biforcazione dura utilizzata per la compilazione corrente, consultare la sezione "Dettagli della Compilazione" (G. nell'immagine sottostante) nelle impostazioni dei Metadati.
zh_cn: 分叉选择下拉列表(下图中的 C.) 允许针对特定的以太坊硬分叉编译代码。 编译器默认对应于特定版本使用的默认硬分叉。 请到 Metadata 部分设置中的“编译详细信息”(下图中的 G.) 查看当前编译使用的硬分叉名称。

source: If the contract has a lot of dependencies it can take a while to compile - so you use autocompilation at your discretion.
es: Si el contrato tiene muchas dependencias puede tomar un tiempo para compilar - para que use la autocompilación a su discreción.
fr_fr: Si le contrat dispose de nombreuses dépendances, il peut prendre un certain temps à compiler. Utilisez la compilation automatique à votre discrétion.
it: Se il contratto ha molte dipendenze, può richiedere un po' di tempo per essere compilato, quindi si può usare l'autocompilazione a propria discrezione.
zh_cn: 如果合约有很多依赖项，编译可能需要一段时间——因此您可以自行决定使用自动编译。

source: After each compilation, a list is updated with all newly compiled contracts. A compiled contract can be selected with the Contract pulldown menu ( F. in the image). Multiple contracts are compiled when one contract imports other contracts. Selecting a contract will show information about that one.
es: Después de cada compilación, una lista se actualiza con todos los contratos recién compilados. Se puede seleccionar un contrato compilado con el menú desplegable Contrato ( F. en la imagen). Múltiples contratos son compilados cuando un contrato importa otros contratos. Al seleccionar un contrato se mostrará información sobre éste.
fr_fr: Après chaque compilation, une liste est mise à jour avec tous les contrats nouvellement compilés. Un contrat compilé peut être sélectionné dans le menu déroulant du contrat (F. dans l'image ci-dessous). Plusieurs contrats sont compilés lorsqu'un contrat importe d'autres contrats. La sélection d'un contrat montrera des informations sur celui-ci.
it: Dopo ogni compilazione, viene aggiornato un elenco con tutti i nuovi contratti compilati. Un contratto compilato può essere selezionato con il menu a tendina "Contratto" (F. nell'immagine). I contratti multipli vengono compilati quando un contratto importa altri contratti. Selezionando un contratto, vengono visualizzate le informazioni relative a esso.
zh_cn: 每次编译后，都会使用所有新编译的合约更新列表。 可以使用合约下拉菜单(图中的 F.) 选择已编译的合约。 当一个合约导入其他合约时，会编译多个合约。 选择合约将显示有关该合约的信息。

source: When the "Compilation Details" button is clicked ( G. in image), a modal opens displaying detailed information about the current selected contract.
es: Cuando se hace clic en el botón "Detalles de la compilación" (G. en la imagen), se abre una modal que muestra información detallada sobre el contrato seleccionado.
fr_fr: Lorsque vous cliquez sur le bouton "Détails de la compilation" (G. dans l'image ci-dessous), une fenêtre modale affiche des informations détaillées sur le contrat sélectionné.
it: Facendo clic sul pulsante "Dettagli della Compilazione" (G. nell'immagine), si apre una finestra modale che visualizza informazioni dettagliate sul contratto attualmente selezionato.
zh_cn: 单击“编译详细信息”按钮(图像中的 G.) 时，将打开一个模式，显示有关当前所选合约的详细信息。

source: For those writing your own custom solidity compiler, you can import that by clicking the + button (X. in the image) to open a modal where you can input the url of the compiler to be loaded.
es: Para aquellos que escriban su propio compilador de solidez personalizado, puede importarlo haciendo clic en el botón + (X. en la imagen) para abrir un modal donde se puede introducir la url del compilador a cargar.
fr_fr: Pour ceux qui écrivent leur propre compilateur Solidity, vous pouvez importer cela en cliquant sur le bouton + (X. dans l'image ci-dessous) pour ouvrir une fenêtre modale où vous pouvez renseigner l'url du compilateur à charger.
it: Per chi scrive il proprio compilatore solidity personalizzato, è possibile importarlo facendo clic sul pulsante + (X. nell'immagine) per aprire una finestra modale in cui inserire l'url del compilatore da caricare.
zh_cn: 对于那些编写自己的自定义solidity编译器的人，您可以通过单击+按钮(图像中的X.) 打开一个模式来导入它，您可以在其中输入要加载的编译器的url。

source: From the Solidity Compiler module you can also publish your contract to Swarm (only non abstract contracts can be published) & IPFS.
es: Desde el módulo Compilador de Solididad también puede publicar su contrato a Swarm (sólo los contratos no abstractos pueden ser publicados) & IPFS.
fr_fr: À partir du module Compilateur Solidity, vous pouvez également publier votre contrat sur Swarm (seuls les contrats non abstraits peuvent être publiés) et IPFS.
it: Dal modulo Compilatore di Solidity si può anche pubblicare il contratto su Swarm (si possono pubblicare solo contratti non astratti) e IPFS.
zh_cn: 从 Solidity 编译器模块，您还可以将合约发布到 Swarm(只能发布非抽象合约) 和 IPFS。

source: Published data notably contains the abi and the solidity source code.
es: Los datos publicados contienen notablemente el abi y el código fuente de solidity.
fr_fr: Les données publiées contiennent notamment l'ABI et le code source Solidity.
it: I dati pubblicati contengono in particolare l'abi e il codice sorgente di solidity.
zh_cn: 发布的数据尤其包含 abi 和solidity 源代码。

source: After a contract is published, you can find its metadata information using the bzz URL located in the details modal dialog SWARM LOCATION.
es: Después de publicar un contrato, usted puede encontrar su información de metadatos usando la URL bzz ubicada en el diálogo modal de detalles SWARM LOCATION.
fr_fr: Une fois qu'un contrat est publié, vous pouvez trouver ses informations de métadonnées en utilisant l'URL bzz située dans la fenêtre modale de dialogue de SWARM LOCATION.
it: Dopo la pubblicazione di un contratto, è possibile trovare le informazioni sui suoi metadati utilizzando l'URL bzz che si trova nella finestra di dialogo modale dei dettagli "SWARM LOCATION".
zh_cn: 合约发布后，您可以使用位于详细模式对话框 SWARM LOCATION 中的 bzz URL 找到其元数据信息。

source: Compilation Errors and Warning are displayed below the contract section. At each compilation, the static analysis tab builds a report. It is important to address reported issues even if the compiler doesn't complain. (see more)
es: Los errores de compilación y Advertencia se muestran debajo de la sección del contrato. En cada compilación, la pestaña de análisis estático crea un informe. Es importante abordar los problemas denunciados incluso si el compilador no se queja. (ver más)
fr_fr: Les erreurs et les avertissements de compilation sont affichés sous la section contrat. Pour chaque compilation, l'onglet analyse statique crée un rapport. Il est important de résoudre les problèmes signalés même si le compilateur ne se plaint pas. (voir plus)
it: Gli Errori di Compilazione e le Avvertenze sono visualizzati sotto la sezione del contratto. A ogni compilazione, la scheda analisi statica crea un rapporto. È importante risolvere i problemi segnalati anche se il compilatore "non si lamenta". (per saperne di più)
zh_cn: 编译错误和警告显示在合约部分下方。 在每次编译时，静态分析选项卡都会生成一份报告。 即使编译器没有报错，解决报告的问题也很重要。(了解更多)

source: Build Artifact
es: Construir artefacto
fr_fr: Construction de l'artefact
it: Costruisci Artefatto
zh_cn: 构建成果

source: When a compilation succeeds, Remix creates two JSON files for each compiled contract. One of these files captures the output from the Solidity compilation. This file will be named contractName_metadata.json.
es: Cuando una compilación tiene éxito, Remix crea dos archivos JSON para cada contrato compilado. Uno de estos archivos captura la salida de la compilación de Solididad. Este archivo se llamará contractName_metadata.json.
fr_fr: Lorsqu'une compilation réussit, Remix crée deux fichiers JSON pour chaque contrat compilé. L'un de ces fichiers capture la sortie de la compilation Solidity. Ce fichier sera nommé contractName_metadata.json.
it: Quando la compilazione ha successo, Remix crea due file JSON per ogni contratto compilato. Uno di questi file cattura il risultato della compilazione di Solidity. Questo file sarà chiamato contractName_metadata.json.
zh_cn: 当编译成功时，Remix 为每个编译的合约创建两个 JSON 文件。 其中一个文件捕获了 Solidity 编译的输出。 此文件将命名为 contractName_metadata.json。
