Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Guard conditions: Use 'require' and 'assert' appropriately
es: Proteja las condiciones: Utilice 'require' y 'assert' adecuadamente
fr_fr: Protégez les conditions : Utilisez les termes "exiger" et "affirmer" de manière appropriée.
it: Condizioni di guardia: Usare i termini "require" e "assert" in modo appropriato
zh_cn: 守卫条件：适当使用“require”和“assert”

source: Use assert(x) if you never ever want x to be false, not in any circumstance (apart from a bug in your code). Use require(x) if x can be false, due to e.g. invalid input or a failing external component.
es: Utilice assert(x) si nunca jamás desea que x sea falso, en ninguna circunstancia (aparte de un error en su código). Utilice require(x) si x puede ser falso, debido, por ejemplo, a una entrada no válida o a un componente externo que falle.
fr_fr: Utilisez assert(x) si vous ne voulez jamais que x soit faux, en aucune circonstance (à l'exception d'un bogue dans votre code). Utilisez require(x) si x peut être faux, par exemple à cause d'une entrée invalide ou d'un composant externe défaillant.
it: Usa assert(x) se non vuoi mai e poi mai che x sia falso, in nessuna circostanza (a parte un bug nel tuo codice). Usa require(x) se x può essere falso, ad esempio a causa di un input non valido o di un componente esterno che non funziona.
zh_cn: 如果您永远不希望 x 为假，请使用 assert(x)，而不是在任何情况下(除了代码中的错误)。 如果 x 可能为假，请使用 require(x)，例如 无效输入或失败的外部组件。

source: Result not used: The result of an operation not used
es: Resultado no utilizado: El resultado de una operación no utilizada
fr_fr: Résultat non utilisé : Le résultat d'une opération n'est pas utilisé
it: Risultato non utilizzato: Il risultato di un'operazione non utilizzato
zh_cn: Result not used：未使用操作的结果

source: A binary operation yields a value that is not used in the following. This is often caused by confusing assignment (=) and comparison (==).
es: Una operación binaria produce un valor que no se utiliza en la siguiente. Esto suele deberse a la confusión entre asignación (=) y comparación (==).
fr_fr: Une opération binaire produit une valeur qui n'est pas utilisée dans la suite. Cela est souvent dû à une confusion entre l'affectation (=) et la comparaison (==).
it: Un'operazione binaria produce un valore che non viene utilizzato di seguito. Ciò è spesso causato dalla confusione tra assegnazione (=) e confronto (==).
zh_cn: 二元运算产生的值在下文中未使用。 这通常是由混淆的assignment (=) 和 comparison (==) 引起的。

source: String Length: Bytes length != String length
es: Longitud de la cadena: Longitud de bytes != Longitud de cadena
fr_fr: Longueur de la chaîne : Longueur des octets != Longueur de la chaîne
zh_cn: String Length：字节长度！=字符串长度

source: Bytes and string length are not the same since strings are assumed to be UTF-8 encoded (according to the ABI defintion) therefore one character is not nessesarily encoded in one byte of data.
es: Los bytes y la longitud de la cadena no son lo mismo, ya que se supone que las cadenas están codificadas en UTF-8 (según la definición ABI), por lo que un carácter no está codificado necesariamente en un byte de datos.
fr_fr: Les octets et la longueur de la chaîne ne sont pas les mêmes puisque les chaînes sont supposées être encodées en UTF-8 (selon la définition de l'ABI) et qu'un caractère n'est donc pas nécessairement encodé dans un octet de données.
it: I byte e la lunghezza delle stringhe non sono la stessa cosa, poiché si presume che le stringhe siano codificate in UTF-8 (secondo la definizione ABI), quindi un carattere non è necessariamente codificato in un byte di dati.
zh_cn: 字节和字符串长度不一样，因为假设字符串是 UTF-8 编码的(根据 ABI 定义)，因此一个字符不一定会编码在一字节数据中。

source: Delete from dynamic array: 'delete' on an array leaves a gap
es: Borrar de un array dinámico: 'delete' en un array deja un hueco
fr_fr: Suppression d'un tableau dynamique : La fonction 'delete' sur un tableau laisse un vide
it: Eliminazione da una matrice dinamica: 'cancella' su una matrice lascia uno spazio vuoto
zh_cn: 从动态数组中删除：数组上的“删除”会留下空隙

source: Using delete on an array leaves a gap. The length of the array remains the same. If you want to remove the empty position you need to shift items manually and update the length property.
es: Utilizar delete en un array deja un hueco. La longitud del array sigue siendo la misma. Si desea eliminar la posición vacía, deberá desplazar los elementos manualmente y actualizar la propiedad de longitud.
fr_fr: L'utilisation de la fonction delete sur un tableau laisse un vide. La longueur du tableau reste la même. Si vous souhaitez supprimer la position vide, vous devez décaler les éléments manuellement et mettre à jour la propriété length.
it: L'uso di cancella" su una matrice lascia uno spazio vuoto. La lunghezza della matrice rimane invariata. Se si vuole rimuovere la posizione vuota, è necessario spostare manualmente gli elementi e aggiornare la proprietà "lunghezza".
zh_cn: 在数组上使用 delete 会留下一个空白。 数组的长度保持不变。 如果要删除空位置，则需要手动移动项目并更新长度属性。

source: Data Truncated: Division on int/uint values truncates the result
es: Datos truncados: La división en valores int/uint trunca el resultado
fr_fr: Données tronquées : La division sur des valeurs int/uint tronque le résultat.
it: Dati troncati: La divisione su valori int/uint tronca il risultato
zh_cn: 数据被截断：int/uint 值的除法会截断结果

source: Division of integer values yields an integer value again. That means e.g. 10 / 100 = 0 instead of 0.1 since the result is an integer again. This does not hold for division of (only) literal values since those yield rational constants.
es: La división de valores enteros vuelve a dar como resultado un valor entero. Esto significa, por ejemplo, que 10 / 100 = 0 en lugar de 0,1, ya que el resultado vuelve a ser un número entero. Esto no es válido para la división de (sólo) valores literales ya que esos dan constantes racionales.
fr_fr: La division de valeurs entières donne à nouveau une valeur entière. Cela signifie que, par exemple, 10 / 100 = 0 au lieu de 0,1 puisque le résultat est à nouveau un nombre entier. Ce n'est pas le cas pour la division de valeurs littérales (uniquement), qui donnent des constantes rationnelles.
it: La divisione di valori interi produce nuovamente un valore intero. Ciò significa che, ad esempio, 10 / 100 = 0 invece di 0,1, poiché il risultato è di nuovo un intero. Questo non vale per la divisione di valori (solo) letterali, poiché questi producono costanti razionali.
zh_cn: 整数值的除法再次产生整数值。 这意味着例如 10 / 100 = 0 而不是 0.1，因为结果又是一个整数。 这不适用于(仅)文字值的除法，因为它们产生有理常数。

source: Remix-analyzer
es: Analizador de remezclas
fr_fr: Analyseur de remix
it: Analizzatore di Remix
zh_cn: Remix-分析器

source: remix-analyzer is the library which works underneath of remix-ide Solidity Static Analysis plugin.
es: remix-analyzer es la biblioteca que funciona por debajo de remix-ide Solidity Static Analysis plugin.
fr_fr: remix-analyzer est la bibliothèque qui fonctionne sous le plugin d'analyse statique de remix-ide Solidity.
it: remix-analyzer è la libreria che è alla base del plugin Solidity Static Analysis di remix-ide.
zh_cn: remix-analyzer 是在 remix-ide Solidity 静态分析插件下工作的库。

source: remix-analyzer is an NPM package. It can be used as a library in a solution supporting node.js. Find more information about this type of usage in the remix-analyzer repository
es: remix-analyzer es un paquete NPM. Puede utilizarse como biblioteca en una solución que soporte node.js. Encuentre más información sobre este tipo de uso en el repositorio remix-analyzer
fr_fr: remix-analyzer est un paquet NPM. Il peut être utilisé comme bibliothèque dans une solution supportant node.js. Vous trouverez plus d'informations sur ce type d'utilisation dans le dépôt remix-analyzer.
it: remix-analyzer è un pacchetto NPM. Può essere usato come libreria in una soluzione che supporta node.js. Per maggiori informazioni su questo tipo di utilizzo, consultare l'archivio di remix-analyzer
zh_cn: remix-analyzer 是一个 NPM 包。 它可以用作支持 node.js 的解决方案中的库。 在 remix-analyzer 存储库中查找有关此类用法的更多信息

source: Support chat
es: Chat de apoyo
it: Chat di supporto
zh_cn: 支持聊天

source: We know that blockchain ecosystem is very new and that lots of information is scattered around the web. That is why we created a community support chat where we and other users try to answer your questions if you get stuck using Remix. Please, join the Remix channel and ask the community for help.
es: Sabemos que el ecosistema blockchain es muy nuevo y que hay mucha información dispersa por la web. Por eso hemos creado un chat de apoyo a la comunidad en el que nosotros y otros usuarios intentamos responder a sus preguntas si se queda atascado utilizando Remix. Por favor, únase al canal Remix y pida ayuda a la comunidad.
fr_fr: Nous savons que l'écosystème de la blockchain est très récent et que beaucoup d'informations sont dispersées sur le web. C'est pourquoi nous avons créé un chat d'assistance communautaire où nous et d'autres utilisateurs essayons de répondre à vos questions si vous êtes bloqué dans l'utilisation de Remix. Rejoignez le canal Remix et demandez de l'aide à la communauté.
it: Sappiamo che l'ecosistema blockchain è molto nuovo e che molte informazioni sono sparse sul web. Per questo motivo abbiamo creato una chat di supporto alla comunità in cui noi e altri utenti cerchiamo di rispondere alle vostre domande se vi trovate bloccati nell'utilizzo di Remix. Unitevi al canale Remix e chiedete aiuto alla comunità.
zh_cn: 我们知道区块链生态系统是非常新的，并且大量信息分散在网络上。 这就是为什么我们创建了一个社区支持聊天，如果您在使用 Remix 时遇到问题，我们和其他用户会尝试回答您的问题。 请加入 Remix 频道并向社区寻求帮助。

source: For anyone who is interested in developing a custom plugin for Remix or who wants to contribute to the codebase, we've opened another channel specially for developers working on Remix tool.
es: Para cualquiera que esté interesado en desarrollar un plugin personalizado para Remix o que quiera contribuir a la base de código, hemos abierto otro canal especialmente para los desarrolladores que trabajan en la herramienta Remix.
fr_fr: Pour tous ceux qui sont intéressés par le développement d'un plugin personnalisé pour Remix ou qui veulent contribuer à la base de code, nous avons ouvert un autre canal spécialement pour les développeurs travaillant sur l'outil Remix.
it: Per tutti coloro che sono interessati a sviluppare un plugin personalizzato per Remix o che vogliono contribuire alla base di codice, abbiamo aperto un altro canale appositamente per gli sviluppatori che lavorano sullo strumento Remix.
zh_cn: 对于有兴趣为 Remix 开发自定义插件或想要为代码库做出贡献的任何人，我们已经为使用 Remix 工具的开发人员专门开辟了另一个频道。

source: Features, available in the terminal:
es: Funciones, disponibles en el terminal:
fr_fr: Caractéristiques, disponibles dans le terminal :
it: Caratteristiche, disponibili nel terminale:
zh_cn: 终端中可用的功能：

source: It integrates a JavaScript interpreter and the web3 object. It enables the execution of the JavaScript script which interacts with the current context. (note that web3 is only available if the web provider or injected provider mode is selected).
es: Integra un intérprete de JavaScript y el objeto web3. Permite la ejecución del script JavaScript que interactúa con el contexto actual. (Tenga en cuenta que web3 sólo está disponible si se selecciona el modo de proveedor web o de proveedor inyectado).
fr_fr: Il intègre un interpréteur JavaScript et l'objet web3. Il permet l'exécution du script JavaScript qui interagit avec le contexte actuel. (notez que web3 n'est disponible que si le mode fournisseur web ou fournisseur injecté est sélectionné).
it: Integra un interprete JavaScript e l'oggetto web3. Consente l'esecuzione dello script JavaScript che interagisce con il contesto attuale. (si noti che web3 è disponibile solo se è selezionata la modalità provider web o provider iniettato).
zh_cn: 它集成了 JavaScript 解释器和 web3 对象。 它可以执行与当前上下文交互的 JavaScript 脚本。(请注意，web3 仅在选择 web 提供程序或注入提供程序模式时可用)。

source: It displays important actions made while interacting with the Remix IDE (i.e. sending a new transaction).
es: Muestra las acciones importantes realizadas al interactuar con el IDE Remix (por ejemplo, el envío de una nueva transacción).
fr_fr: Il affiche les actions importantes effectuées lors de l'interaction avec l'IDE Remix (par exemple, l'envoi d'une nouvelle transaction).
it: Visualizza le azioni importanti compiute durante l'interazione con l'IDE Remix (ad esempio, l'invio di una nuova transazione).
zh_cn: 它显示在与 Remix IDE 交互时所做的重要操作(即发送一个新的交易)。

source: It displays transactions that are mined in the current context. You can choose to display all transactions or only transactions that refers to the contracts Remix knows (e.g transaction created from the Remix IDE).
es: Muestra las transacciones que se minan en el contexto actual. Puede elegir mostrar todas las transacciones o sólo las transacciones que se refieren a los contratos que Remix conoce (por ejemplo, transacciones creadas desde el IDE de Remix).
fr_fr: Il affiche les transactions qui sont minées dans le contexte actuel. Vous pouvez choisir d'afficher toutes les transactions ou seulement celles qui se réfèrent aux contrats que Remix connaît (par exemple les transactions créées à partir de l'IDE Remix).
it: Mostra le transazioni che vengono processate nel contesto attuale. Si può scegliere di visualizzare tutte le transazioni o solo quelle che si riferiscono ai contratti che Remix conosce (ad esempio le transazioni create dall'IDE di Remix).
zh_cn: 它显示在当前内容中挖掘的交易。 您可以选择显示所有交易或仅显示引用 Remix 知道的合约的交易(例如从 Remix IDE 创建的交易)。

source: It allows searching for the data and clearing the logs from the terminal.
es: Permite buscar los datos y borrar los registros del terminal.
fr_fr: Il permet de rechercher les données et d'effacer les journaux du terminal.
it: Consente di ricercare i dati e di cancellare i registri dal terminale.
zh_cn: 它允许从终端搜索数据并清除日志。

source: You can run scripts by inputting them at the bottom after the >.
es: Puede ejecutar secuencias de comandos introduciéndolas en la parte inferior después del >.
fr_fr: Vous pouvez exécuter des scripts en les saisissant en bas après le >.
it: È possibile eseguire gli script inserendoli in basso dopo il simbolo >.
zh_cn: 您可以通过在 > 之后的底部输入脚本来运行脚本。

source: Debugging Transactions
es: Depuración de transacciones
fr_fr: Débogage des transactions
it: Debugging delle Transazioni
zh_cn: 调试交易

source: There are two ways to start debugging, each one corresponds to a different use case.
es: Hay dos formas de iniciar la depuración, cada una corresponde a un caso de uso diferente.
fr_fr: Il y a deux façons de commencer le débogage, chacune correspondant à un cas d'utilisation différent.
it: Esistono due modi per avviare il debug, ognuno dei quali corrisponde a un caso d'uso diverso.
zh_cn: 有两种方式开始调试，每一种都对应不同的用例。

source: from the transaction log in the Terminal - use this when you want to debug a transaction.
es: del registro de transacciones en el Terminal - utilícelo cuando desee depurar una transacción.
fr_fr: à partir du journal des transactions dans le terminal - à utiliser lorsque vous souhaitez déboguer une transaction.
it: dal registro delle transazioni nel Terminale - da usare quando si vuole eseguire il debug di una transazione.
zh_cn: 来自终端中的事务日志 - 当您想要调试事务时使用它。

source: from the Debugger - use this if you have a transaction hash.
es: del depurador - utilícelo si tiene un hash de transacciones.
fr_fr: à partir du débogueur - à utiliser si vous avez un hachage de transaction.
it: dal Debugger - utilizzalo se hai un hash della transazione.
zh_cn: 来自调试器 - 如果您有交易哈希，请使用它。

source: Initiate Debugging from the transaction log in the Terminal
es: Iniciar la depuración desde el registro de transacciones en el Terminal
fr_fr: Lancez le débogage à partir du journal des transactions dans le terminal.
it: Avviare il debug dal registro delle transazioni nel Terminale
zh_cn: 从终端的事务日志中启动调试

source: Let's start with a basic contract ( or replace this one by your own ) :
es: Empecemos con un contrato básico ( o sustituya éste por el suyo propio ) :
fr_fr: Commençons par un contrat de base (ou remplacez celui-ci par le vôtre) :
it: Iniziamo con un contratto di base (o sostituisci questo con il tuo):
zh_cn: 让我们从一份基本合约开始(或者自己替换这个合约)：

source: create a blank file in the file explorer (by clicking the + icon) and give it a name.
es: cree un archivo en blanco en el explorador de archivos (haciendo clic en el icono +) y asígnele un nombre.
fr_fr: créez un fichier vierge dans l'explorateur de fichiers (en cliquant sur l'icône +) et donnez-lui un nom.
it: crea un file vuoto nell'esplora file (facendo clic sull'icona +) e dagli un nome.
zh_cn: 在文件资源管理器中创建一个空白文件(通过单击 + 图标) 并为其命名。

source: copy the code below.
es: copie el siguiente código.
fr_fr: copiez le code ci-dessous.
it: copia il codice qui sotto.
zh_cn: 复制下面的代码。

source: compile the code.
es: compilar el código.
fr_fr: compiler le code.
it: compila il codice.
zh_cn: 编译代码。

source: click the Run & Deploy icon in the icon panel.
es: haga clic en el icono Ejecutar e implantar del panel de iconos.
fr_fr: cliquez sur l'icône Exécuter et déployer dans le panneau d'icônes.
it: fai clic sull'icona Esegui & Distribuisci nel pannello delle icone.
zh_cn: 单击图标面板中的运行和部署图标。

source: For the purpose of this tutorial, we will run the JavaScript VM. This simulates a custom blockchain. You could do the same using a proper backend node.
es: Para el propósito de este tutorial, ejecutaremos la VM JavaScript. Esto simula una blockchain personalizada. Usted podría hacer lo mismo utilizando un nodo backend adecuado.
fr_fr: Pour les besoins de ce tutoriel, nous exécuterons la VM JavaScript. Celle-ci simule une blockchain personnalisée. Vous pouvez faire la même chose en utilisant un nœud de backend approprié.
it: Ai fini di questa esercitazione, eseguiremo la macchina virtuale JavaScript. Questo simula una blockchain personalizzata. Si può fare lo stesso usando un nodo backend appropriato.
zh_cn: 出于本教程的目的，我们将运行 JavaScript VM。 这模拟了一个自定义区块链。 您可以使用适当的后端节点来做同样的事情。

source: Let's deploy the contract:
es: Despleguemos el contrato:
fr_fr: Déployons le contrat :
it: Distribuiamo il contratto:
zh_cn: 让我们部署合约：

source: Click the Deploy button
es: Pulse el botón Desplegar
fr_fr: Cliquez sur le bouton Déployer
it: Clicca il pulsante di Distribuzione
zh_cn: 单击部署按钮

source: You'll see the deployed instance (AKA the udapp).
es: Verá la instancia desplegada (alias la udapp).
fr_fr: Vous verrez l'instance déployée (AKA l'udapp).
it: Si vedrà l'istanza distribuita (alias udapp).
zh_cn: 您将看到已部署的实例(又名 udapp)。

source: Then open it up (by clicking the caret).
es: A continuación, ábrala (haciendo clic en el signo de intercalación).
fr_fr: Ensuite, ouvrez-le (en cliquant sur le caret).
it: Quindi aprilo (cliccando sul cursore).
zh_cn: 然后打开它(通过单击插入符号)。

source: We are going to call the Donate function and will send it ether.
es: Vamos a llamar a la función Donar y le enviaremos éter.
fr_fr: Nous allons appeler la fonction Donate et lui envoyer de l'éther.
it: Invocheremo la funzione Donate e le invieremo Ether.
zh_cn: 我们将调用 Donate 函数并将其发送它的ETH。

source: To do this: in the value input box put in 2 and select Ether as the unit (and not wei like I did in the image below - well you could - it won't really change anything).
es: Para ello: en la casilla de introducción de valores ponga 2 y seleccione Éter como unidad (y no wei como hice yo en la imagen de abajo -bueno, podría hacerlo, pero en realidad no cambiará nada).
fr_fr: Pour ce faire : dans le champ de saisie de la valeur, mettez 2 et sélectionnez Ether comme unité (et non pas wei comme je l'ai fait dans l'image ci-dessous - vous pourriez le faire, mais cela ne changera pas grand-chose).
it: Per farlo: nella casella di immissione del valore inserisci 2 e seleziona Ether come unità di misura (e non wei come ho fatto nell'immagine qui sotto - ma potresti farlo, non cambierebbe nulla).
zh_cn: 要做到这一点：在值输入框中输入 2 并选择ETH作为单位(而不是像我在下图中所做的那样 - 你可以 - 它不会真正改变任何东西)。

source: Then click the Donate button.
es: A continuación, pulse el botón Donar.
fr_fr: Cliquez ensuite sur le bouton Faire un don.
it: Quindi clicca il pulsante Dona.
zh_cn: 然后点击捐赠按钮。

source: This will send Ether to the this function.
es: Esto enviará Éter a la esta función.
fr_fr: Cela enverra de l'Ether à cette fonction.
it: Questo invierà Ether a questa funzione.
zh_cn: 这会将ETH发送到 this 函数。

source: Because we are using the JavaScript VM, everything happens almost instantly. (If we had been using Injected Web 3, then we would have to need to approve the transaction, pay for gas and wait for the transaction to get mined.)
es: Como estamos utilizando la VM JavaScript, todo sucede casi instantáneamente. (Si hubiéramos utilizado Injected Web 3, entonces tendríamos que aprobar la transacción, pagar la gasolina y esperar a que la transacción se minara).
fr_fr: Comme nous utilisons la VM JavaScript, tout se passe presque instantanément. (Si nous avions utilisé Injected Web 3, nous aurions dû approuver la transaction, payer l'essence et attendre que la transaction soit traitée).
it: Poiché stiamo utilizzando la macchina virtuale JavaScript, tutto avviene quasi istantaneamente. (Se avessimo usato Injected Web 3, avremmo dovuto approvare la transazione, pagare il carburante e aspettare che la transazione venisse processata)
zh_cn: 因为我们使用的是 JavaScript VM，所以几乎所有事情都会立即发生。(如果我们一直在使用 Injected Web 3，那么我们将需要批准交易、支付 gas 并等待交易被开采。)

source: Remix displays information related to each transaction result in the terminal.
es: Remix muestra información relacionada con el resultado de cada transacción en el terminal.
fr_fr: Remix affiche les informations relatives à chaque résultat de transaction dans le terminal.
it: Remix visualizza le informazioni relative al risultato di ciascuna transazione nel terminale.
zh_cn: Remix 在终端中显示与每个交易结果相关的信息。

source: Check in the terminal where the transaction you just made is logged.
es: Compruebe en el terminal donde está registrada la transacción que acaba de realizar.
fr_fr: Vérifiez dans le terminal où la transaction que vous venez d'effectuer est enregistrée.
it: Controlla nel terminale dove è registrata la transazione appena effettuata.
zh_cn: 签入记录您刚刚进行的交易的终端。

source: Click the debug button to start debugging it.
es: Pulse el botón de depuración para empezar a depurarlo.
fr_fr: Cliquez sur le bouton de débogage pour lancer le débogage.
it: Fai clic sul pulsante debug per avviare il debug.
zh_cn: 单击调试按钮开始调试它。

source: Before we get to the actual debugging tool, the next section show how to start debugging session directly from the Debugger.
es: Antes de pasar a la herramienta de depuración propiamente dicha, la siguiente sección muestra cómo iniciar una sesión de depuración directamente desde el depurador.
fr_fr: Avant de passer à l'outil de débogage proprement dit, la section suivante montre comment démarrer une session de débogage directement à partir du débogueur.
it: Prima di passare allo strumento di debug vero e proprio, la prossima sezione mostra come avviare una sessione di debug direttamente dal Debugger.
zh_cn: 在我们使用实际的调试工具之前，下一节将展示如何直接从调试器启动调试会话。

source: Initiate Debugging from the Debugger
es: Iniciar la depuración desde el depurador
fr_fr: Lancer le débogage à partir du débogueur
it: Avvia il Debug dal Debugger
zh_cn: 从调试器启动调试

source: Click the bug icon in the icon panel to get to the debugger in the side panel.
es: Pulse el icono del error en el panel de iconos para acceder al depurador en el panel lateral.
fr_fr: Cliquez sur l'icône de bogue dans le panneau d'icônes pour accéder au débogueur dans le panneau latéral.
it: Fai clic sull'icona del bug nel pannello delle icone per accedere al debugger nel pannello laterale.
zh_cn: 单击图标面板中的错误图标以访问侧面板中的调试器。
