Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix. In that case you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
es: El Gestor de Plugins es también el lugar al que debe acudir cuando esté creando su propio plugin y desee cargar su plugin local en Remix. En ese caso haría clic en el enlace "Conectar a un plugin local" en la parte superior del panel del Gestor de Plugins.
fr_fr: Le Plugin Manager est également l'endroit où vous allez lorsque vous créez votre propre plugin et que vous voulez charger votre plugin local dans Remix. Dans ce cas, vous devez cliquer sur le lien "Connect to a Local Plugin" en haut du panneau du Plugin Manager.
it: Il Gestore di Plugin è anche il posto dove puoi creare i tuoi stessi plugin o dove caricare i tuoi plugin locali in Remix. In quel caso dovrai cliccare su link "Connetti a un Plugin Locale" sopra al pannello del Gestore di Plugin.
zh_cn: 当您创建自己的插件并且想要将本地插件加载到 Remix 中时，插件管理器也是您要去的地方。 在这种情况下，您可以单击插件管理器面板顶部的“连接到本地插件”链接。

source: Themes
es: Temas
fr_fr: Thèmes
it: Temi
zh_cn: 主题

source: So you want to work on Remix with a dark theme or a gray theme or just a different theme that the one you are currently looking at? Go to the settings tab and at the bottom is a choice of lots of bootstrap based themes.
es: ¿Así que quiere trabajar en Remix con un tema oscuro o un tema gris o simplemente un tema diferente al que está viendo actualmente? Vaya a la pestaña de configuración y en la parte inferior podrá elegir entre un montón de temas basados en bootstrap.
fr_fr: Vous voulez travailler sur Remix avec un thème sombre ou un thème gris ou simplement un thème différent de celui que vous regardez actuellement ? Allez dans l'onglet des paramètres et en bas, vous trouverez un choix de nombreux thèmes basés sur bootstrap.
it: Vuoi lavorare in Remix con un tema scuro oppure un tema grigio o semplicemente un tema diverso da quello che hai in questo momento? Vai all scheda delle impostazioni e alla fine in basso potrai scegliere tra vari temi basati su bootstrap.
zh_cn: 因此，您想使用深色主题或灰色主题或只是与您当前正在查看的主题不同的主题来制作 Remix？ 转到设置选项卡，底部是许多基于引导程序的主题的选择。

source: Remix URLs & Links with Parameters
es: Remezclar URL y enlaces con parámetros
fr_fr: Remixer des URL et des liens avec des paramètres
it: URL di Remix e Link con Parametri
zh_cn: Remix重置链接和参数

source: Remix URLs
es: URL de remezcla
it: URL di Remix
zh_cn: Remix 重置链接

source: An online version is available at https://remix.ethereum.org. This version is stable and is updated at almost every release.
es: Existe una versión en línea disponible en https://remix.ethereum.org. Esta versión es estable y se actualiza prácticamente en cada lanzamiento.
fr_fr: Une version en ligne est disponible à l'adresse https://remix.ethereum.org. Cette version est stable et est mise à jour à presque toutes les versions.
it: La versione online è disponibile su https://remix.ethereum.org. Questa versione è stabile e viene aggiornata quasi con ogni release.
zh_cn: 在线版本可在 https://remix.ethereum.org 获得。 这个版本很稳定，几乎每个版本都会更新。

source: An alpha online version is available at https://remix-alpha.ethereum.org. This is not a stable version.
es: Una versión alfa en línea está disponible en https://remix-alpha.ethereum.org. No se trata de una versión estable.
fr_fr: Une version alpha en ligne est disponible à l'adresse https://remix-alpha.ethereum.org. Il ne s'agit pas d'une version stable.
it: Una versione alpha è disponibile online su https://remix-alpha.ethereum.org. Questa versione non è stabile.
zh_cn: Https://remix-alpha.ethereum.org 上提供了 alpha 在线版本。 这不是一个稳定的版本。

source: Github repo: https://github.com/ethereum/remix-project . The README contains instructions for running Remix-IDE locally.
es: Repo de Github: https://github.com/ethereum/remix-project . El README contiene instrucciones para ejecutar Remix-IDE localmente.
fr_fr: Dépôt Github : https://github.com/ethereum/remix-project . Le README contient des instructions pour exécuter Remix-IDE localement.
it: La repo di Github: https://github.com/ethereum/remix-project . Il file README contiene istruzioni per eseguire Remix-IDE localmente.
zh_cn: Github 仓库：https://github.com/ethereum/remix-project。 自述文件包含在本地运行 Remix-IDE 的说明。

source: Github release: https://github.com/ethereum/remix-project/releases .
es: Publicación en Github: https://github.com/ethereum/remix-project/releases .
fr_fr: Version Github : https://github.com/ethereum/remix-project/releases .
it: La release su Github: https://github.com/ethereum/remix-project/releases .
zh_cn: Github 发布：https://github.com/ethereum/remix-project/releases。

source: Embedding & Linking to Remix
es: Incrustación y enlaces a Remix
it: Incorporare & Collegare a Remix
zh_cn: 嵌入和链接到Remix

source: Remix-IDE's urls have parameters -so it is possible to specify:
es: Las urls de Remix-IDE tienen parámetros -por lo que es posible especificar:
fr_fr: Les urls de Remix-IDE ont des paramètres - il est donc possible de les spécifier :
it: Gli URL di Remix-IDE hanno dei parametri - quindi è possibile specificare:
zh_cn: Remix-IDE url 有参数 - 所以可以指定：

source: the list of plugins you want activated
es: la lista de plugins que desea activar
fr_fr: la liste des plugins que vous souhaitez activer
it: la lista dei plugin che vuoi attivare
zh_cn: 您要激活的插件列表

source: the theme (Dark or Light)
es: el tema (Oscuro o Claro)
fr_fr: le thème (Sombre ou Clair)
it: il tema (Scuro o Chiaro)
zh_cn: 主题(暗色或亮色)

source: the panels that should be minimized
es: los paneles que deben reducirse al mínimo
fr_fr: les panneaux qui doivent être réduits au minimum
it: i pannelli che dovrebbero essere minimizzati
zh_cn: 面板需要最小化

source: if you want the Solidity compiler to have optimize enabled
es: si desea que el compilador de Solidity tenga activada la optimización
fr_fr: si vous voulez que le compilateur Solidity ait activé l'optimisation
it: se vuoi che l'opzione di ottimizzazione del compilatore di Solidity sia attivata
zh_cn: 如果您希望 Solidity 编译器启用优化

source: In the following example, there is a list of plugins that follows the word plugins will be activated and the last plugin will gain the focus.
es: En el siguiente ejemplo, hay una lista de plugins que sigue a la palabra plugins se activará y el último plugin ganará el foco.
fr_fr: Dans l'exemple suivant, il y a une liste de plugins qui suit le mot plugins sera activée et le dernier plugin aura la priorité.
it: Nell'esempio seguente, c'è un elenco di plugin che seguono la parola plugin saranno attivati e l'ultimo plugin sarà focalizzato.
zh_cn: 在下面的示例中，有一个插件列表，后面跟着单词 plugins will beactivated 并且最后一个插件将获得专注。

source: For the plugin are called by their name in their profile. To check for a plugin's profile name - for plugins built by external teams, please go to https://github.com/ethereum/remix-plugins-directory/tree/master/plugins
es: Los plugins se denominan por su nombre en su perfil. Para comprobar el nombre del perfil de un plugin - para plugins construidos por equipos externos, por favor vaya a https://github.com/ethereum/remix-plugins-directory/tree/master/plugins.
fr_fr: Les plugins sont appelés par leur nom dans leur profil. Pour vérifier le nom du profil d'un plugin - pour les plugins construits par des équipes externes, veuillez vous rendre sur https://github.com/ethereum/remix-plugins-directory/tree/master/plugins.
it: I plugin sono chiamati con il loro nome nel loro profilo. Per controllare il nome del profilo di un plugin - per plugin costruiti da team esterni, per favore vai su https://github.com/ethereum/remix-plugins-directory/tree/master/plugins
zh_cn: 因为插件在他们的个人资料中被他们的名字所调用。 要检查插件的配置文件名称 - 对于外部团队构建的插件，请转到 https://github.com/ethereum/remix-plugins-directory/tree/master/plugins

source: Further Customization with URL parameters
es: Mayor personalización con parámetros URL
fr_fr: Personnalisation plus poussée avec les paramètres URL
it: Ulteriore Personalizzazione con i parametri URL
zh_cn: 使用 URL 参数进行进一步自定义

source: The following URL will close everything except the main panel & the icon panel (so the side and terminal are minimized)
es: La siguiente URL cerrará todo excepto el panel principal y el panel de iconos (por lo que el lateral y el terminal se minimizan)
fr_fr: L'URL suivante fermera tout sauf le panneau principal et le panneau d'icônes (le côté et le terminal sont donc minimisés).
it: L'URL seguente chiude tutto tranne il pannello principale e l'icona del pannello (perciò il pannello a lato e il terminal vengono minimizzati)
zh_cn: 以下 URL 将关闭除主面板和图标面板之外的所有内容（因此将侧面和终端最小化）

source: To link with the side panel minimized use this URL:
es: Para enlazar con el panel lateral minimizado utilice esta URL:
fr_fr: Pour créer un lien avec le panneau latéral réduit, utilisez cette URL :
it: Per collegare con il pannello a lato minimizzato utilizza questo URL:
zh_cn: 要链接到最小化的侧面板，请使用以下 URL：

source: To link to Remix with the dark theme or the light theme specified use this url:
es: Para enlazar con Remix con el tema oscuro o el tema claro especificado utilice esta url:
fr_fr: Pour créer un lien vers Remix avec le thème sombre ou le thème clair spécifié, utilisez cette url :
it: Per collegare a Remix con il tema scuro o con il tema chiaro specificato utilizza questo url:
zh_cn: 要使用指定的暗色主题或亮色主题链接到 Remix，请使用以下网址：

source: To link to Remix with the Solidity compiler, the unit testing, and LearnEth plugins activated (with Learneth gaining the side panel's focus) & with the Light theme loaded & with the terminal minimized use this URL & with optimize off:
es: Para enlazar con Remix con el compilador Solidity, las pruebas unitarias y los plugins LearnEth activados (con Learneth ganando el foco del panel lateral) & con el tema Light cargado & con el terminal minimizado utilice esta URL & con la optimización desactivada:
fr_fr: Pour vous connecter à Remix avec le compilateur Solidity, les tests unitaires et les plugins LearnEth activés (LearnEth étant placé dans le panneau latéral), le thème Light chargé et le terminal minimisé, utilisez cette URL et désactivez l'optimisation :
it: Per collegare a Remix con il compilatore Solidity, il test di unità, e i plugin LearnEth attivati (con la focalizzazione del pannello di lato su LearnEth) & con il tema chiaro caricato & con il terminale minimizzato utilizza questo URL & con l'ottimizzazione spenta:
zh_cn: 要链接到 Remix，使用 Solidity 编译器、单元测试和激活的 LearnEth 插件（Learneth 获得侧面板的焦点）并加载亮色主题并最小化终端使用此 URL 并关闭优化：

source: Everything is a PLUGIN in Remix
es: Todo es un PLUGIN en Remix
fr_fr: Tout est un PLUGIN dans Remix
it: Tutto è un PLUGIN in Remix
zh_cn: 一切都是 Remix 中的插件

source: In order to integrate new tools made by us and by ...you into Remix, we've now made everything a plugin. This architecture will also allow Remix or just parts of Remix to be integrated into other projects (your's for example).
es: Con el fin de integrar nuevas herramientas hechas por nosotros y por ...usted en Remix, ahora hemos convertido todo en un plugin. Esta arquitectura también permitirá integrar Remix o sólo partes de Remix en otros proyectos (el suyo, por ejemplo).
fr_fr: Afin d'intégrer de nouveaux outils créés par nous et par ...vous dans Remix, nous avons maintenant fait en sorte que tout soit un plugin. Cette architecture permettra également à Remix ou à des parties de Remix d'être intégrées dans d'autres projets (le vôtre par exemple).
it: Per integrare nuovi strumenti creati da noi e da ...te in Remix, abbiamo fatto diventare tutto un plugin. Questa architettura permetterà a Remix o alcune parti di Remix di essere integrate in altri progetti (il tuo per esempio).
zh_cn: 为了将我们和您制作的新工具集成到 Remix 中，我们现在将所有东西都制作成了插件。 这种架构还允许将 Remix 或仅 Remix 的一部分集成到其他项目中(例如您的项目)。

source: This means that you only load the functionality you need.
es: Esto significa que sólo carga la funcionalidad que necesita.
fr_fr: Cela signifie que vous ne chargez que les fonctionnalités dont vous avez besoin.
it: Questo significa che devi solo caricare le funzionalità di cui hai bisogno.
zh_cn: 这意味着您只加载您需要的功能。

source: It also means that you can turn off and on plugins - as your needs change.
es: También significa que puede activar y desactivar plugins, según cambien sus necesidades.
fr_fr: Cela signifie également que vous pouvez activer et désactiver les plugins en fonction de vos besoins.
it: Significa anche che puoi spegnere o accendere i plugin - a seconda dei tuoi bisogni.
zh_cn: 这也意味着您可以根据需求的变化关闭和打开插件。

source: This all happens in the plug manager.
es: Todo esto ocurre en el gestor de enchufes.
fr_fr: Tout cela se passe dans le gestionnaire de prises.
it: Tutto ciò avviene nel gestore di plugin.
zh_cn: 这一切都发生在插件管理器中。

source: The Plugin Manager is also the place you go when you are creating your own plugin and you want to load your local plugin into Remix.
es: El Gestor de Plugins es también el lugar al que debe acudir cuando esté creando su propio plugin y desee cargar su plugin local en Remix.
fr_fr: Le gestionnaire de plugins est également l'endroit où vous allez lorsque vous créez votre propre plugin et que vous voulez charger votre plugin local dans Remix.
it: Il Gestore di Plugin è anche il posto dove andare quando stai creando il tuo plugin e vuoi caricare il tuo plugin locale in Remix.
zh_cn: 当您创建自己的插件并且想要将本地插件加载到 Remix 中时，插件管理器也是您要去的地方。

source: To load your local plugin, you'd click on the "Connect to a Local Plugin" link at the top of the Plugin Manager panel.
es: Para cargar su plugin local, haga clic en el enlace "Conectar con un plugin local" en la parte superior del panel del Gestor de plugins.
fr_fr: Pour charger votre plugin local, vous devez cliquer sur le lien "Connect to a Local Plugin" en haut du panneau du gestionnaire de plugins.
it: Per caricare il tuo plugin locale, dovrai cliccare sul link "Connetti a un Plugin Locale" sopra al panello del Gestore di Plugin.
zh_cn: 要加载本地插件，您可以单击插件管理器面板顶部的“连接到本地插件”链接。

source: To learn more about how to create your own plugin, go to the README of remix-plugin repo.
es: Para saber más sobre cómo crear su propio plugin, vaya al README del repo remix-plugin.
fr_fr: Pour en savoir plus sur la façon de créer votre propre plugin, consultez le README du repo remix-plugin.
it: Per saperne di più su come creare i tuoi plugin, vai al file README della repo di remix-plugin.
zh_cn: 要了解有关如何创建自己的插件的更多信息，请转到 remix-plugin repo 的 README。

source: Remix Commands
es: Comandos Remix
fr_fr: Commandes Remix
it: Comandi di Remix
zh_cn: Remix命令

source: In the console, you can run the commands listed below. Once you start to type a command, there is auto completion. These commands are using the following libraries:
es: En la consola, puede ejecutar los comandos que se indican a continuación. Una vez que empiece a teclear un comando, habrá autocompletado. Estos comandos utilizan las siguientes bibliotecas:
fr_fr: Dans la console, vous pouvez exécuter les commandes énumérées ci-dessous. Une fois que vous commencez à taper une commande, elle est complétée automatiquement. Ces commandes utilisent les bibliothèques suivantes :
it: Nella console, puoi eseguire i comandi elencati qui sotto. Una volta che ha iniziato a scrivere un comando, c'è l'auto completamento. Questi comandi sono utilizzati nelle seguenti librerie:
zh_cn: 在控制台中，您可以运行下面列出的命令。 一旦你开始输入命令，就会自动完成。 这些命令使用以下库：

source: ethers: The ethers.js library is a compact and complete JavaScript library for Ethereum.
es: ethers: La biblioteca ethers.js es una biblioteca JavaScript compacta y completa para Ethereum.
fr_fr: ethers : La bibliothèque ethers.js est une bibliothèque JavaScript compacte et complète pour Ethereum.
it: ethers: La libreria ethers.js è una libreria compatta e completa per Ethereum.
zh_cn: ethers：ethers.js 库是一个紧凑且完整的以太坊 JavaScript 库。

source: remix: Ethereum IDE and tools for the web.
es: remix: IDE y herramientas de Ethereum para la web.
fr_fr: remix : IDE Ethereum et outils pour le web.
it: remix: IDE Ethereum e strumenti per il web.
zh_cn: remix：以太坊 IDE 和网络工具。

source: web3: The web3.js library is a collection of modules which contain specific functionality for the ethereum ecosystem.
es: web3: La biblioteca web3.js es una colección de módulos que contienen funcionalidades específicas para el ecosistema ethereum.
fr_fr: web3 : La bibliothèque web3.js est une collection de modules qui contiennent des fonctionnalités spécifiques pour l'écosystème ethereum.
it: web3: La libreria web3.js è una collezione di moduli che contengono funzionalità specifiche per l'ecosistema ethereum.
zh_cn: web3：web3.js 库是一组包含以太坊生态系统特定功能的模块。

source: swarmgw: This library can be used to upload/download files to Swarm via https://swarm-gateways.net/.
es: swarmgw: Esta biblioteca puede utilizarse para cargar/descargar archivos en Swarm a través de https://swarm-gateways.net/.
fr_fr: swarmgw : Cette bibliothèque peut être utilisée pour télécharger des fichiers vers Swarm via https://swarm-gateways.net/.
it: swarmgw: Questa libreria può essere utilizzata per caricare/scaricare file su Swarm via https://swarm-gateways.net/.
zh_cn: swarmgw：该库可用于通过 https://swarm-gateways.net/ 将文件上传/下载到 Swarm。

source: Here's the list of commands
es: Esta es la lista de comandos
fr_fr: Voici la liste des commandes
it: Qui c'è una lista di comandi
zh_cn: 这是命令列表

source: remix.debug(hash): Start debugging a transaction.
es: remix.debug(hash): Inicia la depuración de una transacción.
fr_fr: remix.debug(hash) : Commencez à déboguer une transaction.
it: remix.debug(hash): Inizia a fare il debugging di una transazione.
zh_cn: remix.debug(hash)：开始调试事务。

source: remix.debugHelp(): Display help message for debugging
es: remix.debugHelp(): Mostrar mensaje de ayuda para la depuración
fr_fr: remix.debugHelp() : Affiche un message d'aide pour le débogage
it: remix.debugHelp(): Visualizza il messaggio di aiuto per il debugging
zh_cn: remix.debugHelp()：显示调试帮助信息

source: remix.execute(filepath): Run the script specified by file path. If filepath is empty, script currently displayed in the editor is executed.
es: remix.execute(rutaarchivo): Ejecuta el script especificado por la ruta del archivo. Si filepath está vacío, se ejecuta el script que se muestra actualmente en el editor.
fr_fr: remix.execute(filepath) : Exécute le script spécifié par le chemin d'accès au fichier. Si filepath est vide, le script actuellement affiché dans l'éditeur est exécuté.
it: remix.execute(filepath): Esegui lo script specificato dal percorso del file. Se il percorso del file è vuoto, lo script visualizzato correntemente nell'editor viene eseguito.
zh_cn: remix.execute(filepath)：运行文件路径指定的脚本。 如果文件路径为空，则执行当前显示在编辑器中的脚本。

source: remix.exeCurrent(): Run the script currently displayed in the editor.
es: remix.exeCurrent(): Ejecuta el script que se muestra actualmente en el editor.
fr_fr: remix.exeCurrent() : Exécute le script actuellement affiché dans l'éditeur.
it: remix.exeCurrent(): Esegui lo script visualizzato correntemente nell'editor.
zh_cn: remix.exeCurrent()：运行编辑器中当前显示的脚本。

source: remix.getFile(path): Returns the content of the file located at the given path
es: remix.getFile(ruta): Devuelve el contenido del archivo ubicado en la ruta dada
fr_fr: remix.getFile(path) : Renvoie le contenu du fichier situé dans le chemin donné.
it: remix.getFile(path): Ritorna il contenuto del file localizzato in un dato percorso
zh_cn: remix.getFile(path)：返回位于给定路径的文件内容

source: remix.help(): Display this help message.
es: remix.help(): Muestra este mensaje de ayuda.
fr_fr: remix.help() : Affiche ce message d'aide.
it: remix.help(): Visualizza questo messaggio di aiuto.
zh_cn: remix.help()：显示此帮助信息。

source: remix.loadgist(id): Load a gist in the file explorer.
es: remix.loadgist(id): Carga un gist en el explorador de archivos.
fr_fr: remix.loadgist(id) : Charge un gist dans l'explorateur de fichiers.
it: remix.loadgist(id): Carica una gist nell'esploratore di file.
zh_cn: remix.loadgist(id)：在文件资源管理器中加载一个 gist。

source: remix.loadurl(url): Load the given url in the file explorer. The url can be of type github, swarm or ipfs.
es: remix.loadurl(url): Carga la url dada en el explorador de archivos. La url puede ser de tipo github, swarm o ipfs.
fr_fr: remix.loadurl(url) : Charge l'url donnée dans l'explorateur de fichiers. L'url peut être de type github, swarm ou ipfs.
it: remix.loadurl(url): Carica l'url dato nell'esploratore di file. L'url può essere di tipo github, swarm o ipfs.
zh_cn: remix.loadurl(url)：在文件资源管理器中加载给定的 url。 url 可以是 github、swarm 或 ipfs 类型。

source: remix.setFile(path, content): set the content of the file located at the given path
es: remix.setFile(ruta, contenido): establece el contenido del archivo situado en la ruta dada
fr_fr: remix.setFile(path, content) : définit le contenu du fichier situé au chemin donné
it: remix.setFile(path, content): setta il contenuto del file localizzato al percorso dato
zh_cn: remix.setFile(path, content)：设置位于给定路径的文件内容

source: remix.setproviderurl(url): Change the current provider to Web3 provider and set the url endpoint.
es: remix.setproviderurl(url): Cambia el proveedor actual a proveedor Web3 y establece el punto final url.
fr_fr: remix.setproviderurl(url) : Change le fournisseur actuel en fournisseur Web3 et définit le point d'arrivée de l'url.
it: remix.setproviderurl(url): Cambia il provider corrente in un provider Web3 e setta l'url dell'endpoint.
zh_cn: remix.setproviderurl(url)：将当前提供者更改为 Web3 提供者并设置 url 端点。

source: swarmgw.get(url, cb): Download files from Swarm via https**://swarm-gateways.net/
es: swarmgw.get(url, cb): Descargar archivos de Swarm a través de https**://swarm-gateways.net/
fr_fr: swarmgw.get(url, cb) : Téléchargez des fichiers depuis Swarm via https**://swarm-gateways.net/
it: swarmgw.get(url, cb): Scarica i file da Swarm via https**://swarm-gateways.net/
zh_cn: swarmgw.get(url, cb): 通过 https**://swarm-gateways.net/ 从 Swarm 下载文件

source: swarmgw.put(content, cb): Upload files to Swarm via https**://swarm-gateways.net/
es: swarmgw.put(contenido, cb): Subir archivos a Swarm a través de https**://swarm-gateways.net/
fr_fr: swarmgw.put(content, cb) : Téléchargement de fichiers vers Swarm via https**://swarm-gateways.net/
it: swarmgw.put(content, cb): Carica i file su Swarm via https**://swarm-gateways.net/
zh_cn: swarmgw.put(content, cb): 通过 https**://swarm-gateways.net/ 上传文件到 Swarm

source: ethers.Contract: This API provides a graceful connection to a contract deployed on the blockchain, simplifying calling and querying its functions and handling all the binary protocol and conversion as necessarily.
es: ethers.Contract: Esta API proporciona una conexión elegante a un contrato desplegado en la blockchain, simplificando la llamada y consulta de sus funciones y manejando todo el protocolo binario y la conversión como sea necesario.
fr_fr: ethers.Contract : Cette API fournit une connexion gracieuse à un contrat déployé sur la blockchain, simplifiant l'appel et l'interrogation de ses fonctions et gérant tout le protocole binaire et la conversion comme il se doit.
it: ethers.Contract: Questo API fornisce una connessione elegante a un contratto distribuito sulla blockchain, semplificando la chiamata e l'interrogazione delle sue funzioni e gestendo tutti i protocolli binari e la conversione se necessario.
zh_cn: ethers.Contract：此 API 提供与部署在区块链上的合约的优雅连接，简化调用和查询其功能，并根据需要处理所有二进制协议和转换。
