Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/all.po
Languages: es, fr_fr, it, zh_cn

source: Files in Remix can be imported with the import key word with the path to the file. Use ./ for relative paths to increase portability.
es: Los archivos en Remix pueden importarse con la palabra clave de importación con la ruta al archivo. Utilice ./ para las rutas relativas para aumentar la portabilidad.
fr_fr: Les fichiers dans Remix peuvent être importés avec le mot-clé import et le chemin d'accès au fichier. Utilisez ./ pour les chemins relatifs afin d'améliorer la portabilité.
it: I file in Remix possono essere importati con la parola chiave d'importazione con il percorso al file. Usa ./ per il percorso relativo per aumentare la portabilità.
zh_cn: Remix 中的文件可以使用带有文件路径的 import 关键字导入。 使用 ./ 作为相对路径以增加可移植性。

source: Importing a file from your computer's filesystem
es: Importar un archivo desde el sistema de archivos de su ordenador
fr_fr: Importation d'un fichier à partir du système de fichiers de votre ordinateur
it: Importare un file dal sistema di file del tuo computer
zh_cn: 从计算机的文件系统导入文件

source: This method uses remixd - the remix daemon. Please go to the remixd tutorial for instructions about how to bridge the divide between the browser and your computers filesystem.
es: Este método utiliza remixd - el demonio remix. Por favor, diríjase al tutorial remixd para obtener instrucciones sobre cómo tender un puente entre el navegador y el sistema de archivos de su ordenador.
fr_fr: Cette méthode utilise remixd - le démon remix. Veuillez consulter le tutoriel remixd pour obtenir des instructions sur la manière de combler le fossé entre le navigateur et le système de fichiers de votre ordinateur.
it: Questo metodo utilizza remixd - il daemon di remix. Per favore vai al tutorial di remixd per istruzioni riguardo come collegare il browser e il sistema di file del tuo computer.
zh_cn: 此方法使用 remixd - remix 守护程序。 请转到 remixd 教程以获取有关如何弥合浏览器和计算机文件系统之间鸿沟的说明。

source: Importing from GitHub
es: Importar desde GitHub
fr_fr: Importation depuis GitHub
it: Importare da GitHub
zh_cn: 从 GitHub 导入

source: It is possible to import files directly from GitHub. You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example below imports from OpenZeppelin Contracts v2.5.0.
es: Es posible importar archivos directamente desde GitHub. Debe especificar la etiqueta de versión (cuando esté disponible), de lo contrario obtendrá el último código de la rama maestra. Para OpenZeppelin Contracts sólo debe utilizar código publicado en una versión oficial, el ejemplo siguiente importa de OpenZeppelin Contracts v2.5.0.
fr_fr: Il est possible d'importer des fichiers directement depuis GitHub. Vous devez spécifier l'étiquette de la version (lorsqu'elle est disponible), sinon vous obtiendrez le code le plus récent de la branche master. Pour OpenZeppelin Contracts, vous ne devez utiliser que le code publié dans une version officielle. L'exemple ci-dessous importe OpenZeppelin Contracts v2.5.0.
it: È possibile importare file direttamente da GitHub. Devi specificare il tag di release (quando è presente), altrimenti puoi ottenere l'ultima versione del codice dal ramo master. Per i Contratti OpenZeppelin dovresti utilizzare solo il codice pubblicato nelle release ufficiali, l'esempio sottostante importa da i Contratti OpenZeppelin v2.5.0.
zh_cn: 可以直接从 GitHub 导入文件。 您应该指定发布标签(如果可用)，否则您将在主分支中获得最新代码。 对于 OpenZeppelin Contracts，您应该只使用在官方版本中发布的代码，下面的示例从 OpenZeppelin Contracts v2.5.0 导入。

source: Importing from Swarm
es: Importar desde Swarm
fr_fr: Importation depuis Swarm
it: Importare da Swarm
zh_cn: 从 Swarm 导入

source: Files can be imported using all URLs supported by swarm. If you do not have a swarm node, then use swarm-gateways.net.
es: Los archivos pueden importarse utilizando todas las URL admitidas por swarm. Si no dispone de un nodo swarm, utilice swarm-gateways.net.
fr_fr: Les fichiers peuvent être importés en utilisant toutes les URL supportées par swarm. Si vous n'avez pas de nœud swarm, utilisez swarm-gateways.net.
it: I file possono essere importati utilizzando tutti gli URL supportati da Swarm. Se non hai un nodo sward allora utilizza swarm-gateways.net.
zh_cn: 可以使用 swarm 支持的所有 URL 导入文件。 如果您没有 swarm 节点，请使用 swarm-gateways.net。

source: Importing from IPFS
es: Importar desde IPFS
fr_fr: Importation depuis IPFS
it: Importare da IPFS
zh_cn: 从 IPFS 导入

source: Files can be imported from IPFS.
es: Los archivos pueden importarse desde IPFS.
fr_fr: Les fichiers peuvent être importés depuis IPFS.
it: I file possono essere importati da IPFS.
zh_cn: 文件可以从 IPFS 导入。

source: Importing from the console
es: Importar desde la consola
fr_fr: Importation depuis la console
it: Importare dalla console
zh_cn: 从控制台导入

source: You can also use a remix command remix.loadurl('<the_url>')in the console. You should specify the release tag (where available), otherwise you will get the latest code in the master branch. For OpenZeppelin Contracts you should only use code published in an official release, the example below imports from OpenZeppelin Contracts v2.5.0.
es: También puede utilizar un comando remix remix.loadurl('<the_url>')en la consola. Debe especificar la etiqueta release (cuando esté disponible), de lo contrario obtendrá el último código de la rama master. Para OpenZeppelin Contracts sólo debe utilizar código publicado en una versión oficial, el ejemplo siguiente importa de OpenZeppelin Contracts v2.5.0.
fr_fr: Vous pouvez également utiliser une commande remix remix.loadurl('<the_url>')dans la console. Vous devez spécifier la balise release (lorsqu'elle est disponible), sinon vous obtiendrez le code le plus récent de la branche master. Pour OpenZeppelin Contracts, vous ne devez utiliser que le code publié dans une version officielle. L'exemple ci-dessous importe OpenZeppelin Contracts v2.5.0.
it: Puoi anche utilizzare un comando di Remix, remix.loadurl('<the_url>'), nella console. Dovrai specificare il tag di release (quando disponibile), altrimenti avrai l'ultimo codice disponibile dal ramo master. Per i Contratti OpenZeppelin dovrai utilizzare il codice pubblicato in una release ufficiale, l'esempio sottostante importa dai Contratti OpenZeppelin v2.5.0.
zh_cn: 您还可以在控制台中使用remix命令 remix.loadurl('<the_url>')。 您应该指定发布标签(如果可用)，否则您将在主分支中获得最新代码。 对于 OpenZeppelin Contracts，您应该只使用在官方版本中发布的代码，下面的示例从 OpenZeppelin Contracts v2.5.0 导入。

source: Notice that this will create a github folder in the file explorer. To load a file in the github folder, you would use a command like this:
es: Observe que esto creará una carpeta github en el explorador de archivos. Para cargar un archivo en la carpeta github, usaría un comando como este:
fr_fr: Notez que cela créera un dossier github dans l'explorateur de fichiers. Pour charger un fichier dans le dossier github, vous devez utiliser une commande comme celle-ci :
it: Nota che questo creerà una cartella github nell'esploratore di file. Per caricare un file nella cartella di github dovrai utilizzare un comando come questo:
zh_cn: 请注意，这将在文件资源管理器中创建一个 github 文件夹。 要在 github 文件夹中加载文件，您可以使用如下命令：

source: Welcome to Remix documentation!
es: ¡Bienvenido a la documentación de Remix!
fr_fr: Bienvenue sur la documentation de Remix !
it: Benvenuto alla documentazione di Remix!
zh_cn: 欢迎使用 Remix 文档！

source: Remix is a powerful, open source tool that helps you write Solidity contracts straight from the browser. Written in JavaScript, Remix supports both usage in the browser and locally.
es: Remix es una potente herramienta de código abierto que le ayuda a escribir contratos Solidity directamente desde el navegador. Escrito en JavaScript, Remix admite tanto el uso en el navegador como localmente.
fr_fr: Remix est un puissant outil Opensource qui vous aide à écrire des contrats Solidity directement depuis le navigateur. Écrit en JavaScript, Remix prend an charge à la fois l'utilisation dans le navigateur et localement.
it: Remix è uno strumento potente e a sorgente aperta che ti aiuta a scrivere contratti Solidity direttamente dal browser. Scritto in JavaScript, Remix supporta l'utilizzo sia sul browser che locale.
zh_cn: Remix 是一个功能强大的开源工具，可帮助您直接从浏览器编写 Solidity 合约。 Remix 用 JavaScript 编写，支持在浏览器和本地使用

source: Remix also supports testing, debugging and deploying of smart contracts and much more.
es: Remix también permite probar, depurar y desplegar contratos inteligentes y mucho más.
fr_fr: Remix prend également en charge les tests, le débogage, le déploiement de contrats intelligents et bien plus encore.
it: Remix supporta anche il test, debugging e distribuzione dei contratti intelligenti e molto altro.
zh_cn: Remix 还支持智能合约的测试、调试和部署等等。

source: Our Remix project with all its features is available at `remix.ethereum.org <https://remix.ethereum.org>`__ and more information can be found in these docs. Our IDE tool is available at `our GitHub repository <https://github.com/ethereum/remix-ide>`__.
es: Nuestro proyecto Remix con todas sus características está disponible en `remix.ethereum.org <https://remix.ethereum.org>`__ y puede encontrar más información en estos documentos. Nuestra herramienta IDE está disponible en `nuestro repositorio GitHub <https://github.com/ethereum/remix-ide>`__.
fr_fr: Notre projet Remix avec toutes ses fonctionnalités est disponible sur `remix.ethereum.org <https://remix.ethereum.org>`__ et plus d'informations peuvent être trouvées dans ces documents. Notre outil IDE est disponible sur `notre dépôt GitHub <https://github.com/ethereum/remix-ide>`__.
it: Il nostro progetto di Remix con tutte le sue caratteristiche è disponibile su `remix.ethereum.org <https://remix.ethereum.org>`__ e molte altre informazioni possono essere trovate in questi documenti. Il nostro strumento di IDE è disponibile nella `nostra repository GitHub <https://github.com/ethereum/remix-ide>`__.
zh_cn: `remix.ethereum.org <https://remix.ethereum.org>`__ 上提供了我们的 Remix 项目及其所有功能，更多信息可以在这些文档中找到。 我们的 IDE 工具可在`我们的 GitHub 存储库 <https://github.com/ethereum/remix-ide>`__ 中获得。

source: This set of documents covers instructions on how to use Remix and some tutorials to help you get started.
es: Este conjunto de documentos incluye instrucciones sobre cómo utilizar Remix y algunos tutoriales que le ayudarán a empezar.
fr_fr: Cet ensemble de documents couvre les instructions sur la façon d'utiliser Remix et quelques tutoriels pour vous aider à débuter.
it: Questo set di documenti copre le istruzioni su come utilizzare Remix e alcuni tutorial ti aiutano a iniziare.
zh_cn: 这组文档涵盖了有关如何使用 Remix 的说明以及一些帮助您入门的教程。

source: Useful links:
es: Enlaces útiles:
fr_fr: Liens utiles :
it: Link utili:
zh_cn: 实用链接：

source: `Remix alpha <https://remix-alpha.ethereum.org>`__ - The version where we test new Remix release (not stable!).
es: `Remix alfa <https://remix-alpha.ethereum.org>`__ - La versión en la que probamos la nueva versión de Remix (¡no estable!).
fr_fr: `Remix alpha <https://remix-alpha.ethereum.org>`__ - La version où nous testons les nouvelles versions de Remix (pas stable !).
it: `Remix alpha <https://remix-alpha.ethereum.org>`__ - La versione dove testare le nuove release di Remix (non stabile!).
zh_cn: `Remix alpha <https://remix-alpha.ethereum.org>`__ - 我们测试新 Remix 发行版本的版本(不稳定！)。

source: `Remix on Medium <https://medium.com/remix-ide>`__
es: `Remix en Medium <https://medium.com/remix-ide>`__
fr_fr: `Remix sur Medium <https://medium.com/remix-ide>`__
it: `Remix su Medium <https://medium.com/remix-ide>`__
zh_cn: `Remix在Medium上 <https://medium.com/remix-ide>`__

source: `Ethereum StackExchange for Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__
es: `Ethereum StackExchange para Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__
fr_fr: `Ethereum StackExchange pour Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__
it: `Ethereum StackExchange per Remix <https://ethereum.stackexchange.com/questions/tagged/remix>`__
zh_cn: `用于Remix的以太坊 StackExchange <https://ethereum.stackexchange.com/questions/tagged/remix>`__

source: `Community support channel <https://gitter.im/ethereum/remix>`__
es: `Canal de apoyo comunitario <https://gitter.im/ethereum/remix>`__
fr_fr: `Salon de support de la Communauté <https://gitter.im/ethereum/remix>`__
it: `Canale di supporto per la Community <https://gitter.im/ethereum/remix>`__
zh_cn: `社区支持频道<https://gitter.im/ethereum/remix>`__

source: `Ðapp Developer resources (Ethereum wiki) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__
es: `Ðapp Recursos para desarrolladores (Ethereum wiki) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__
fr_fr: `Ressources pour les développeurs dApp (Wiki Ethereum) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__
it: `Risorse per Sviluppatori di Ðapp (Ethereum wiki) <https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__
zh_cn: `Ðapp 开发者资源(以太坊维基)<https://github.com/ethereum/wiki/wiki/Dapp-Developer-Resources>`__

source: New Layout Intro
es: Introducción al nuevo diseño
fr_fr: Nouvelle mise en page de l'introduction
it: Introduzione al Nuovo Layout
zh_cn: 新布局介绍

source: Tour of default modules
es: Recorrido por los módulos predeterminados
fr_fr: Aperçu des modules par défaut
it: Tour dei moduli di default
zh_cn: 默认模块之旅

source: Tour of typical solidity modules
es: Recorrido por los módulos de solidez típicos
fr_fr: Aperçu des des modules types de Solidity
it: Tour dei moduli tipici di solidity
zh_cn: 典型 Solidity 模块之旅

source: Solidity Unit Testing
es: Pruebas unitarias de Solidity
fr_fr: Test unitaire Solidity
it: Test Unitari di Solidity
zh_cn: Solidity 单元测试

source: Using Remix
es: Uso de Remix
fr_fr: Utiliser Remix
it: Utilizzo di Remix
zh_cn: 使用 Remix

source: Miscellaneous
es: Varios
fr_fr: Divers
it: Varie
zh_cn: 其它选项

source: Remix-IDE Layout
es: Disposición Remix-IDE
fr_fr: Mise en page de Remix-IDE
it: Layout di Remix-IDE
zh_cn: Remix-IDE 布局

source: The new structure
es: La nueva estructura
fr_fr: La nouvelle structure
it: La nuova struttura
zh_cn: 新结构

source: Icon Panel - click to change which plugin appears in the Side Panel
es: Panel de iconos - haga clic para cambiar el plugin que aparece en el panel lateral
fr_fr: Panneau d'icônes - cliquez pour changer le plugin apparaîtra dans le panneau latéral
it: Pannello delle Icone - clicca per cambiare quale plugin appare nel Pannello a Lato
zh_cn: 图标面板 - 单击以更改侧面板中显示的插件

source: Side Panel - Most but not all plugins will have their GUI here.
es: Panel lateral - La mayoría de los plugins, aunque no todos, tendrán aquí su interfaz gráfica de usuario.
fr_fr: Panneau latéral - la plupart mais non l'intégralité des plugins auront leur interface graphique ici.
it: Pannello a Lato - Molti ma non tutti i plugin avranno una GUI qui.
zh_cn: 侧面板 - 大多数但不是所有的插件都会在这里有它们的 GUI。

source: Main Panel - In the old layout this was just for editing files. In the tabs can be plugins or files for the IDE to compile.
es: Panel principal - En el antiguo diseño sólo servía para editar archivos. En las pestañas puede haber plugins o archivos para que el IDE los compile.
fr_fr: Panneau principal - dans l'ancienne mise en page, l'utilité résidait uniquement dans l'édition de fichiers. Dans les onglets peuvent être des plugins ou des fichiers pour que l'IDE puisse compiler.
it: Pannello Principale - Nel vecchio layout questo era solo per modificare i file. Le schede possono essere plugin o file da compilare nella IDE.
zh_cn: 主面板 - 在旧布局中，这仅用于编辑文件。 选项卡中可以是 IDE 编译的插件或文件。

source: Terminal - where you will see the results of your interactions with the GUI's. Also you can run scripts here.
es: Terminal - donde verá los resultados de sus interacciones con las GUI. También puede ejecutar scripts aquí.
fr_fr: Terminal - où vous verrez les résultats de vos interactions avec les interfaces graphiques. Vous pouvez également y exécuter des scripts.
it: Terminale - dove vedrai i risultati delle tue interazioni con la GUI. Qui puoi anche eseguire gli script.
zh_cn: 终端 - 您将在其中看到与 GUI 交互的结果。 您也可以在此处运行脚本。

source: Icon Panel at Page Load
es: Panel de iconos al cargar la página
fr_fr: Panneau d'icônes au chargement de la page
it: Icona del Pannello al Caricamento della Pagina
zh_cn: 页面加载时的图标面板

source: When you load remix - the icon panel show these icons by default.
es: Cuando cargue Remix, el panel de iconos mostrará estos iconos por defecto.
fr_fr: Lorsque vous chargez remix - le panneau d'icônes affiche ces icônes par défaut.
it: Quando carichi Remix - l'icona del pannello mostrerà queste icone di default.
zh_cn: 当您加载 Remix - 图标面板默认显示这些图标。

source: Everything in remix is now a plugin... so the Plugin Manager is very important. In the old layout, each basic task in remix was separated into the tabs. Now these tabs are plugins.
es: Todo en remix es ahora un plugin... así que el Gestor de Plugins es muy importante. En el antiguo diseño, cada tarea básica en remix estaba separada en las pestañas. Ahora estas pestañas son plugins.
fr_fr: Tout dans remix est maintenant un plugin... donc le gestionnaire de plugins est très important. Dans l'ancienne présentation, chaque tâche de base dans remix était séparée dans les onglets. Maintenant, ces onglets sont des plugins.
it: Adesso in Remix tutto è un plugin... quindi il Gestore di Plugin è molto importante. Nel vecchio layout, ogni funzione base in Remix era separata in schede. Adesso queste schede sono plugin.
zh_cn: Remix 中的所有内容现在都是插件...... 所以插件管理器非常重要。 在旧布局中，Remix 中的每个基本任务都被分成选项卡。 现在这些选项卡是插件。

source: But to activate a half a dozen plugins - (or however many you are using) each time the page load is tedious. So learn about the Environments.
es: Pero activar media docena de plugins (o los que utilice) cada vez que se carga la página resulta tedioso. Así que aprenda sobre los Entornos.
fr_fr: Mais il est fastidieux d'activer une demi-douzaine de plugins (ou le nombre de plugins que vous utilisez) à chaque chargement de page. Apprenez donc à connaître les environnements.
it: Ma per attivare mezza dozzina di plugin - (o quanti ne stai usando) ogni volta il caricamento della pagina diventa noioso. Per cui è bene imparare a usare gli Ambienti.
zh_cn: 但是每次页面加载时要激活六个插件(或您正在使用的插件) 是很乏味的。 所以要了解环境。

source: Homepage
es: Página de inicio
fr_fr: Page d'accueil
it: Pagina Iniziale
zh_cn: 主页

source: The homepage is located in a tab in the Main Panel.
es: La página de inicio se encuentra en una pestaña del panel principal.
fr_fr: La page d'accueil se trouve dans un onglet du panneau principal.
it: La pagina iniziale si trova in una scheda del Pannello Principale.
zh_cn: 主页位于主面板中的选项卡中。

source: You can also get there by clicking the remix logo at the top of the icon panel.
es: También puede llegar allí haciendo clic en el logotipo de la remezcla en la parte superior del panel de iconos.
fr_fr: Vous pouvez également y accéder en cliquant sur le logo Remix en haut du panneau d'icônes.
it: Puoi arrivarci anche cliccando il logo di Remix sopra l'icona del pannello.
zh_cn: 您也可以通过单击图标面板顶部的Remix徽标来到达那里。

source: Environments
es: Entornos
fr_fr: Environnements
it: Ambienti
zh_cn: 环境

source: Clicking on one of the environment buttons loads up a collection of plugins. We currently have a Solidity Button and a Vyper button. In the future you will be able to save your own environment.
es: Al hacer clic en uno de los botones de entorno, se carga una colección de plugins. Actualmente tenemos un botón Solidity y un botón Vyper. En el futuro podrá guardar su propio entorno.
fr_fr: En cliquant sur l'un des boutons d'environnement, vous accédez à une collection de plugins. Nous disposons actuellement d'un bouton Solidity et d'un bouton Vyper. À l'avenir, vous pourrez enregistrer votre propre environnement.
it: Cliccare uno dei pulsanti dell'ambiente carica una collezione di plugin. Al momento abbiamo un Pulsante Solidity e un Pulsante Vyper. In futuro sarai in grado di salvare il tuo stesso ambiente.
zh_cn: 单击其中一个环境按钮会加载一组插件。 我们目前有一个 Solidity 按钮和一个 Vyper 按钮。 将来，您将能够保存自己的环境。

source: To see all the plugins go to the plugin manager - by selecting the plug in the icon panel.
es: Para ver todos los plugins vaya al gestor de plugins - seleccionando el plug en el panel de iconos.
fr_fr: Pour voir tous les plugins, allez dans le gestionnaire de plugin - en sélectionnant l'icône de la prise dans le panneau d'icônes.
it: Per vedere tutti i plugin vai al gestore di plugin - seleziona il plugin nel pannello delle icone.
zh_cn: 要查看所有插件，请转到插件管理器 - 通过在图标面板中选择插件。

source: The environment buttons are time & sanity savers - so you don't need to go to the plugin manager to get started everytime you load the page.
es: Los botones de entorno son ahorradores de tiempo y cordura - así no tendrá que ir al gestor de plugins para empezar cada vez que cargue la página.
fr_fr: Les boutons d'environnement permettent d'économiser du temps et de l'énergie - ainsi, vous n'avez pas besoin d'aller dans le gestionnaire de plugins pour démarrer à chaque fois que vous chargez la page.
it: I pulsanti dell'ambiente risparmiano tempo e sanità mentale - così non devi andare al gestore di plugin per iniziare ogni volta che vuoi ricaricare la pagina.
zh_cn: 环境按钮可以节省时间和精力—因此您无需在每次加载页面时都去插件管理器开始使用。

source: Plugin Manager
es: Gestor de plugins
fr_fr: Gestionnaire de plugin
it: Gestore di Plugin
zh_cn: 插件管理器

source: In order to make Remix flexible for integrating changes into its functionality and for integrating remix into other projects (your's for example), we've now made everything a plugin. This means that you only load the functionality you need. It also means that you need a place to turn off and on plugins - as your needs change. This all happens in the plug manager.
es: Para que Remix sea flexible a la hora de integrar cambios en su funcionalidad y de integrar Remix en otros proyectos (el suyo, por ejemplo), ahora hemos convertido todo en un plugin. Esto significa que usted sólo carga la funcionalidad que necesita. También significa que necesita un lugar para activar y desactivar plugins, a medida que cambien sus necesidades. Todo esto sucede en el gestor de plugins.
fr_fr: Afin de rendre Remix flexible pour l'intégration de changements dans ses fonctionnalités et pour l'intégration de Remix dans d'autres projets (le vôtre par exemple), nous avons maintenant fait en sorte que tout soit un plugin. Cela signifie que vous ne chargez que les fonctionnalités dont vous avez besoin. Cela signifie également que vous avez besoin d'un endroit pour activer et désactiver les plugins - en fonction de l'évolution de vos besoins. Tout cela se passe dans le gestionnaire de plugins.
it: Per rendere Remix flessibile e integrare i cambiamenti nelle sue funzionalità o per integrare Remix con altri progetti (il tuo per esempio), abbiamo fatto diventare tutto un plugin. Questo significa che devi caricare solo le funzionalità di cui hai bisogno. Significa inoltre che dovrai avere un posto per accendere e spegnere i plugin - a seconda dei tuoi bisogni. Tutto ciò avviene nel gestore dei plugin.
zh_cn: 为了使 Remix 能够灵活地将更改集成到其功能中，并将 Remix 集成到其他项目(例如您的项目) 中，我们现在将所有内容都做成了插件。 这意味着您只加载您需要的功能。 这也意味着您需要一个地方来关闭和打开插件 - 随着您的需求变化。 这一切都发生在插件管理器中。
