Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/assert_library.po
Languages: es

source: Remix Assert Library
es: Librer√≠a de activos Remix

source: [Assert.ok(value[, message])](#assert-ok-value-message)
es: [Assert.ok(valor[, mensaje])](#assert-ok-valor-mensaje)

source: [Assert.equal(actual, expected[, message])](#assert-equal-actual-expected-message)
es: [Assert.equal(real, esperado[, mensaje])](#assert-equal-actual-esperado-mensaje)

source: [Assert.notEqual(actual, expected[, message])](#assert-notequal-actual-expected-message)
es: [Assert.notEqual(real, esperado[, mensaje])](#assert-notequal-actual-esperado-mensaje)

source: [Assert.greaterThan(value1, value2[, message])](#assert-greaterthan-value1-value2-message)
es: [Assert.greaterThan(valor1, valor2[, mensaje])](#assert-greaterthan-valor1-valor2-mensaje)

source: [Assert.lesserThan(value1, value2[, message])](#assert-lesserthan-value1-value2-message)
es: [Assert.lesserThan(valor1, valor2[, mensaje])](#assert-lesserthan-valor1-valor2-mensaje)

source: Assert.ok(value[, message])
es: Assert.ok(valor[, mensaje])

source: `value`: \<bool\>
es: `valor`: \<bool\>

source: `message`: \<string\>
es: `mensaje`: \<string\>

source: Tests if value is truthy. `message` is returned in case of failure.
es: Comprueba si el valor es verdadero. Se devuelve `mensaje` en caso de fallo.

source: Examples:
es: Ejemplos:

source: Assert.equal(actual, expected[, message])
es: Assert.equal(actual, esperado[, mensaje])

source: `expected`: \<uint | int | bool | address | bytes32 | string\>
es: `esperado`: \<uint | int | bool | address | bytes32 | string\>

source: Tests if `actual` & `expected` values are same. `message` is returned in case of failure.
es: Comprueba si los valores `actual` y `expected` son iguales. En caso de fallo se devuelve `message`.

source: Assert.notEqual(actual, expected[, message])
es: Assert.notEqual(actual, esperado[, mensaje])

source: Tests if `actual` & `expected` values are not same. `message` is returned in case of failure.
es: Comprueba si los valores `actual` y `expected` no son iguales. En caso de fallo se devuelve `message`.

source: Assert.greaterThan(value1, value2[, message])
es: Assert.mayorque(valor1, valor2[, mensaje])

source: `value1`: \<uint | int\>
es: `valor1`: \<uint | int\>

source: `value2`: \<uint | int\>
es: `valor2`: \<uint | int\>

source: Tests if `value1` is greater than `value2`. `message` is returned in case of failure.
es: Prueba si `valor1` es mayor que `valor2`. Se devuelve `mensaje` en caso de fallo.

source: Assert.lesserThan(value1, value2[, message])
es: Assert.menosque(valor1, valor2[, mensaje])

source: Tests if `value1` is lesser than `value2`. `message` is returned in case of failure.
es: Comprueba si `valor1` es menor que `valor2`. Se devuelve `mensaje` en caso de fallo.
