Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/compile.po
Languages: es, fr, it, zh_cn

source: Solidity Compiler
es: Compilador Solidity
fr: Compilateur Solidity
it: Compilatore Solidity
zh_cn: Solidity 编译器

source: Clicking the Solidity icon in the icon panel brings you to the Solidity Compiler. The default view of the Solidity Compiler shows the basic configuration. To open the Advanced Configuration panel, click the **Advanced Configuration** button (**C. in fig. 1**). For details on advanced features - see below.
es: Si hace clic en el icono Solidity del panel de iconos, accederá al Compilador de Solidity. La vista predeterminada del Compilador de Solidity muestra la configuración básica. Para abrir el panel de configuración avanzada, haga clic en el botón **Configuración avanzada** (**C. en fig. 1**). Para obtener más información sobre las funciones avanzadas, consulte a continuación.
fr: En cliquant sur l'icône Solidity dans le panneau d'icônes, vous accédez au Compilateur Solidity. La vue par défaut du Compilateur Solidity montre la configuration de base. Pour ouvrir le panneau de configuration avancée, cliquez sur le bouton **Configuration avancée** (**C. dans la fig. 1**). Pour plus de détails sur les fonctions avancées, voir ci-dessous.
it: Cliccando sull'icona Solidity nel pannello delle icone, si accede al compilatore Solidity. La vista predefinita del compilatore Solidity mostra la configurazione di base. Per aprire il pannello diella configurazione avanzata, fare clic sul pulsante **Advanced Configuration** (Configurazione avanzata) (**C. nella figura 1**). Per i dettagli sulle funzioni avanzate, vedere di seguito.
zh_cn: 点击图标面板中的 Solidity 图标即可进入Solidity 编译器界面。界面中默认展示编译器的基础配置项。点击**高级配置**按钮即可打开高级配置面板 (**见图1中的C.**)。有关高级特性的详情，请看下文。

source: Solidity Compiler Basics
es: Conceptos básicos del compilador Solidity
fr: Les bases du compilateur Solidity
it: Nozioni di base del compilatore Solidity
zh_cn: Solidity 编译器基础

source: Selecting a contract to compile
es: Seleccionar un contrato para compilar
fr: Sélection d'un contrat à compiler
it: Selezione di un contratto da compilare
zh_cn: 选择一个合约进行编译

source: To select a contract to compile, choose a file in the File Explorer. Or if there are several files open, make sure the one you want to compile is the active file in the Editor.
es: Para seleccionar un contrato para compilar, elija un archivo en el Explorador de archivos. O si hay varios archivos abiertos, asegúrese de que el que desea compilar es el archivo activo en el Editor.
fr: Pour sélectionner un contrat à compiler, choisissez un fichier dans l'explorateur de fichiers. Ou, si plusieurs fichiers sont ouverts, assurez-vous que celui que vous souhaitez compiler est le fichier actif dans l'éditeur.
it: Per selezionare un contratto da compilare, scegliere un file nell'Esplora File. Oppure, se ci sono più file aperti, assicurarsi che quello che si desidera compilare sia il file attivo nell'Editor.
zh_cn: 在文件管理器中打开一个文件即可进行编译。如果打开了多个文件，请确保你想编译的文件在编辑器中处于选中状态。

source: If there is not an active file in the editor or a file has not already been compiled, then the Solidity compiler will look like this:
es: Si no hay ningún archivo activo en el editor o aún no se ha compilado ningún archivo, el compilador de Solidity tendrá el siguiente aspecto:
fr: S'il n'y a pas de fichier actif dans l'éditeur ou si un fichier n'a pas encore été compilé, le compilateur Solidity ressemblera à ceci :
it: Se non c'è un file attivo nell'editor o se un file non è già stato compilato, il compilatore Solidity somiglierà a questo:
zh_cn: 如果编辑器中没有打开的文件，或者没有已编译的文件，那么 Solidity 编译器看起来会是这个样子：

source: Triggering compilation
es: Compilación desencadenante
fr: Déclenchement de la compilation
it: Avvio della compilazione
zh_cn: 触发编译

source: Compiling is triggered when you:
es: La compilación se activa cuando:
fr: La compilation est déclenchée lorsque vous :
it: La compilazione viene attivata quando si:
zh_cn: 当你这么做的时候会触发编译：

source: click the compile button (**D. in fig. 1 below**)
es: pulse el botón de compilación (**D. en la fig. 1 de abajo**)
fr: cliquez sur le bouton de compilation (**D. dans la fig. 1 ci-dessous**)
it: clicca sul pulsante di compilazione (**D. nella figura 1 qui sotto**)
zh_cn: 点击编译按钮 (**下面图1中的D.**)

source: use the shortcut `control + s`.
es: utilice el atajo `control + s`.
fr: utilisez le raccourci `contrôle + s`.
it: usa il comando rapido `control + s`.
zh_cn: 使用快捷键 `control + s`.

source: right click on a file in the File Explorer and selecting **Compile** option
es: Haga clic con el botón derecho del ratón sobre un archivo en el Explorador de archivos y seleccione la opción **Compilar**.
fr: cliquez avec le bouton droit de la souris sur un fichier dans l'explorateur de fichiers et sélectionnez l'option **Compiler**.
it: clicca con il tasto destro del mouse su un file in Esplora File e seleziona l'opzione **Compile** (Compila)

source: Auto Compile
es: Compilación automática
fr: Compilation automatique
it: Compilazione automatica
zh_cn: 自动编译

source: If the auto compile checkbox (**B. in fig. 1 above**) is checked, compiliation will occur every few seconds (when the file is auto-saved) as well as when another file is selected. If a contract has a lot of dependencies, it can take a while to compile - so you use autocompilation at your discretion.
es: Si la casilla de autocompilación (**B. en la fig. 1 anterior**) está marcada, la compilación se producirá cada pocos segundos (cuando se autoguarde el archivo), así como cuando se seleccione otro archivo. Si un contrato tiene muchas dependencias, puede tardar un tiempo en compilarse, así que utilice la autocompilación a su discreción.
fr: Si la case de compilation automatique (**B. dans la figure 1 ci-dessus**) est cochée, la compilation aura lieu toutes les quelques secondes (lorsque le fichier est sauvegardé automatiquement) ainsi que lorsqu'un autre fichier est sélectionné. Si un contrat comporte de nombreuses dépendances, la compilation peut prendre un certain temps - c'est pourquoi vous pouvez utiliser la compilation automatique à votre discrétion.
it: Se la casella di controllo della compilazione automatica (**B. nella figura 1 qui sopra**) è selezionata, la compilazione avverrà ogni pochi secondi (quando il file viene salvato automaticamente) comsì come quando viene selezionato un altro file. Se un contratto ha molte dipendenze, può richiedere un po' di tempo per essere compilato, quindi l'uso della compilazione automatica è a vostra discrezione.

source: Solidity versions & Remix functionality
es: Versiones de solidez y funcionalidad Remix
fr: Versions de Solidity et fonctionnalité Remix
it: Versioni Solidity e funzionalità di Remix
zh_cn: Solidity 版本 & Remix 功能

source: The compiler version is selected in the **COMPILER** dropdown list (**A. in fig. 1 above**).
es: La versión del compilador se selecciona en la lista desplegable **COMPILADOR** (**A. en la fig. 1 anterior**).
fr: La version du compilateur est sélectionnée dans la liste déroulante **COMPILATEUR** (**A. dans la fig. 1 ci-dessus**).
it: La versione del compilatore viene selezionata nell'elenco a discesa **COMPILER** (COMPILATORE) (**A. nella figura 1 qui sopra**).
zh_cn: **编译器**下拉列表中已经选中了一个编译器版本(**见上图1中的A.**)。

source: You can compile (and deploy) contracts with versions of Solidity **older than 0.4.12**. However, the older compilers use a legacy AST — which we no longer support. Consequently, some plugins may not work and some functionality - e.g. source highlighting in the Editor may only be partially working.
es: Puede compilar (e implantar) contratos con versiones de Solidity **anteriores a la 0.4.12**. Sin embargo, los compiladores más antiguos utilizan un AST heredado, que ya no soportamos. En consecuencia, es posible que algunos plugins no funcionen y que algunas funcionalidades - por ejemplo, el resaltado de código fuente en el Editor - sólo funcionen parcialmente.
fr: Vous pouvez compiler (et déployer) des contrats avec des versions de Solidity **antérieures à 0.4.12**. Cependant, les anciens compilateurs utilisent un AST hérité - que nous ne supportons plus. Par conséquent, certains plugins peuvent ne pas fonctionner et certaines fonctionnalités - par exemple la mise en évidence des sources dans l'éditeur - peuvent ne fonctionner que partiellement.
it: È possibile compilare (e distribuire) i contratti con versioni di Solidity **più vecchie della 0.4.12**. Tuttavia, i compilatori più vecchi utilizzano una legacy AST, che non supportiamo più. Di conseguenza, alcuni plugin potrebbero non funzionare e alcune funzionalità - come l'evidenziazione della sorgente nell'editor, potrebbero funzionare solo parzialmente.
zh_cn: 您可以编译(且部署)**比 0.4.12 更老**的 Solidity 版本的合约。但是这些更老的编译器使用了传统的抽象语法树 — 我们已经不再支持。因此，有些插件可能无法使用，有些功能 — 比如编辑器语法高亮可能只有部分还能工作。

source: Using the Contract select box
es: Utilizar la casilla de selección Contrato
fr: Utiliser la boîte de sélection Contrat
it: Utilizzo della casella di selezione del contratto
zh_cn: 使用合约选项框

source: Because a Solidity file can include multiple contracts and because contracts can import other contracts, multiple contracts are often compiled. **However**, only 1 contract's compilation details can be retrieved at a time.
es: Dado que un archivo Solidity puede incluir varios contratos y que los contratos pueden importar otros contratos, a menudo se compilan varios contratos. **Sin embargo**, sólo se pueden recuperar los detalles de compilación de 1 contrato a la vez.
fr: Comme un fichier Solidity peut inclure plusieurs contrats et comme les contrats peuvent importer d'autres contrats, plusieurs contrats sont souvent compilés. **Cependant, les détails de la compilation d'un seul contrat peuvent être récupérés à la fois.
it: Poiché un file Solidity può includere più contratti e poiché i contratti possono importare altri contratti, spesso vengono compilati più contratti. **Tuttavia, è possibile recuperare solo i dettagli di compilazione di un contratto per volta.
zh_cn: 因为一个 Solidity 文件可以包含多个合约，且合约也可以引用其他合约，所以多个合约经常会被同时编译。**但是**，一次只能获取一个合约的编译结果。

source: To select the desired contract, use the **Contract** select box (**F. in fig. 1**). Forgetting to select the right contract is a common mistake - so remember to verify that the contract you want is selected.
es: Para seleccionar el contrato deseado, utilice la casilla de selección **Contrato** (**F. en fig. 1**). Olvidarse de seleccionar el contrato correcto es un error frecuente, por lo que no olvide verificar que el contrato que desea está seleccionado.
fr: Pour sélectionner le contrat souhaité, utilisez la boîte de sélection **Contrat** (**F. dans la fig. 1**). Oublier de sélectionner le bon contrat est une erreur fréquente - n'oubliez donc pas de vérifier que le contrat que vous souhaitez est sélectionné.
it: Per selezionare il contratto desiderato, utilizzare la casella di selezione **Contract** (Contratto) (**F. nella fig. 1**). Dimenticare di selezionare il contratto giusto è un errore comune - quindi ricordarti di verificare che sia selezionato il contratto desiderato.
zh_cn: 在合约选项框中(**见图1中的F.**) 可以选择你想要的合约。忘记选择正确的合约是一种常见的错误 - 所以记得确认下您确实选中了您想要的那个合约。

source: Compilation Details and Publishing
es: Detalles de la compilación y publicación
fr: Détails de la compilation et publication
it: Dettagli della compilazione e pubblicazione
zh_cn: 编译细节和发布

source: Using the publish button, you can upload your contract to **IPFS** or **Swarm** (only non abstract contracts can be published to Swarm).
es: Utilizando el botón publicar, puede subir su contrato a **IPFS** o **Swarm** (sólo los contratos no abstractos pueden publicarse en Swarm).
fr: En cliquant sur le bouton "Publier", vous pouvez télécharger votre contrat vers **IPFS** ou **Swarm** (seuls les contrats non abstraits peuvent être publiés sur Swarm).
it: Utilizzando il pulsante pubblica, è possibile caricare il contratto su **IPFS** o **Swarm** (solo i contratti non astratti possono essere pubblicati su Swarm).
zh_cn: 使用发布按钮，您可以将您的合约上传到 **IPFS** 或者 **Swarm** (只有非抽象合约可以发布到 Swarm)。

source: When publishing a contract that imports other contracts, the main contract and all of its imported contracts will be published - each to their own address.
es: Al publicar un contrato que importa otros contratos, se publicarán el contrato principal y todos sus contratos importados, cada uno a su propia dirección.
fr: Lorsque vous publiez un contrat qui importe d'autres contrats, le contrat principal et tous les contrats importés sont publiés - chacun à sa propre adresse.
it: Quando si pubblica un contratto che importa altri contratti, il contratto principale e tutti i contratti importati vengono pubblicati - ciascuno al proprio indirizzo.
zh_cn: 当发布一个引用了其他合约的合约时，主合约和所有引用合约都会被发布 - 每一个都会有对应的地址。

source: **Published data contains the contract's metadata and the solidity source code.**
es: **Los datos publicados contienen los metadatos del contrato y el código fuente de solidity.**
fr: **Les données publiées contiennent les métadonnées du contrat et le code source de Solidity.
it: **I dati pubblicati contengono i metadati del contratto e il codice sorgente di Solidity.**
zh_cn: **发布的数据包含合约的元数据和 solidity 源码。**

source: After either **Publish on IPFS** or **Publish on Swarm** is clicked a modal will pop up. This modal contains the contract's address as well as the addreses of the contracts that it imported and the address of the contract's **metadata**.
es: Después de hacer clic en **Publicar en IPFS** o **Publicar en Swarm** aparecerá un modal. Este modal contiene la dirección del contrato, así como las direcciones de los contratos que importó y la dirección de los **metadatos** del contrato.
fr: Après avoir cliqué sur **Publish on IPFS** ou **Publish on Swarm**, une fenêtre modale s'ouvre. Cette fenêtre contient l'adresse du contrat ainsi que les adresses des contrats importés et l'adresse des **métadonnées** du contrat.
it: Dopo aver cliccato su **Publish on IPFS** (Pubblica su IPFS) o **Publish on Swarm** (Pubblica su Swarm), apparirà una finestra di dialogo. Questa finestra contiene l'indirizzo del contratto, così come gli indirizzi dei contratti importati e l'indirizzo dei **metadati** del contratto.

source: When the "Compilation Details" button is clicked (**G. in fig. 1**), a modal opens displaying detailed information about the current selected contract.
es: Cuando se pulsa el botón "Detalles de la compilación" (**G. en fig. 1**), se abre un modal que muestra información detallada sobre el contrato seleccionado en ese momento.
fr: Lorsque vous cliquez sur le bouton "Détails de la compilation" (**G. dans la fig. 1**), une fenêtre modale s'ouvre et affiche des informations détaillées sur le contrat sélectionné.
it: Cliccando sul pulsante "Compilation Details" (Dettagli di compilazione) (**G. nella fig. 1**), si apre una finestra che mostra informazioni dettagliate sul contratto corrente selezionato.
zh_cn: 点击 "Compilation Details" 按钮 (**见图1中的G.**)，会弹出一个对话框展示包含当前选中合约详情信息。

source: If you just want to get the **ABI** or the **Bytecode** - click the appropriate button see **H. in fig. 1**.
es: Si sólo desea obtener el **ABI** o el **Bytecode** - pulse el botón correspondiente véase **H. en la fig. 1**.
fr: Si vous souhaitez simplement obtenir l'**ABI** ou le **Bytecode** - cliquez sur le bouton approprié voir **H. dans la fig. 1**.
it: Se si desidera ottenere solo l'**ABI** o il **Bytecode**, cliccare sul pulsante appropriato, vedere **H. nella fig. 1**.
zh_cn: 如果你只想获取 **ABI** 或 **Bytecode** - 点击对应的按钮即可。**见图1中的H.** 。

source: Passive Contract Verification
es: Verificación pasiva de contratos
fr: Vérification passive des contrats
it: Verifica passiva del contratto
zh_cn: 被动合约验证

source: When you publish your metadata to IPFS and deploy your code to the mainnet or a public testnet, the contract verification service **[Sourcify](https://sourcify.dev/)**, will verifiy your contracts without you needing to do anything.
es: Cuando publique sus metadatos en IPFS y despliegue su código en la red principal o en una red de pruebas pública, el servicio de verificación de contratos **[Sourcify](https://sourcify.dev/)**, verificará sus contratos sin que usted tenga que hacer nada.
fr: Lorsque vous publiez vos métadonnées sur IPFS et que vous déployez votre code sur le réseau principal ou sur un réseau de test public, le service de vérification des contrats **[Sourcify](https://sourcify.dev/)**, vérifiera vos contrats sans que vous ayez à faire quoi que ce soit.
it: Quando pubblicate i vostri metadati su IPFS e distribuite il vostro codice sulla rete principale (mainnet) o su una rete di test pubblica, il servizio di verifica dei contratti **[Sourcify](https://sourcify.dev/)**, verificherà i vostri contratti senza che voi dobbiate fare nulla.

source: Compile and Run script
es: Compilar y ejecutar el script
fr: Compiler et exécuter le script
it: Compilazione ed esecuzione dello script
zh_cn: 编译且执行脚本

source: The Compile and Run script button (**E. in fig. 1**) is for compiling and then immediately running a script. It's a time saver so that you can write some code, automatically run script that sets state of the contract - thus allowing you to quickly understand how the code is working. ([more about Compile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
es: El botón Compilar y ejecutar script (**E. en fig. 1**) sirve para compilar y luego ejecutar inmediatamente un script. Es un ahorro de tiempo para que pueda escribir algo de código, ejecutar automáticamente el script que establece el estado del contrato - lo que le permite comprender rápidamente cómo está funcionando el código. ([más sobre Compilar y Ejecutar](running_js_scripts.html?#compilar-un-contrato-y-ejecutar-un-script-en-la-marcha))
fr: Le bouton Compiler et exécuter le script (**E. dans la fig. 1**) permet de compiler et d'exécuter immédiatement un script. C'est un gain de temps qui vous permet d'écrire du code et d'exécuter automatiquement le script qui définit l'état du contrat, ce qui vous permet de comprendre rapidement le fonctionnement du code. ([en savoir plus sur Compile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
it: Il pulsante Compile and Run script (compila ed avvia lo script) (**E. nella figura 1**) serve per compilare e poi eseguire immediatamente uno script. Si tratta di un "risparmia tempo" che consente di scrivere del codice e di eseguire automaticamente lo script che imposta lo stato del contratto, consentendo così di capire rapidamente come funziona il codice. ([maggiori informazioni su Compile & Run](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))
zh_cn: 点击编译且执行脚本按钮 (**见图1中的E.**) 会编译且立即执行一个脚本。这是一个节省时间的方式，以便您编写一些代码并且自动执行脚本去设置合约状态 - 从而您可以快速理解代码是怎么工作的。([更多关于编译且执行脚本](running_js_scripts.html?#compile-a-contract-and-run-a-script-on-the-fly))

source: Compilation Errors and Warning
es: Errores de compilación y advertencias
fr: Erreurs de compilation et avertissements
it: Errori di compilazione e avvertimenti
zh_cn: 编译错误和警告

source: Compilation Errors and Warning are displayed below the contract section. At each compilation, the static analysis tab builds a report.
es: Los errores de compilación y las advertencias aparecen debajo de la sección de contratos. En cada compilación, la pestaña de análisis estático elabora un informe.
fr: Les erreurs de compilation et les avertissements sont affichés sous la section du contrat. À chaque compilation, l'onglet d'analyse statique établit un rapport.
it: Gli errori di compilazione e gli avvertimento sono visualizzati sotto la sezione del contratto. Ad ogni compilazione, la scheda di analisi statica crea un rapporto.
zh_cn: 编译错误和警告展示在合约区域的下方。每次编译，静态分析选项卡都会生成一份报告。

source: It is important to address reported issues even if the compiler doesn't complain. ([more about static analysis](static_analysis.html))
es: Es importante solucionar los problemas notificados aunque el compilador no se queje. ([más información sobre el análisis estático](static_analysis.html))
fr: Il est important de traiter les problèmes signalés, même si le compilateur ne s'en plaint pas. ([en savoir plus sur l'analyse statique](static_analysis.html))
it: È importante risolvere i problemi segnalati anche se il compilatore non si lamenta. ([approfondimenti sull'analisi statica](static_analysis.html))
zh_cn: 解决报告中的问题很重要，即使编译器并没有抱怨。([更多关于静态分析](static_analysis.html))

source: Advanced Compiler Configurations
es: Configuraciones avanzadas del compilador
fr: Configurations avancées du compilateur
it: Configurazioni avanzate del compilatore
zh_cn: 高级编译配置

source: Clicking on Advanced Compiler Configurations will open this panel (**M. in fig. 2 below**).
es: Al hacer clic en Configuraciones avanzadas del compilador se abrirá este panel (**M. en la fig. 2 siguiente**).
fr: Cliquez sur Configurations avancées du compilateur pour ouvrir ce panneau (**M. dans la fig. 2 ci-dessous**).
it: Cliccando su Configurazioni avanzate del compilatore si apre questo pannello (**M. nella figura 2 qui sotto**).
zh_cn: 点击高级编译配置会打开如下面板 (**见下图2中的M.**)。

source: There is a radio button to choose whether to configure the compiler through the interface (**N. in fig 2**) or to use a JSON file for the cofiguration (**R. in fig 2**).
es: Hay un botón de opción para elegir si desea configurar el compilador a través de la interfaz (**N. en la fig. 2**) o utilizar un archivo JSON para la cofiguración (**R. en la fig. 2**).
fr: Un bouton radio vous permet de choisir de configurer le compilateur via l'interface (**N. dans la fig. 2**) ou d'utiliser un fichier JSON pour la configuration (**R. dans la fig. 2**).
it: C'è un pulsante di opzione per scegliere se configurare il compilatore attraverso l'interfaccia (**N. nella figura 2**) o se usare un file JSON per la configurazione (**R. nella figura 2**).

source: Solidity or YUL
es: Solidez o YUL
fr: Solidité ou YUL
it: Solidity o YUL
zh_cn: Solidity 或 YUL

source: Since the Solidity version `0.5.7`, it is possible to compile `Yul` files. Please read the ([solidity documentation about Yul](https://docs.soliditylang.org/en/latest/yul.html)) which contain some code examples. You can use the language dropdown (**O. in fig 2**) to switch the language. **This dropdown list is only available for versions greater than or equal to `0.5.7`.**
es: Desde la versión `0.5.7` de Solidity, es posible compilar archivos `Yul`. Por favor, lea la ([documentación de Solidity sobre Yul](https://docs.soliditylang.org/en/latest/yul.html)) que contiene algunos ejemplos de código. Puede utilizar el desplegable de idioma (**O. en fig 2**) para cambiar de idioma. **Esta lista desplegable sólo está disponible para versiones superiores o iguales a `0.5.7`.**
fr: Depuis la version `0.5.7` de Solidity, il est possible de compiler des fichiers `Yul`. Veuillez lire la ([documentation de Solidity sur Yul](https://docs.soliditylang.org/en/latest/yul.html)) qui contient des exemples de code. Vous pouvez utiliser la liste déroulante des langues (**O. dans la fig 2**) pour changer de langue. **Cette liste déroulante n'est disponible que pour les versions supérieures ou égales à `0.5.7`.
it: Dalla versione `0.5.7' di Solidity, è possibile compilare file in `Yul'. Si prega di leggere la ([documentazione di Solidity su Yul](https://docs.soliditylang.org/en/latest/yul.html)) che contiene alcuni esempi di codice. È possibile utilizzare il menu a tendina per selezionare la lingua (**O. nella figura 2**) per cambiare la lingua. **Questo elenco a discesa è disponibile solo per le versioni maggiori o uguali a `0.5.7`.**
zh_cn: 自 Solidity `0.5.7` 版本后就可以编译 `Yul` 文件。请阅读([solidity 文档中关于 Yul 的内容](https://docs.soliditylang.org/en/latest/yul.html))，里面包含了代码示例。您可以在语言下拉框 (**见图2中的O.**) 中切换语言。**Yul 选项只对大于等于 `0.5.7` 版本的编译器有效。**
