Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/compile.po
Languages: es, fr, it, zh_cn

source: Select an EVM version
es: Seleccione una versión de EVM
fr: Sélectionnez une version de l'EVM
it: Selezionare una versione della EVM
zh_cn: 选择 EVM 版本

source: The EVM dropdown list (**P. in fig 2**) allows to compile code against a specific **Ethereum hard fork**. The `compiler default` corresponds to the default hard fork used by a specific version.
es: La lista desplegable EVM (**P. en fig 2**) permite compilar código contra un **hard fork de Ethereum** específico. El `compilador por defecto` corresponde al hard fork por defecto utilizado por una versión específica.
fr: La liste déroulante EVM (**P. dans la fig 2**) permet de compiler le code contre une **fourche dure d'Ethereum** spécifique. Le `compiler default` correspond au hard fork par défaut utilisé par une version spécifique.
it: L'elenco a discesa della EVM (**P. nella fig. 2**) consente di compilare il codice rispetto a una specifica **biforcazione di Ethereum**. Il "compiler default" (compilazione predefinita) corrisponde all'hard fork predefinito utilizzato da una versione specifica.
zh_cn: EVM 下拉选框 (**图2中的P.**) 可以让您对特定的**以太坊硬分叉**版本进行编译。`compiler default`对应使用默认硬分叉版本作为给定版本。

source: To see the name of the hard fork used in the current compilation, click the "Compilation Details" button and in the `Metadata` section there will be a sub-section called **settings**. Open up the **settings** to see the EVM version's name.
es: Para ver el nombre de la bifurcación dura utilizada en la compilación actual, pulse el botón "Detalles de la compilación" y en la sección `Metadatos` habrá una subsección llamada **configuración**. Abra la **configuración** para ver el nombre de la versión de EVM.
fr: Pour voir le nom du hard fork utilisé dans la compilation actuelle, cliquez sur le bouton "Compilation Details" et dans la section `Metadata` il y aura une sous-section appelée **settings**. Ouvrez les **réglages** pour voir le nom de la version de l'EVM.
it: Per vedere il nome dell'hard fork usato nella compilazione corrente, cliccare sul pulsante "Compilation Details" (dettagli di compilazione) e nella sezione "Metadata" ci sarà una sottosezione chiamata **settings** (impostazioni). Aprire le **impostazioni** per vedere il nome della versione EVM.
zh_cn: 查看当前编译结果中使用的硬分叉名，可点击 "Compilation Details" 按钮，在 `Metadata` 章节下有一个叫 **settings** 的子章节，打开 **settings** 章节就可以看到 EVM 版本名称。

source: Enable optimization
es: Activar la optimización
fr: Activer l'optimisation
it: Abilita l'ottimizzazione
zh_cn: 启用优化

source: According to the Solidity Docs, "the optimizer tries to simplify complicated expressions, which reduces both code size and execution cost, i.e., it can reduce gas needed for contract deployment as well as for external calls made to the contract."
es: Según la documentación de Solidity, "el optimizador intenta simplificar las expresiones complicadas, lo que reduce tanto el tamaño del código como el coste de ejecución, es decir, puede reducir el gas necesario para la implementación del contrato, así como para las llamadas externas realizadas al contrato."
fr: Selon la documentation de Solidity, "l'optimiseur tente de simplifier les expressions compliquées, ce qui réduit à la fois la taille du code et le coût d'exécution, c'est-à-dire qu'il peut réduire le gaz nécessaire au déploiement du contrat ainsi qu'aux appels externes faits au contrat".
it: Secondo i documenti di Solidity, "l'ottimizzatore cerca di semplificare le espressioni complicate, riducendo sia la dimensione del codice che il costo di esecuzione, cioè può ridurre il gas necessario per la distribuzione del contratto così come per le chiamate esterne fatte al contratto."
zh_cn: 根据Solidity的文档，“优化器试图简化复杂的表达式，从而减少代码大小和执行成本，也就是说，它可以减少合约部署所需的gas，以及对该合约进行外部调用所需的gas。”

source: For recent versions of Solidity, it is [recommended to enable optimization](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be) .
es: Para las versiones recientes de Solidity, es [recomendable activar la optimización](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be) .
fr: Pour les versions récentes de Solidity, il est [recommandé d'activer l'optimisation] (https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be).
it: Per le versioni recenti di Solidity, è [consigliato abilitare l'ottimizzazione](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be).

source: To learn more about optimization, (**Q. in the fig 2**) visit the [Solidity docs on the optimizer](https://docs.soliditylang.org/en/latest/internals/optimizer.html).
es: Para obtener más información sobre la optimización, (**Q. en la fig. 2**) visite la [Documentación de Solidity sobre el optimizador](https://docs.soliditylang.org/en/latest/internals/optimizer.html).
fr: Pour en savoir plus sur l'optimisation, (**Q. dans la fig 2**) visitez le [Solidity docs on the optimizer] (https://docs.soliditylang.org/en/latest/internals/optimizer.html).
it: Per saperne di più sull'ottimizzazione (**Q. nella figura 2**), visitate il sito [Documenti Solidity sull'ottimizzatore](https://docs.soliditylang.org/en/latest/internals/optimizer.html).
zh_cn: 想要深入了解优化， (**图2中的Q.**) 可以访问 [Solidity 文档中关于优化器的内容](https://docs.soliditylang.org/en/latest/internals/optimizer.html)。

source: To the right of the **Enable optimization** checkbox is the box to input the number of Optimization runs. The default value is 200.
es: A la derecha de la casilla **Habilitar optimización** se encuentra la casilla para introducir el número de ejecuciones de optimización. El valor por defecto es 200.
fr: À droite de la case à cocher **Activer l'optimisation** se trouve la case permettant de saisir le nombre de cycles d'optimisation. La valeur par défaut est de 200.
it: A destra della casella di controllo **Enable optimization** (Abilita ottimizzazione) si trova la casella per inserire il numero di esecuzioni dell'ottimizzazione. Il valore predefinito è 200.
zh_cn: **启用优化**复选框右边的输入框可以输入优化次数。默认值是200 。

source: You may ask — "What is the right number of runs for my contract?" And the Solidity docs say:
es: Se preguntará: "¿Cuál es el número correcto de ejecuciones para mi contrato?". Y los documentos de Solidity lo dicen:
fr: Vous pouvez vous demander : "Quel est le bon nombre d'exécutions pour mon contrat ?" La documentation de Solidity répond à cette question :
it: Ti potresti chiedere: "Qual è il numero giusto di esecuzioni per il mio contratto?" I documenti Solidity dicono:
zh_cn: 你可能会问 - “对于我的合约来说，正确的次数应该是多少？” Solidity 文档是这么说的：

source: If you want the initial contract deployment to be cheaper and the later function executions to be more expensive, set it to --optimize-runs=1. If you expect many transactions and do not care for higher deployment cost and output size, set --optimize-runs to a high number.
es: Si desea que el despliegue inicial del contrato sea más barato y que las ejecuciones posteriores de la función sean más caras, ajústelo a --optimize-runs=1. Si espera muchas transacciones y no le importa que el coste de despliegue y el tamaño de la salida sean mayores, establezca --optimize-runs en un número alto.
fr: Si vous souhaitez que le déploiement initial du contrat soit moins coûteux et que les exécutions ultérieures de la fonction soient plus coûteuses, définissez --optimize-runs=1. Si vous prévoyez de nombreuses transactions et que vous ne vous souciez pas du coût de déploiement et de la taille de sortie, fixez --optimize-runs à un nombre élevé.
it: Se si vuole che la distribuzione iniziale del contratto sia più economica e che le esecuzioni successive della funzione siano più costose, impostare --optimize-runs=1. Se si prevedono molte transazioni e non ci si preoccupa dei costi di distribuzione e delle dimensioni dell'output, impostare --optimize-runs ad un numero elevato.
zh_cn: 如果你希望部署合约的时候油费便宜一点，且以后执行合约方法更贵一点，你可以设置 --optimize-runs=1 。如果你预料到这个合约以后会有很多交易，且并不在乎高昂的部署费用和输出尺寸，那就设置 --optimize-runs 为一个更高的值。

source: To learn more about the optimization runs, visit the [Solidity docs about Optimizer options](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
es: Para obtener más información sobre las ejecuciones de optimización, visite [Solidity docs about Optimizer options](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
fr: Pour en savoir plus sur les cycles d'optimisation, visitez le site [Solidity docs about Optimizer options] (https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
it: Per saperne di più sull'esecuzione dell'ottimizzazione, visitate [Documenti Solidity sulle opzioni dell'ottimizzatore](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options).
zh_cn: 想了解更多关于优化次数的细节，请访问 [Solidity 文档中关于优化器选项的内容](https://docs.soliditylang.org/en/latest/using-the-compiler.html?highlight=optimize-runs#optimizer-options)。

source: JSON file for Compiler configuration
es: Archivo JSON para la configuración del compilador
fr: Fichier JSON pour la configuration du compilateur
it: Il file JSON per la configurazione del compilatore
zh_cn: JSON 文件的编译器配置

source: Selecting the radio button next to **Use configuration file** will let you set the configuration using a JSON file (**T. in fig 2**). When you switch to **compile with a config file**, a sample compiler config file is created. This file can be edited with all the available options.
es: Si selecciona el botón de opción situado junto a **Utilizar archivo de configuración**, podrá establecer la configuración mediante un archivo JSON (**T. en fig. 2**). Cuando se cambia a **compilar con un archivo de configuración**, se crea un archivo de configuración del compilador de ejemplo. Este archivo puede editarse con todas las opciones disponibles.
fr: En sélectionnant le bouton radio à côté de **Utiliser le fichier de configuration**, vous pourrez définir la configuration à l'aide d'un fichier JSON (**T. dans la fig. 2**). Lorsque vous passez à **compiler avec un fichier de configuration**, un exemple de fichier de configuration du compilateur est créé. Ce fichier peut être édité avec toutes les options disponibles.
it: Selezionando il pulsante di opzione accanto a **Use configuration file** (Usa un file di configurazione) si potrà impostare la configurazione usando un file JSON (**T. nella fig. 2**). Quando si passa a **compile with a config file** (compila con un file di configurazione), viene creato un esempio di file di configurazione del compilatore. Questo file può essere editato con tutte le opzioni disponibili.
zh_cn: 选择**使用配置文件**旁边的单选按钮，您就可以用一个 JSON 文件 (**见图二中的T.**) 来进行配置。当您切换到**使用配置文件进行编译**，一份编译器配置文件示例就会自动生成。这个文件可以编辑所有可用的选项。

source: Clicking the config file's name will open it up in the Editor. To change the config file click the **Change** button. If you update the text box with a file name of a file that does not exist, a new file will be created containing the default file's contents.
es: Al hacer clic en el nombre del archivo de configuración se abrirá en el Editor. Para cambiar el archivo de configuración pulse el botón **Cambiar**. Si actualiza el cuadro de texto con el nombre de un archivo que no existe, se creará un nuevo archivo con el contenido del archivo predeterminado.
fr: Cliquez sur le nom du fichier de configuration pour l'ouvrir dans l'éditeur. Pour modifier le fichier de configuration, cliquez sur le bouton **Modifier**. Si vous mettez à jour la zone de texte avec un nom de fichier qui n'existe pas, un nouveau fichier sera créé avec le contenu du fichier par défaut.
it: Cliccando sul nome del file di configurazione, si aprirà nell'Editor. Per modificare il file di configurazione, cliccare sul pulsante **Change** (Cambia). Se si aggiorna la casella di testo con il nome di un file che non esiste, verrà creato un nuovo file contenente il contenuto del file predefinito.
zh_cn: 点击配置文件名称会在编辑器中打开这个文件。点击**替换**按钮即可替换配置文件。如果你在输入框中输入了一个不存在的文件名称，一个包含了默认文件内容的新文件就会自动生成。

source: There is no error checking when using the .json file for configuration settings, so make sure your config file is correct.
es: No hay comprobación de errores cuando se utiliza el archivo .json para los ajustes de configuración, así que asegúrese de que su archivo de configuración es correcto.
fr: Il n'y a pas de contrôle d'erreur lors de l'utilisation du fichier .json pour les paramètres de configuration, assurez-vous donc que votre fichier de configuration est correct.
it: Non esiste alcun controllo degli errori quando si usa il file .json per le impostazioni di configurazione, quindi assicurarsi che il file di configurazione sia corretto.
zh_cn: 使用 .json 文件配置是不会有错误检测的，所以请确保您的配置文件是正确的。

source: Use a Custom Solidity Compiler
es: Utilizar un compilador de Solidity personalizado
fr: Utiliser un compilateur Solidity personnalisé
it: Utilizzare un compilatore Solidity personalizzato
zh_cn: 使用自定义 Solidity 编译器

source: For those writing your own custom solidity compiler, you can import that by clicking the **+** button (**X. in fig 1**) to open a modal where you can input the url of the compiler to be loaded.
es: Para aquellos que escriban su propio compilador solidity personalizado, pueden importarlo haciendo clic en el botón **+** (**X. en fig 1**) para abrir un modal en el que puede introducir la url del compilador que desea cargar.
fr: Pour ceux qui écrivent leur propre compilateur Solidity, vous pouvez l'importer en cliquant sur le bouton **+** (**X. dans la fig 1**) pour ouvrir une fenêtre modale dans laquelle vous pouvez entrer l'url du compilateur à charger.
it: Per coloro che scrivono il proprio compilatore solidity personalizzato, è possibile importarlo cliccando sul pulsante **+** (**X. nella figura 1**) per aprire una finestra in cui inserire l'url del compilatore da caricare.
zh_cn: 如果想使用自定义编译器，您可以点击 **+** 按钮 (**见图一中的X.**) 打开一个对话框，输入自定义编译器的链接。

source: right click on a file in the File Explorer and select the **Compile** option
zh_cn: 在文件管理器中右键单击文件并选择编译选项

source: If the auto compile checkbox (**B. in fig. 1 above**) is checked, compilation will occur every few seconds (when the file is auto-saved) as well as when another file is selected. If a contract has a lot of dependencies, it can take a while to compile - so you use autocompilation at your discretion.
zh_cn: 如果自动编译复选框被选中 (**见上图1中的B**) ，编译将每隔几秒 (当文件自动保存时) 以及选择另一个文件时进行。 如果合约具有很多依赖项，编译可能需要一些时间，因此您可以自行判断是否需要自动编译。

source: After either **Publish on IPFS** or **Publish on Swarm** is clicked a modal will pop up. This modal contains the contract's address as well as the addresses of the contracts that it imported and the address of the contract's **metadata**.
zh_cn: 点击 **在IPFS上发布** 或 **在Swarm上发布** 按钮后，会弹出一个窗口。这个窗口包含了合约地址和引用的合约的地址，还有合约**元数据**的地址。

source: When you publish your metadata to IPFS and deploy your code to the mainnet or a public testnet, the contract verification service **[Sourcify](https://sourcify.dev/)**, will verify your contracts without you needing to do anything.
zh_cn: 当你把你的元数据发布到 IPFS 并且部署你的代码到主网或公共测试网络，合约验证服务 **[Sourcify](https://sourcify.dev/)** 将会验证你的合约，你将不需做任何事情。

source: There is a radio button to choose whether to configure the compiler through the interface (**N. in fig 2**) or to use a JSON file for the configuration (**R. in fig 2**).
zh_cn: 这里有一个单选按钮可以选择通过交互界面配置编译器 (**见图2中的N**) 还是用JSON 文件进行配置 (**见图2中的R**)。

source: For recent versions of Solidity, it is [recommended to enable optimization](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-think-people-are-generally-suspicious-of-the-optimizer-and-are-they-right-to-be).
zh_cn: 对于最近的Solidity版本，[建议启用优化](https://blog.soliditylang.org/2020/11/04/solidity-ama-1-recap/#why-do-you-thyou-people are generally suspensous-of-the-ye-they-they-to-be).
