Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_tutorials_github.po
Languages: it

source: Remix Github Tutorials
it: Tutorial Remix di Github

source: There are a series of tutorials in our github repo remix-workshops.
it: Ci sono una serie di tutorial nel nostro repository github remix-workshops.

source: We are in the process of upgrading these tutorials to use the new Remix layout.
it: Stiamo in procinto di aggiornare questi tutorial per utilizzare il nuovo layout di Remix.

source: In this repo there tutorials for all levels.
it: In questo repository ci sono tutorial per tutti i livelli.

source: There are tutorials for specific remix functionalities like:
it: Ci sono tutorial per specifiche funzionalit√† di remix come:

source: Deploying
it: Distribuire

source: Testing
it: Testare

source: Remix Plugin Development
it: Sviluppo di plugin Remix

source: Other
it: Altro

source: Additional external workshops
it: Workshop esterni aggiuntivi
