Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/remix_*_code_viewer.po
Languages: es, fr, it, zh_cn

source: Remix as code viewer
es: Remix como visor de código
fr: Remix comme visualiseur de code
it: Remix come visualizzatore di codice
zh_cn: 将Remix作为代码查看器

source: Through Etherscan
es: A través de Etherscan
fr: Grâce à l'Etherscan
it: Attraverso Etherscan
zh_cn: 通过 Etherscan

source: Verified contracts on Etherscan can be viewed in Remix by making a simple change to the URL. Mostly for a mutiple part contract verification, Remix provides a quick way to load all the contracts.
es: Los contratos verificados en Etherscan pueden ser vistos en Remix haciendo un simple cambio en la URL. Principalmente para una verificación de contratos de múltiples partes, Remix proporciona una forma rápida de cargar todos los contratos.
fr: Les contrats vérifiés sur Etherscan peuvent être visualisés dans Remix en modifiant simplement l'URL. Remix est un moyen rapide de charger tous les contrats, surtout dans le cas d'une vérification d'un contrat à plusieurs parties.
it: I contratti verificati su Etherscan possono essere visualizzati in Remix facendo una semplice modifica dell'URL. Soprattutto per la verifica di contratti in più parti, Remix fornisce un modo veloce per caricare tutti i contratti.
zh_cn: 在Etherscan上验证的合约可以通过对URL进行简单更改在Remix中查看。对于大部分合约验证，Remix提供了一种快速加载所有合约的方法。

source: A typical Etherscan URL for a contract address looks like this:
es: Una URL típica de Etherscan para una dirección de contrato tiene este aspecto:
fr: Une URL Etherscan typique pour une adresse de contrat ressemble à ceci :
it: Un tipico URL di Etherscan per un indirizzo di contratto si presenta così:
zh_cn: 合约地址的典型 Etherscan URL如下所示：

source: In the URL, change `etherscan.io` to `remix.ethereum.org`
es: En la URL, cambie `etherscan.io` por `remix.ethereum.org`.
fr: Dans l'URL, remplacez `etherscan.io` par `remix.ethereum.org`
it: Nell'URL, cambiare `etherscan.io` con `remix.ethereum.org`
zh_cn: 在URL中，将`etherscan.io`更改为`remix.ethereum.org`

source: and reload. It will fetch the contracts verified on Etherscan.
es: y vuelva a cargar. Obtendrá los contratos verificados en Etherscan.
fr: et rechargez. Il récupérera les contrats vérifiés sur Etherscan.
it: e ricaricare. Verranno recuperati i contratti verificati su Etherscan.
zh_cn: 并重新加载。它将获取在Etherscan上验证的合同。

source: Contracts verified on Ethereum mainnnet and on other test networks (Ropsten, Rinkeby, Kovan & Goerli) will be loaded in respective directories under `etherscan-code-sample` workspace.
es: Los contratos verificados en la red principal de Ethereum y en otras redes de prueba (Ropsten, Rinkeby, Kovan & Goerli) se cargarán en los directorios respectivos bajo el espacio de trabajo `etherscan-code-sample`.
fr: Les contrats vérifiés sur le réseau principal Ethereum et sur d'autres réseaux de test (Ropsten, Rinkeby, Kovan & Goerli) seront chargés dans les répertoires respectifs sous l'espace de travail `etherscan-code-sample`.
it: I contratti verificati sulla rete principale di Ethereum e sulle altre reti di test (Ropsten, Rinkeby, Kovan e Goerli) saranno caricati nelle rispettive directory sotto l'area di lavoro `etherscan-code-sample`.

source: This works for Etherscan testnet URLs `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` etc. If they are similarly updated, contracts will be loaded in Remix.
es: This funciona para Etherscan testnet URLs `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` etc. Si se actualizan de forma similar, los contratos se cargarán en Remix.
fr: Cela fonctionne pour les URLs Etherscan testnet `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` etc. Si elles sont mises à jour de manière similaire, les contrats seront chargés dans Remix.
it: Questo funziona per gli URL delle reti di test di Etherscan `https://ropsten.etherscan.io`, `https://goerli.etherscan.io/` etc. Se sono aggiornati nello stesso modo, i contratti saranno caricati in Remix.
zh_cn: 这适用于Etherscan测试网址 `https://ropsten.etherscan.io`，`https://goerli.etherscan.io/`等。如果它们被更新，则合约将在Remix中加载。

source: Through GitHub
es: A través de GitHub
fr: Par l'intermédiaire de GitHub
it: Attraverso GitHub
zh_cn: 通过 GitHub

source: Solidity files in GitHub can be loaded on Remix with a similar tweak. For a file with URL like:
es: Los archivos Solidity en GitHub pueden cargarse en Remix con un ajuste similar. Para un archivo con URL como:
fr: Les fichiers Solidity dans GitHub peuvent être chargés sur Remix avec une modification similaire. Pour un fichier avec une URL comme :
it: I file Solidity in GitHub possono essere caricati su Remix con una modifica simile. Per un file con URL come:
zh_cn: GitHub 上的 Solidity 文件可以通过类似的调整在 Remix 上加载。对于像这样的 URL 文件：

source: change `github.com` to `remix.ethereum.org` like:
es: cambiar `github.com` por `remix.ethereum.org` como:
fr: changez `github.com` en `remix.ethereum.org` comme :
it: cambiare `github.com` in `remix.ethereum.org` come:
zh_cn: 将`github.com`更改为`remix.ethereum.org`，如下所示：

source: and reload. It will open the same file in Remix IDE.
es: y vuelva a cargarlo. Se abrirá el mismo archivo en Remix IDE.
fr: et rechargez. Le même fichier sera ouvert dans Remix IDE.
it: e ricaricare. Si aprirà lo stesso file nell'IDE Remix.
zh_cn: 然后重新加载即可。它将在 Remix IDE 中打开相同的文件。

source: Contracts verified on Ethereum mainnet and on other test networks (Ropsten, Rinkeby, Kovan & Goerli) will be loaded in respective directories under `etherscan-code-sample` workspace.
zh_cn: 在以太坊主网和其他测试网络 (Ropsten、Rinkeby、Kovan和Goerli) 上验证的合约将加载到 `etherscan-code-sample` 工作空间的相应目录下。
