Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/slither.po
Languages: es, fr, it, zh_cn

source: _(Supported since Remix IDE v0.15.0 and Remixd v0.5.0)_
es: _(Compatible desde Remix IDE v0.15.0 y Remixd v0.5.0)_
fr: (Supporté depuis Remix IDE v0.15.0 et Remixd v0.5.0)
it: _(Supportato a partire dalla versione Remix IDE v0.15.0 and Remixd v0.5.0)_
zh_cn: _(自Remix IDE v0.15.0和Remixd v0.5.0起支持)_

source: Remixd and Slither
es: Remixd y Slither
fr: Remixd et Slither
it: Remixd e Slither
zh_cn: Remixd 和 Slither

source: **Note:** If you have not used `remixd` before, read more about it [here](./remixd.html)
es: **Nota:** Si no ha utilizado `remixd` antes, lea más sobre él [here](./remixd.html)
fr: **Note:** Si vous n'avez pas encore utilisé `remixd`, lisez-en plus sur [here](./remixd.html)
it: **Nota:** Se non si è mai usato `remixd` prima d'ora, leggi di più su di esso [qui](./remixd.html)
zh_cn: **注意：** 如果你以前没有使用过`remixd`，请阅读更多关于它的信息 [here](./remixd.html)

source: When [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) module is installed, it also installs [Slither](https://github.com/crytic/slither) and [solc-select](https://github.com/crytic/solc-select#quickstart) and latest version of [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).
es: Cuando se instala el módulo [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd), también se instalan [Slither](https://github.com/crytic/slither) y [solc-select](https://github.com/crytic/solc-select#quickstart) y la última versión de [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).
fr: Lorsque le module [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) est installé, il installe également [Slither](https://github.com/crytic/slither) et [solc-select](https://github.com/crytic/solc-select#quickstart) ainsi que la dernière version de [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).
it: Quando viene installato il modulo [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd), esso installa anche [Slither](https://github.com/crytic/slither) e [solc-select](https://github.com/crytic/solc-select#quickstart) e l'ultima versione di [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).
zh_cn: 安装了 [remixd NPM](https://www.npmjs.com/package/@remix-project/remixd) 模块后，它还会安装 [Slither](https://github.com/crytic/slither)、 [solc-select](https://github.com/crytic/solc-select#quickstart) 和最新版本的 [solc](https://docs.soliditylang.org/en/latest/installing-solidity.html).

source: `Python3.6+ (pip3)` needs to already be installed on the System. In case of any discrepancy, Slither can also be installed along with other dependencies using command `remixd -i slither` _(This packaging of Slither with the remixd module is supported since Remixd `v0.6.3`)_
zh_cn: 系统中需要已安装`Python3.6+ (pip3)`。如果存在任何差异，可以使用命令 `remixd -i slither`_安装 Slither 以及其他依赖项。 (自 Remixd `v0.6.3` 起，通过 remixd 模块打包 Slither 将得到支持)_

source: when `remixd` is running locally on your device, an additional websocket plugin will be listening on port `65523` which will be dedicated for Slither integration. (Supported since Remixd `v0.5.0`)
es: cuando `remixd` se esté ejecutando localmente en su dispositivo, un plugin websocket adicional estará escuchando en el puerto `65523` que estará dedicado para la integración de Slither. (Soportado desde Remixd `v0.5.0`)
fr: lorsque `remixd` est exécuté localement sur votre appareil, un plugin websocket supplémentaire écoutera sur le port `65523` qui sera dédié à l'intégration de Slither. (Supporté depuis Remixd `v0.5.0`)
it: quando `remixd` è in esecuzione localmente sul dispositivo, un plugin websocket aggiuntivo sarà in ascolto sulla porta `65523` che sarà dedicata all'integrazione di Slither. (Supportato a partire da Remixd `v0.5.0`)
zh_cn: 当在本地设备上运行`remixd`时，一个额外的 websocket 插件将监听端口 65523，并专门用于 Slither 集成。（自 Remixd v0.5.0 起支持）

source: The remixd Slither listener is a websocket plugin similar to remixd and is used to perform Slither analysis with Remix IDE.
es: El remixd Slither listener es un plugin websocket similar a remixd y se utiliza para realizar análisis Slither con Remix IDE.
fr: Le Slither listener remixd est un plugin websocket similaire à remixd et est utilisé pour effectuer des analyses Slither avec Remix IDE.
it: Il processo websocket di Slither è un plugin websocket simile a `remixd` e viene usato per eseguire l'analisi Slither con Remix IDE.
zh_cn: remixd 的 Slither 监听器是类似于 remixd 的 websocket 插件，用于在 Remix IDE 中执行 Slither 分析。

source: Enable Slither Analysis
es: Habilitar el análisis de deslizamiento
fr: Activer l'analyse du glissement
it: Abilita Analisi Slither
zh_cn: 启用Slither分析

source: Prerequisites
es: Requisitos previos
fr: Conditions préalables
it: Prerequisiti
zh_cn: 前提条件

source: To use Slither analysis with Remix IDE efficiently, following tools should be installed locally on the system:
es: Para utilizar eficazmente el análisis Slither con el IDE Remix, las siguientes herramientas deben estar instaladas localmente en el sistema:
fr: Pour utiliser efficacement l'analyse Slither avec Remix IDE, les outils suivants doivent être installés localement sur le système :
it: Per utilizzare in modo efficiente l'analisi di Slither con Remix IDE, i seguenti strumenti devono essere installati localmente sul sistema:
zh_cn: 要在Remix IDE中有效地使用Slither分析，必须在系统上本地安装以下工具：

source: **Slither:** [https://github.com/crytic/slither#how-to-install](https://github.com/crytic/slither#how-to-install)
zh_cn: **颤音：** [https://github.com/crytic/slither#how-to-install](https://github.com/crytic/slither#how-to-install)

source: There are setup with [remixd](https://www.npmjs.com/package/@remix-project/remixd) installation or can be done using `remixd -i slither` command.
es: Se configura con la instalación de [remixd](https://www.npmjs.com/package/@remix-project/remixd) o se puede hacer utilizando el comando `remixd -i slither`.
fr: Il est configuré avec l'installation de [remixd](https://www.npmjs.com/package/@remix-project/remixd) ou peut être fait en utilisant la commande `remixd -i slither`.
it: Sono configurati con l'installazione di [remixd](https://www.npmjs.com/package/@remix-project/remixd) o possono essere fatti usando il comando `remixd -i slither`.
zh_cn: 可以通过[remixd](https://www.npmjs.com/package/@remix-project/remixd)安装进行设置，也可以使用`remixd -i slither`命令完成。

source: How to use
es: Cómo utilizarlo
fr: Comment l'utiliser ?
it: Come si usa
zh_cn: 使用方式

source: If a project is shared through remixd and `localhost` workspace is loaded in Remix IDE, there will be an extra checkbox shown in `Solidity Static Analysis` plugin with the label `Enable Slither Analysis`.
es: Si se comparte un proyecto a través de remixd y se carga el espacio de trabajo `localhost` en Remix IDE, aparecerá una casilla de verificación adicional en el plugin `Solidity Static Analysis` con la etiqueta `Enable Slither Analysis`.
fr: Si un projet est partagé via remixd et que l'espace de travail `localhost` est chargé dans Remix IDE, il y aura une case à cocher supplémentaire dans le plugin `Solidity Static Analysis` avec le libellé `Enable Slither Analysis`.
it: Se un progetto è condiviso tramite remixd e l'area di lavoro `localhost` è caricata in Remix IDE, nel plugin `Solidity Static Analysis` (Analisi statica Solidity) sarà visualizzata una casella di controllo aggiuntiva con l'etichetta `Enable Slither Analysis` (Abilita l'Analisi Slither).
zh_cn: 如果项目通过`remixd`共享，并且在Remix IDE中加载了`localhost`工作区，则`Solidity Static Analysis`插件中会显示一个额外的复选框，标签为`Enable Slither Analysis`。

source: There is an info icon on the right side of the label which redirects to a specific section of Remix official documentation that explains how to use Slither Analysis and prerequisites for it.
es: Hay un icono de información a la derecha de la etiqueta que redirige a una sección específica de la documentación oficial de Remix que explica cómo utilizar el Análisis de Slither y los requisitos previos para ello.
fr: Il y a une icône d'information sur le côté droit de l'étiquette qui redirige vers une section spécifique de la documentation officielle de Remix qui explique comment utiliser l'analyse Slither et les conditions préalables.
it: Sul lato destro dell'etichetta c'è un'icona informativa che reindirizza a una sezione specifica della documentazione ufficiale di Remix che spiega come utilizzare l'Analisi Slither e i suoi prerequisiti.
zh_cn: 标签右侧有一个信息图标，可重定向到 Remix 官方文档的特定部分，该部分解释了如何使用 Slither 分析以及其预备知识。

source: One can check the `Enable Slither Analysis` box to run the analysis using Slither along with the Remix's analysis library.
es: Se puede marcar la casilla `Habilitar análisis de Slither` para ejecutar el análisis utilizando Slither junto con la biblioteca de análisis de Remix.
fr: Vous pouvez cocher la case "Activer l'analyse Slither" pour effectuer l'analyse à l'aide de Slither et de la bibliothèque d'analyse de Remix.
it: È possibile selezionare la casella `Enable Slither Analysis` (Abilita l'Analisi Slither) per eseguire l'analisi utilizzando Slither insieme alla libreria di analisi di Remix.
zh_cn: 可以勾选`启用 Slither 分析`框来运行使用 Slither 和 Remix 的分析库进行分析。

source: Latest report of Slither analysis will be stored locally on project root with a file named as `remix-slither-report.json`.
es: El último informe del análisis de Slither se almacenará localmente en la raíz del proyecto con un archivo llamado `remix-slither-report.json`.
fr: Le dernier rapport d'analyse de Slither sera stocké localement à la racine du projet dans un fichier nommé `remix-slither-report.json`.
it: L'ultimo rapporto dell'analisi di Slither sarà memorizzato localmente nella root del progetto con un file nominato `remix-slither-report.json`.
zh_cn: Slither 分析的最新报告将存储在项目根目录下，并命名为 `remix-slither-report.json`。

source: Slither Analysis report will also be displayed on the Remix IDE side after the Remix analysis report for better user readability.
es: El informe de análisis de Slither también se mostrará en el IDE de Remix después del informe de análisis de Remix para una mejor legibilidad por parte del usuario.
fr: Le rapport d'analyse Slither sera également affiché sur le côté de l'IDE Remix après le rapport d'analyse Remix pour une meilleure lisibilité pour l'utilisateur.
it: Il report di analisi di Slither sarà visualizzato anche sul lato IDE di Remix dopo il rapporto di analisi di Remix per una migliore leggibilità dell'utente.
zh_cn: 为了更好地让用户阅读，Remix IDE 侧边栏还会显示 Slither 分析报告和 Remix 分析报告。

source: The result of the analysis will be shown in the Remix IDE terminal
es: El resultado del análisis se mostrará en el terminal Remix IDE
fr: Le résultat de l'analyse sera affiché dans le terminal de l'IDE Remix.
it: Il risultato dell'analisi sarà visualizzato nel terminale dell'IDE Remix
zh_cn: 编译结果将显示在 Remix IDE 终端中。

source: and also in the **remixd** console.
es: y también en la consola **remixd**.
fr: et aussi dans la console **remixd**.
it: e anche nella console **remixd**.
zh_cn: 在 **remixd** 终端中也会显示编译结果。

source: To only run Slither Analysis, deselect `Select all` checkbox and click on `Run`. Now it will show only the Slither Analysis report.
es: Para ejecutar sólo el Análisis de Slither, desmarque la casilla `Seleccionar todo` y haga clic en `Ejecutar`. Ahora sólo se mostrará el informe del Análisis de Slither.
fr: Pour ne lancer que l'analyse Slither, décochez la case "Select all" et cliquez sur "Run". Vous n'obtiendrez alors que le rapport de l'analyse Slither.
it: Per eseguire solo l'Analisi Slither, deselezionare la casella di controllo `Select all` (Seleziona tutto) e cliccare su `Run` (Esegui). Ora verrà visualizzato solo il rapporto di Analisi Slither.
zh_cn: 仅运行Slither分析，请取消`Select all`复选框并单击`Run`。现在它将仅显示Slither分析报告。

source: By default, it doesn't show the warnings for external libraries like remix-tests.sol, hardhat/console.sol etc. To have a look at them, check the box with label `Show warnings for external libraries`.
zh_cn: 默认情况下，Remix不会显示外部库（如remix-tests.sol、hardhat/console.sol等）的警告信息。要查看这些警告信息，请勾选标签为“显示外部库”的复选框。

source: More Details
es: Más detalles
fr: Plus de détails
it: Maggiori Dettagli
zh_cn: 更多详细信息

source: Analysis for Slither is run using the version set in `Solidity Compiler` plugin on Remix IDE. Slither is a CLI tool and requires `solc` to run the analysis. Before running the analysis, Slither websocket plugin checks if current version of solc is same as the version set in Remix IDE.
es: El análisis para Slither se ejecuta utilizando la versión establecida en el plugin `Solidity Compiler` de Remix IDE. Slither es una herramienta CLI y requiere `solc` para ejecutar el análisis. Antes de ejecutar el análisis, el plugin websocket de Slither comprueba si la versión actual de solc es la misma que la versión establecida en Remix IDE.
fr: L'analyse pour Slither est exécutée en utilisant la version définie dans le plugin `Solidity Compiler` sur Remix IDE. Slither est un outil CLI et nécessite `solc` pour exécuter l'analyse. Avant de lancer l'analyse, le plugin websocket de Slither vérifie si la version actuelle de solc est la même que celle définie dans Remix IDE.
it: L'analisi per Slither viene eseguita utilizzando la versione impostata nel plugin `Solidity Compiler` (Compilatore Solidity) dell'IDE Remix. Slither è uno strumento CLI e richiede `solc` per eseguire l'analisi. Prima di eseguire l'analisi, il plugin websocket di Slither controlla se la versione corrente di solc è uguale a quella impostata nell'IDE Remix.
zh_cn: 使用`Solidity Compiler`插件在Remix IDE上设置的版本来运行Slither分析。 Slither是一个CLI工具，需要`solc`才能运行分析。 在运行分析之前，Slither websocket插件会检查当前solc版本是否与Remix IDE中设置的版本相同。

source: If the compiler version set in Solidity Compiler is different from current version of solc installed locally, the Slither websocket plugin will update the `solc` to be the same as the required version `solc-select`.
es: Si la versión del compilador establecida en Solidity Compiler es diferente de la versión actual de solc instalada localmente, el complemento de websocket de Slither actualizará `solc` para que coincida con la versión requerida `solc-select`.
fr: Si la version du compilateur définie dans Solidity Compiler est différente de la version actuelle de solc installée localement, le plugin Slither websocket mettra à jour le `solc` pour qu'il soit identique à la version requise `solc-select`.
it: Se la versione del compilatore impostata in Solidity Compiler è diversa dalla versione corrente di solc installata localmente, il plugin websocket Slither aggiornerà `solc` per essere uguale alla versione `solc-select` richiesta.
zh_cn: 如果Solidity Compiler中设置的编译器版本与本地安装的当前solc版本不同，则Slither websocket插件将更新solc以使其与所需版本的`solc-select`相同。

source: For example, if current `solc` version on the system is 0.8.4 and on the Remix IDE 0.8.6 is set, `remixd` logs explain remote solc version selection
es: Por ejemplo, si la versión actual de `solc` en el sistema es 0.8.4 y en el IDE Remix se establece 0.8.6, `remixd` logs explica la selección de la versión remota de solc
fr: Par exemple, si la version actuelle de `solc` sur le système est 0.8.4 et sur l'IDE Remix 0.8.6, `remixd` explique la sélection de la version de solc à distance.
it: Per esempio, se la versione corrente di `solc` sul sistema è 0.8.4 e sull'IDE Remix è impostata la 0.8.6, i log di `remixd` spiegano la versione remota di solc selezionata
zh_cn: 例如，如果系统上当前的`solc`版本为0.8.4，并且在Remix IDE上设置为`0.8.6`，则remixd日志将解释远程solc版本选择。

source: After successful analysis run:
es: Tras la ejecución satisfactoria del análisis:
fr: Après une analyse réussie :
it: Dopo l'esecuzione dell'analisi avvenuta con successo:
zh_cn: 成功分析运行后：

source: `Python3.6+ (pip3)` needs to already be installed on the System. In case of any discrepany, Slither can also installed along with other dependencies using command `remixd -i slither` _(This packaging of Slither with the remixd module is supported since Remixd `v0.6.3`)_
es: `Python3.6+ (pip3)` necesita estar ya instalado en el Sistema. En caso de discrepancia, Slither también puede instalarse junto con otras dependencias utilizando el comando `remixd -i slither` _(Este empaquetado de Slither con el módulo remixd está soportado desde Remixd `v0.6.3`)_
fr: `Python3.6+ (pip3)` doit être déjà installé sur le système. En cas d'anomalie, Slither peut aussi être installé avec d'autres dépendances en utilisant la commande `remixd -i slither` _(Ce packaging de Slither avec le module remixd est supporté depuis Remixd `v0.6.3`) _.
it: `Python3.6+ (pip3)` deve essere già installato sul sistema. In caso di discrepanze, Slither può essere installato insieme con altre dipendenze usando il comando `remixd -i slither` _(Questo pacchetto di Slither con il modulo remixd è supportato a partire da Remixd `v0.6.3`)_

source: By default, it doesn't show the warnings for external libraries like remix-tests.sol, hardhat/console.sol etc. To have a look on them, check the box with label `Show warnings for external libraries`.
es: Por defecto, no muestra las advertencias para bibliotecas externas como remix-tests.sol, hardhat/console.sol etc. Para echarles un vistazo, marque la casilla con la etiqueta `Mostrar advertencias para bibliotecas externas`.
fr: Par défaut, il n'affiche pas les avertissements pour les bibliothèques externes comme remix-tests.sol, hardhat/console.sol etc. Pour les voir, cochez la case `Afficher les avertissements pour les bibliothèques externes`.
it: Per impostazione predefinita, non mostra gli avvertimenti per le librerie esterne come remix-tests.sol, hardhat/console.sol ecc. Per dargli un'occhiata, selezionare la casella con l'etichetta `Show warnings for external libraries` (Mostrare gli avvertimenti per le librerie esterne).
