Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/static_analysis.po
Languages: es, it, zh_cn

source: Solidity Analyzers
es: Analizadores de solidez
it: Analizzatori di Solidity
zh_cn: 固态分析仪

source: Static code analysis is a process of debugging code by examining it without executing it.
es: El análisis estático del código es un proceso de depuración del código examinándolo sin ejecutarlo.
it: L'analisi statica del codice è un processo di debug del codice che si effettua esaminandolo senza eseguirlo.
zh_cn: 静态代码分析是在不执行代码的情况下通过检查代码进行调试的过程。

source: The `Solidity Analyzers` plugin gangs three analysis tools together to perform static analysis on Solidity smart contracts. Each tool checks for security vulnerabilities and bad development practices, among other issues. It can be activated from Remix `Plugin Manager`.
es: El complemento `Solidity Analyzers` agrupa tres herramientas de análisis para realizar un análisis estático de los contratos inteligentes Solidity. Cada herramienta busca vulnerabilidades de seguridad y malas prácticas de desarrollo, entre otras cuestiones. Puede activarse desde el `Administrador de plugins` de Remix.
it: Il plugin `Analizzatori di Solidity` riunisce tre strumenti di analisi per eseguire analisi statiche sui contratti intelligenti di Solidity. Ogni strumento controlla le vulnerabilità di sicurezza e le procedure di sviluppo scorrette, tra le altre cose. Può essere attivato dal `Gestore dei plugin` di Remix.
zh_cn: Solidity Analyzers "插件将三种分析工具整合在一起，对 Solidity 智能合约进行静态分析。每个工具都会检查安全漏洞和不良开发实践等问题。可从 Remix 的 "插件管理器 "中激活。

source: `Solidity Analyzers` can also be loaded clicking on `Solidity` icon in the featured plugins section of Remix's home tab. This button loads the following plugins: Solidity Compiler, Solidity Unit Testing, and Static Analyzers.
es: También puede cargar `Solidity Analyzers` haciendo clic en el icono `Solidity` de la sección de plugins destacados de la pestaña de inicio de Remix. Este botón carga los siguientes plugins: Solidity Compiler, Solidity Unit Testing y Static Analyzers.
it: `Analizzatori di Solidity' può essere caricato anche cliccando sull'icona `Solidity' nella sezione dei plugin in evidenza della scheda iniziale di Remix. Questo pulsante carica i seguenti plugin: Compilatore di Solidity, Test delle unità di Solidity e Analizzatori Statici.

source: `Solidity Analyzers` uses these tools:
es: `Solidity Analyzers` utiliza estas herramientas:
it: "Analizzatori di Solidity" utilizza questi strumenti:
zh_cn: 固体分析仪 "使用这些工具：

source: [Remix Analysis](#remix-analysis): a basic analysis tool
es: [Análisis de remezclas](#remix-analysis): una herramienta básica de análisis
it: [Analisi di Remix](#remix-analysis): uno strumento di analisi di base
zh_cn: [混音分析](#remix-analysis)：基本分析工具

source: [Solhint linter](https://github.com/protofire/solhint#rules): a Solidity linter for code and style guide validations
es: [Solhint linter](https://github.com/protofire/solhint#rules): un linter de Solidity para validaciones de código y guías de estilo
it: [Solhint linter](https://github.com/protofire/solhint#rules): un linter Solidity per la validazione del codice e della guida di stile
zh_cn: [Solhint linter](https://github.com/protofire/solhint#rules)：用于代码和样式指南验证的 Solidity linter

source: [Slither Static Analysis](https://github.com/crytic/slither#slither-the-solidity-source-analyzer): a comprehensive static analysis tool
es: [Slither Static Analysis](https://github.com/crytic/slither#slither-the-solidity-source-analyzer): una completa herramienta de análisis estático
it: [Slither Static Analysis](https://github.com/crytic/slither#slither-the-solidity-source-analyzer): uno strumento completo di analisi statica
zh_cn: [Slither静态分析](https://github.com/crytic/slither#slither-the-solidity-source-analyzer)：全面的静态分析工具

source: **NOTE:** Slither can only be used when Remix is connected to the local computer's filesystem with [Remixd](remixd.html).
es: **NOTA:** Slither sólo puede utilizarse cuando Remix está conectado al sistema de archivos del ordenador local con [Remixd](remixd.html).
it: **NOTA:** Slither può essere usato solo quando Remix è collegato al filesystem del computer locale con [Remixd](remixd.html).
zh_cn: **注意：** Slither 只能在 Remix 通过 [Remixd]（remix.html）连接到本地计算机文件系统时使用。

source: How to use
es: Cómo utilizarlo
it: Come si usa
zh_cn: 如何使用

source: **A contract must be compiled before analysis can be run.**
es: **Un contrato debe compilarse antes de poder ejecutar el análisis.**
it: **Un contratto deve essere compilato prima di poter eseguire l'analisi.**
zh_cn: **在运行分析之前，必须先编译合同**。

source: At the top of the panel, check the tools that you want to use.
es: En la parte superior del panel, marque las herramientas que desee utilizar.
it: Nella parte superiore del pannello, selezionate gli strumenti che desiderate utilizzare.
zh_cn: 在面板顶部，选中要使用的工具。

source: ![](images/a-ssa-1.png)
es: ![](imágenes/a-ssa-1.png)

source: Errors & Warnings
es: Errores y advertencias
it: Errori & Avvertimenti
zh_cn: 错误和警告

source: By default, `Solidity Analyzers` will show both errors and warnings. The combined number of errors and warnings are shown in the badge in that tools tab.
es: Por defecto, `Solidity Analyzers` mostrará tanto los errores como las advertencias. El número combinado de errores y advertencias se muestra en la insignia de esa pestaña de herramientas.
it: Per impostazione predefinita, `Analizzatori di Solidity` mostra sia gli errori che gli avvertimenti. Il numero combinato di errori e avvertimenti è indicato nel riquadro della scheda Strumenti.
zh_cn: 默认情况下，"Solidity Analyzers "将同时显示错误和警告。 错误和警告的总数显示在该工具选项卡的徽章中。

source: If you check `Hide warnings`, warnings will be hidden and you'll exclusively see the errors.
es: Si marca `Ocultar advertencias`, las advertencias se ocultarán y verá exclusivamente los errores.
it: Se si seleziona `Nascondi avvertimenti`, gli avvertimenti saranno nascosti e si vedranno solo gli errori.
zh_cn: 如果选中 "隐藏警告"，警告将被隐藏，你只能看到错误。

source: **NOTE:** Remix Analysis does not flag error - it only shows warnings so if you check `Hide warnings`, nothing will show in the Remix Analysis tab.
es: **NOTA:** El Análisis Remix no marca errores - sólo muestra advertencias, por lo que si marca `Ocultar advertencias`, no se mostrará nada en la pestaña Análisis Remix.
it: **NOTA:** Analisi di Remix non segnala gli errori - mostra solo gli avvertimenti; pertanto, se si seleziona `Nascondere gli avvertimenti`, nella scheda Analisi di Remix non verrà visualizzato nulla.
zh_cn: **注意：** 混音分析不会标记错误，只会显示警告，因此如果勾选 "隐藏警告"，混音分析选项卡中将不会显示任何内容。

source: Warnings from external libraries
es: Avisos de bibliotecas externas
it: Avvertimenti da librerie esterne
zh_cn: 来自外部库的警告

source: By default, warnings from external libraries are not shown. If you check the box `Show warnings for external libraries`, the tools will also analyse the external libraries for warnings.
es: Por defecto, no se muestran las advertencias de las bibliotecas externas. Si marca la casilla `Mostrar advertencias de bibliotecas externas`, las herramientas también analizarán las bibliotecas externas en busca de advertencias.
it: Per impostazione predefinita, gli avvertimenti dalle librerie esterne non vengono mostrati. Se si seleziona la casella `Mostra avvertimenti per le librerie esterne`, gli strumenti analizzeranno anche le librerie esterne alla ricerca di avvertimenti.
zh_cn: 默认情况下，不显示来自外部库的警告。 如果选中 "显示外部库的警告 "复选框，工具也会分析外部库的警告。

source: To run [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer) with this plugin, you need to connect Remix IDE to your filesystem with [Remixd](remixd.html). Once Remixd is running, Slither is automatically loaded.
es: Para ejecutar [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer) con este plugin, necesita conectar Remix IDE a su sistema de archivos con [Remixd](remixd.html). Una vez que Remixd esté funcionando, Slither se cargará automáticamente.
it: Per eseguire [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer) con questo plugin, è necessario collegare Remix IDE al proprio filesystem con [Remixd](remixd.html). Una volta che Remixd è in esecuzione, Slither viene caricato automaticamente.
zh_cn: 要使用该插件运行 [Slither](https://github.com/crytic/slither#slither-the-solidity-source-analyzer)，需要使用 [Remixd](remixd.html)将 Remix IDE 连接到文件系统。 Remixd 运行后，Slither 会自动加载。

source: The [Solhint](https://github.com/protofire/solhint#rules) linter can be run without connecting Remix to your filesystem.
es: El linter [Solhint](https://github.com/protofire/solhint#rules) puede ejecutarse sin conectar Remix a su sistema de archivos.
it: Il linter [Solhint](https://github.com/protofire/solhint#rules) può essere eseguito senza collegare Remix al proprio filesystem.
zh_cn: [Solhint](https://github.com/protofire/solhint#rules) 内核程序无需将 Remix 连接到文件系统即可运行。

source: Remix Analysis
es: Análisis de remezclas
it: Analisi di Remix
zh_cn: 混音分析

source: Remix Analysis has 4 categories: `Security`, `Gas & Economy`, `ERC` & `Miscellaneous`.
es: Remix Analysis tiene 4 categorías: `Seguridad`, `Gas y Economía`, `ERC` y `Varios`.
it: Analisi di Remix ha 4 categorie: `Sicurezza`, `Carburante & Economia`, `ERC` e `Varie`.
zh_cn: Remix 分析有 4 个类别：安全"、"天然气与经济"、"ERC "和 "杂项"。

source: Here is the list of modules under each category along with the example code which **should be avoided or used very carefully while development**:
es: He aquí la lista de módulos de cada categoría junto con el código de ejemplo que **debe evitarse o utilizarse con mucho cuidado durante el desarrollo**:
it: Ecco l'elenco dei moduli di ciascuna categoria insieme al codice di esempio che **dovrebbe essere evitato o usato con molta attenzione durante lo sviluppo**:
zh_cn: 以下是每个类别下的模块列表，以及示例代码，在开发过程中应该避免使用或非常小心地使用：

source: Category: Security
es: Categoría: Seguridad
it: Categoria: Sicurezza
zh_cn: 类别：安全

source: **Transaction origin: 'tx.origin' is used**
es: **Origen de la transacción: se utiliza 'tx.origin'**
it: **Origine della transazione: si usa 'tx.origin'**
zh_cn: 交易来源：使用'tx.origin'

source: `tx.origin` is useful only in very exceptional cases. If you use it for authentication, you usually want to replace it by "msg.sender", because otherwise any contract you call can act on your behalf.
es: `tx.origin` sólo es útil en casos muy excepcionales. Si lo utiliza para la autenticación, normalmente querrá sustituirlo por `msg.sender`, porque de lo contrario cualquier contrato al que llame podrá actuar en su nombre.
it: `tx.origin` è utile solo in casi eccezionali. Se lo si usa per l'autenticazione, di solito lo si vuole sostituire con "msg.sender", perché altrimenti qualsiasi contratto invocato può agire per conto dell'utente.
zh_cn: tx.origin仅在非常特殊的情况下有用。如果您将其用于身份验证，通常应该将其替换为msg.sender，否则你调用的任何合约都可以代表你执行操作。

source: _Example:_
es: _Ejemplo:_
it: _Esempio:_
zh_cn: _示例：_

source: **Check effects: Potential reentrancy bugs**
es: **Comprobar efectos: Posibles fallos de reentrada**
it: **Controlla gli effetti: potenziali bug di rientranza**
zh_cn: **检查影响：潜在的可重入错误**

source: Potential Violation of Checks-Effects-Interaction pattern can lead to re-entrancy vulnerability.
es: La violación potencial del patrón Comprobaciones-Efectos-Interacción puede conducir a una vulnerabilidad de reentrada.
it: La potenziale violazione dello schema Controlli-Effetti-Interazione può portare alla vulnerabilità della rientranza.
zh_cn: Checks-Effects-Interaction 模式的潜在违反可能导致重入漏洞。

source: **Inline assembly: Inline assembly used**
es: **Montaje en línea: Montaje en línea utilizado**
it: **Assemblaggio in linea: utlizzo dell'Assemblaggio in linea**
zh_cn: **内联汇编：使用内联汇编**

source: Use of inline assembly is advised only in rare cases.
es: Se aconseja utilizar el montaje en línea sólo en casos excepcionales.
it: L'uso dell'assemblaggio in linea è consigliato solo in rari casi.
zh_cn: 仅在极少数情况下建议使用内联汇编。

source: **Block timestamp: Semantics maybe unclear**
es: **Sello de tiempo del bloque: Semántica quizá poco clara**
it: **Indicatore ora del blocco: Semantica forse non chiara**

source: `now` does not mean current time. `now` is an alias for `block.timestamp`. `block.timestamp` can be influenced by miners to a certain degree, be careful.
es: `now` no significa hora actual. `now` es un alias de `block.timestamp`. `block.timestamp` puede estar influenciado por los mineros hasta cierto punto, tenga cuidado.
it: `now` non significa ora corrente. `now` è un alias per `block.timestamp`. `block.timestamp` può essere influenzato in una certa misura dai validatori, fate attenzione.
zh_cn: `now`不表示当前时间。`now`是`block.timestamp`的别名。`block.timestamp`在一定程度上可以受到矿工的影响，请小心。

source: **Low level calls: Semantics maybe unclear**
es: **Llamadas de bajo nivel: Semántica quizá poco clara**
it: **Invocazioni di basso livello: La semantica potrebbe non essere chiara**

source: Use of low level `call`, `callcode` or `delegatecall` should be avoided whenever possible. `send` does not throw an exception when not successful, make sure you deal with the failure case accordingly. Use `transfer` whenever failure of the ether transfer should rollback the whole transaction.
es: El uso de `call`, `callcode` o `delegatecall` de bajo nivel debe evitarse siempre que sea posible. `send` no lanza una excepción cuando no tiene éxito, asegúrese de tratar el caso de fallo como corresponda. Utilice `transfer` siempre que el fallo de la transferencia de éter deba hacer retroceder toda la transacción.
it: L'uso di `call`, `callcode` o `delegatecall` di basso livello dovrebbe essere evitato quando possibile. `send` non lancia un'eccezione quando non ha successo, assicuratevi di gestire il caso di fallimento di conseguenza. Utilizzate `transfer` ogni volta che il fallimento del trasferimento di Ether deve far riavvolgere l'intera transazione.
zh_cn: 尽可能避免调用低级别的`call`、`callcode`或`delegatecall`。当`send`不成功时，不会抛出异常，请确保您相应地处理失败情况。如果想让转移的以太币在交易失败失败时回滚，请使用transfer。

source: **Blockhash usage: Semantics maybe unclear**
es: **Uso del bloqueo: Semántica quizá poco clara**
it: **Utilizzo di blockhash: La semantica potrebbe non essere chiara**
zh_cn: **区块哈希用法：语义可能不清晰**

source: `blockhash` is used to access the last 256 block hashes. A miner computes the block hash by "summing up" the information in the current block mined. By summing up the information in a clever way a miner can try to influence the outcome of a transaction in the current block.
es: `blockhash` se utiliza para acceder a los últimos 256 hashes de bloque. Un minero calcula el hash del bloque "sumando" la información del bloque actual minado. Al sumar la información de forma inteligente, un minero puede intentar influir en el resultado de una transacción en el bloque actual.
it: `blockhash` è usato per accedere agli ultimi 256 hash dei blocchi. Un validatore calcola l'hash del blocco "sommando" le informazioni del blocco correntemente processato. Sommando le informazioni in modo intelligente, un validatore può cercare di influenzare l'esito di una transazione nel blocco attuale.
zh_cn: `blockhash`用于访问最近256个区块的哈希值。矿工通过“总结”当前挖掘的区块中的信息来计算区块哈希。通过巧妙地总结区块中的信息，矿工可以尝试影响当前区块中交易的结果。

source: **Selfdestruct: Beware of caller contracts**
es: **Autodestrucción: Cuidado con los contratos de llamadas**
it: **Autodistruzione: Fai attenzione ai contratti "caller"**
zh_cn: **自毁：小心调用合约**

source: `selfdestruct` can block calling contracts unexpectedly. Be especially careful if this contract is planned to be used by other contracts (i.e. library contracts, interactions). Selfdestruction of the callee contract can leave callers in an inoperable state.
es: `selfdestruct` puede bloquear contratos de llamada inesperadamente. Tenga especial cuidado si está previsto que este contrato sea utilizado por otros contratos (por ejemplo, contratos de biblioteca, interacciones). La autodestrucción del contrato llamante puede dejar a los contratos llamantes en un estado inoperativo.
it: `selfdestruct` può bloccare inaspettatamente le invocazioni ai contratti. Fare particolare attenzione se si prevede che questo contratto sia usato da altri contratti (ad esempio, contratti di libreria, interazioni). L'autodistruzione del contratto invocante può lasciare gli invocatori in uno stato inutilizzabile.
zh_cn: `selfdestruct`可能会意外地阻止调用合约的操作。特别是当该合约计划被其他合约使用（例如库合约、交互合约）时，需要特别小心。被调合约的自毁操作可能会使其调用方处于无法操作的状态。

source: Category: Gas & Economy
es: Categoría: Gas y economía
it: Categoria: Carburante & Economia
zh_cn: 类别：gas与经济

source: **Gas costs: Too high gas requirement of functions**
es: **Costes de gas: Demasiado alto requerimiento de gas de las funciones**
it: **Costi del carburante: Requisiti di carburante delle funzioni troppo elevati**
zh_cn: **Gas费用：函数的Gas消耗过高**

source: If the gas requirement of a function is higher than the block gas limit, it cannot be executed. Please avoid loops in your functions or actions that modify large areas of storage
es: Si la necesidad de gas de una función es superior al límite de gas del bloque, no podrá ejecutarse. Por favor, evite bucles en sus funciones o acciones que modifiquen grandes áreas de almacenamiento
it: Se il fabbisogno di carburante di una funzione è superiore al limite di carburante del blocco, la funzione non può essere eseguita. Si prega di evitare i loop nelle funzioni o le azioni che modificano grandi aree di memoria
zh_cn: 如果一个函数的gas需求高于block gas limit，它就不能被执行。 请避免在修改大面积存储的函数或操作中出现循环

source: **This on local calls: Invocation of local functions via 'this'**
es: **This en llamadas locales: Invocación de funciones locales a través de 'this'**
it: **"This" nelle invocazioni locali: Invocazione di funzioni locali tramite 'this'**
zh_cn: **关于This的本地调用：通过“this”调用本地函数**

source: Never use `this` to call functions in the same contract, it only consumes more gas than normal local calls.
es: Nunca utilice `this` para llamar a funciones en el mismo contrato, sólo consume más gas que las llamadas locales normales.
it: Non usare mai `this` per invocare funzioni nello stesso contratto, perché consuma solo più carburante delle normali invocazioni locali.
zh_cn: 永远不要使用`this`调用同一个合约中的函数，这样做只会比正常调用消耗更多的gas。

source: **Delete on dynamic Array: Use require/assert appropriately**
es: **Borrar en array dinámico: Utilice require/assert adecuadamente**
it: **Cancellazione su una matrice dinamica: Usare require/assert in modo appropriato**
zh_cn: **动态数组的删除：适当使用 require/assert**

source: The `delete` operation when applied to a dynamically sized array in Solidity generates code to delete each of the elements contained. If the array is large, this operation can surpass the block gas limit and raise an OOG exception. Also nested dynamically sized objects can produce the same results.
es: La operación `delete` cuando se aplica a un array de tamaño dinámico en Solidity genera código para borrar cada uno de los elementos que contiene. Si el array es grande, esta operación puede sobrepasar el límite de gas del bloque y lanzar una excepción OOG. También los objetos anidados de tamaño dinámico pueden producir los mismos resultados.
it: L'operazione `delete`, se applicata a una matrice con dimensioni dinamiche in Solidity, genera codice per cancellare ciascuno degli elementi contenuti. Se la matrice è grande, questa operazione può superare il limite di carburante del blocco e generare un'eccezione OOG. Anche gli oggetti contenuti di dimensioni dinamiche possono produrre gli stessi risultati.
zh_cn: 在Solidity中，当对动态数组执行删除操作时，会生成代码来删除其中包含的每个元素。如果数组很大，此操作可能会超过区块的GAS限制并引发OOG异常。同样，嵌套的动态对象也可能产生相同的结果。

source: **For loop over dynamic array: Iterations depend on dynamic array's size**
es: **Bucle for sobre matriz dinámica: Las iteraciones dependen del tamaño del array dinámico**
it: **Ciclo for su una matrice dinamica: Le iterazioni dipendono dalla dimensione della matrice dinamica**
zh_cn: **For循环遍历动态数组：根据动态数组的大小进行迭代**

source: Loops that do not have a fixed number of iterations, for example, loops that depend on storage values, have to be used carefully: Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can stall the complete contract at a certain point. Additionally, using unbounded loops can incur in a lot of avoidable gas costs. Carefully test how many items at maximum you can pass to such functions to make it successful.
es: Los bucles que no tienen un número fijo de iteraciones, por ejemplo, los bucles que dependen de valores de almacenamiento, deben utilizarse con cuidado: Debido al límite de gas en bloque, las transacciones sólo pueden consumir una determinada cantidad de gas. El número de iteraciones de un bucle puede crecer más allá del límite de gas de bloque, lo que puede paralizar el contrato completo en un momento dado. Además, utilizar bucles no limitados puede acarrear muchos gastos de gas evitables. Pruebe cuidadosamente cuántos elementos como máximo puede pasar a dichas funciones para que tenga éxito.
it: I cicli che non hanno un numero fisso di iterazioni, ad esempio quelli che dipendono dai valori di memorizzazione, devono essere utilizzati con attenzione: a causa del limite di carburante del blocco, le transazioni possono consumare solo una certa quantità di carburante. Il numero di iterazioni in un ciclo può crescere oltre il limite di carburante dei blocchi, il che può bloccare il contratto completo a un certo punto. Inoltre, l'uso di cicli non limitati può comportare molti costi di carburante evitabili. Verifica attentamente il numero massimo di oggetti che potete puoi a queste funzioni per farle funzionare correttamente.
zh_cn: 没有固定迭代次数的循环，例如依赖于存储值的循环，必须谨慎使用：由于区块gas限制，交易只能消耗一定量的gas。 循环中的迭代次数可能会超过区块gas限制，这可能会在某个点停止完整的合约。 此外，使用无界循环会产生大量可避免的 gas 成本。 仔细测试您最多可以将多少项传递给此类函数以使其成功。

source: **Ether transfer in loop: Transferring Ether in a for/while/do-while loop**
es: **Transferencia de éter en un bucle: Transferencia de éter en un bucle for/while/do-while**
it: **Trasferimento di Ether in un ciclo: Trasferire Ether in un ciclo for/while/do-while**
zh_cn: **循环中转移ETH：在for/while/do-while循环中转移ETH**

source: Ether payout should not be done in a loop. Due to the block gas limit, transactions can only consume a certain amount of gas. The number of iterations in a loop can grow beyond the block gas limit which can cause the complete contract to be stalled at a certain point. If required, make sure that number of iterations are low and you trust each address involved.
es: El pago de éter no debe realizarse en bucle. Debido al límite de gas en bloque, las transacciones sólo pueden consumir una determinada cantidad de gas. El número de iteraciones en un bucle puede crecer más allá del límite de gas de bloque, lo que puede provocar que el contrato completo se paralice en un momento determinado. Si es necesario, asegúrese de que el número de iteraciones es bajo y de que confía en cada una de las direcciones implicadas.
it: Il pagamento di Ether non dovrebbe essere effettuato in un ciclo. A causa del limite di gas dei blocchi, le transazioni possono consumare solo una certa quantità di carburante. Il numero di iterazioni in un ciclo può crescere oltre il limite di carburante dei blocchi, causando lo stallo del contratto completo a un certo punto. Se necessario, assicurarsi che il numero di iterazioni sia basso e che ci si fidi di ogni indirizzo coinvolto.
zh_cn: 以太币支付不应循环进行。 由于区块gas限制，交易只能消耗一定量的gas。 循环中的迭代次数可能会超过区块gas限制，这可能导致整个合约在某个点停滞不前。 如果需要，请确保迭代次数较少并且您信任所涉及的每个地址。

source: Category: ERC
es: Categoría: ERC
it: Categoria: ERC
zh_cn: 类别：ERC

source: **ERC20: 'decimals' should be 'uint8'**
es: **ERC20: 'decimales' debería ser 'uint8'**
it: **ERC20: 'decimals' dovrebbe essere 'uint8'**
zh_cn: **ERC20：'decimals' 应该是 'uint8'类型**
