Repository: ethereum/remix-ide
Catalog: docs/locale/*/LC_MESSAGES/static_analysis.po
Languages: es, it, zh_cn

source: ERC20 Contracts `decimals` function should have `uint8` as return type.
es: La función `decimals` de ERC20 Contracts debería tener `uint8` como tipo de retorno.
it: ERC20 La funzione `decimals` dei contratti deve avere `uint8` come tipo di restituzione.
zh_cn: ERC20合约的`decimals`函数应该返回`uint8`类型。

source: Category: Miscellaneous
es: Categoría: Varios
it: Categoria: Varie
zh_cn: 类别：其它

source: **Constant/View/Pure functions: Potentially constant/view/pure functions**
es: **Funciones constantes/vistas/puras: Funciones potencialmente constantes/vistas/puras**
it: **Funzioni Constant/View/Pure: Funzioni potenzialmente constant/view/pure**
zh_cn: **Constant/View/Pure 函数：可能的Constant/View/Pure函数**

source: It warns for the methods which potentially should be constant/view/pure but are not.
es: Advierte de los métodos que potencialmente deberían ser constantes/vistos/puros pero no lo son.
it: Mette in guardia riguardo a metodi che potenzialmente dovrebbero essere constant/view/pure, ma non lo sono.
zh_cn: 它警告那些可能应该是 constant/view/pure 但不是的方法。

source: **Similar variable names: Variable names are too similar**
es: **Nombres de variables similares: Los nombres de las variables son demasiado similares**
it: **Nomi di variabili simili: I nomi delle variabili sono troppo simili**
zh_cn: **相似的变量名称：变量名称过于相似**

source: It warns on the usage of similar variable names.
es: Advierte sobre el uso de nombres de variables similares.
it: Mette in guardia sull'uso di nomi di variabili simili.
zh_cn: 它警告使用类似的变量名。

source: **No return: Function with 'returns' not returning**
es: **Sin retorno: Función con 'returns' no retorna**
it: **Nessun ritorno: Una funzione con 'returns' non restituisce nulla**
zh_cn: **没有返回：'returns'的函数没有返回**

source: It warns for the methods which define a return type but never explicitly return a value.
es: Advierte de los métodos que definen un tipo de retorno pero nunca devuelven explícitamente un valor.
it: Mette in guardia sui metodi che definiscono un tipo di ritorno, ma che non restituiscono mai esplicitamente un valore.
zh_cn: 它警告定义返回类型但从不显式返回值的方法。

source: **Guard conditions: Use 'require' and 'assert' appropriately**
es: **Guarde las condiciones: Utilice 'require' y 'assert' adecuadamente**
it: **Condizioni di guardia: Usare i termini 'require' e 'assert' in modo appropriato**
zh_cn: 守卫条件：适当使用“require”和“assert”

source: Use `assert(x)` if you never ever want x to be false, not in any circumstance (apart from a bug in your code). Use `require(x)` if x can be false, due to e.g. invalid input or a failing external component.
es: Utilice `assert(x)` si nunca jamás quiere que x sea falso, en ninguna circunstancia (aparte de un error en su código). Utilice `require(x)` si x puede ser falso, debido, por ejemplo, a una entrada no válida o a un componente externo que falle.
it: Usa assert(x) se non vuoi mai e poi mai che x sia falso, in nessuna circostanza (a parte un bug nel tuou codice). Usa require(x) se x può essere falso, ad esempio a causa di un input non valido o di un componente esterno che non funziona.
zh_cn: 如果您永远不希望x在任何情况下为false（除了你代码中的错误），请使用assert（x）。如果由于无效的输入或错误的外部组件等原因，x可能为false，请使用require（x）。

source: **Result not used: The result of an operation not used**
es: **Resultado no utilizado: El resultado de una operación no utilizada**
it: **Risultato non utilizzato: Il risultato di un'operazione non utilizzato**
zh_cn: **结果未使用：操作的结果没有被使用**

source: A binary operation yields a value that is not used in the following. This is often caused by confusing assignment (=) and comparison (==).
es: Una operación binaria produce un valor que no se utiliza en la siguiente. Esto suele deberse a la confusión entre asignación (=) y comparación (==).
it: Un'operazione binaria produce un valore che non viene utilizzato di seguito. Ciò è spesso causato dalla confusione tra assegnazione (=) e confronto (==).
zh_cn: 二元运算产生的值在下文中未使用。 这通常是由混淆的assignment (=) 和 comparison (==) 引起的。

source: **String Length: Bytes length != String length**
es: **Longitud de la cadena: Longitud de bytes != Longitud de cadena**
zh_cn: **字符串长度：字节长度 != 字符串长度**

source: Bytes and string length are not the same since strings are assumed to be UTF-8 encoded (according to the ABI definition) therefore one character is not necessarily encoded in one byte of data.
es: Los bytes y la longitud de la cadena no son lo mismo, ya que se supone que las cadenas están codificadas en UTF-8 (según la definición de la ABI), por lo que un carácter no está necesariamente codificado en un byte de datos.
it: I byte e la lunghezza delle stringhe non sono la stessa cosa, poiché si presume che le stringhe siano codificate in UTF-8 (secondo la definizione ABI), quindi un carattere non è necessariamente codificato in un byte di dati.
zh_cn: 字节和字符串长度不相同，因为字符串被采用UTF-8编码（根据ABI定义），因此一个字符不一定被编码为一个字节的数据。

source: **Delete from dynamic array: 'delete' on an array leaves a gap**
es: **Borrar de un array dinámico: 'borrar' en un array deja un hueco**
it: **Eliminazione da una matrice dinamica: 'delete' su una matrice lascia uno spazio vuoto**
zh_cn: **从动态数组中删除元素：对数组使用 'delete' 会在数组中留下一个间隙**

source: Using `delete` on an array leaves a gap. The length of the array remains the same. If you want to remove the empty position you need to shift items manually and update the length property.
es: Utilizar `delete` en un array deja un hueco. La longitud del array sigue siendo la misma. Si desea eliminar la posición vacía, deberá desplazar los elementos manualmente y actualizar la propiedad de longitud.
it: L'uso di `delete` su una matrice lascia uno spazio vuoto. La lunghezza della matrice rimane invariata. Se si vuole rimuovere la posizione vuota, è necessario spostare manualmente gli elementi e aggiornare la proprietà "lunghezza".
zh_cn: 使用 delete 对数组进行删除操作，会在数组中留下一个间隙。这时数组的长度仍然保持不变。如果想要移除这个空白的位置，需要手动将后面的元素往前移，并更新数组的长度属性。

source: **Data Truncated: Division on int/uint values truncates the result**
es: **Datos truncados: La división en valores int/uint trunca el resultado**
it: **Dati Troncati: La Divisione su valori int/uint tronca il risultato**
zh_cn: **数据截断：int/uint 值的除法会截断结果**

source: Division of integer values yields an integer value again. That means e.g. 10 / 100 = 0 instead of 0.1 since the result is an integer again. This does not hold for division of (only) literal values since those yield rational constants.
es: La división de valores enteros vuelve a dar como resultado un valor entero. Esto significa, por ejemplo, que 10 / 100 = 0 en lugar de 0,1, ya que el resultado vuelve a ser un número entero. Esto no es válido para la división de (sólo) valores literales ya que esos dan constantes racionales.
it: La divisione di valori interi produce nuovamente un valore intero. Ciò significa che, ad esempio, 10 / 100 = 0 invece di 0,1, poiché il risultato è di nuovo un intero. Questo non vale per la divisione di valori (solo) letterali, poiché questi producono costanti razionali.
zh_cn: 整数值的除法再次产生整数值。 这意味着例如 10 / 100 = 0 而不是 0.1，因为结果又是一个整数。 这不适用于(仅)文字值的除法，因为它们产生有理常数。

source: Remix-analyzer
es: Analizador de remezclas
it: Analizzatore di Remix
zh_cn: Remix-分析器

source: `remix-analyzer` is the library which works underneath the Remix Analysis tool.
es: `remix-analyzer` es la biblioteca que funciona por debajo de la herramienta Remix Analysis.
it: `remix-analyzer` è la libreria che sta alla base dello strumento di Analisi di Remix.
zh_cn: Remix-analyzer` 是在 Remix 分析工具下工作的库。

source: `remix-analyzer` is an [NPM package](https://www.npmjs.com/package/@remix-project/remix-analyzer). It can be used as a library in a solution supporting node.js. Find more information about this type of usage in the [remix-analyzer repository](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
es: `remix-analyzer` es un [paquete NPM](https://www.npmjs.com/package/@remix-project/remix-analyzer). Puede utilizarse como biblioteca en una solución que soporte node.js. Encontrará más información sobre este tipo de uso en el [repositorio remix-analyzer](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
it: `remix-analyzer` è un [pacchetto NPM](https://www.npmjs.com/package/@remix-project/remix-analyzer). Può essere usato come libreria in una soluzione che supporta node.js. Trova maggiori informazioni su questo tipo di utilizzo in [remix-analyzer repository](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)
zh_cn: `remix-analyzer`是一个[NPM包](https://www.npmjs.com/package/@remix-project/remix-analyzer)。它可在支持 node.js 的解决方案中作为库使用。想了解使用方面的更多信息请查看 [remix-analyzer repository](https://github.com/ethereum/remix-project/tree/master/libs/remix-analyzer#how-to-use)。

source: `Solidity Analyzers` can also be loaded by clicking on the `Solidity` icon in the featured plugins section of Remix's home tab. This button loads the following plugins: Solidity Compiler, Solidity Unit Testing, and Static Analyzers.
zh_cn: 可以通过在 `Remix` 主页选项卡的特色插件部分点击 `Solidity` 图标来加载 `Solidity Analyzers`。该按钮会加载以下插件：Solidity编译器、Solidity单元测试和静态分析器。

source: Solhint
zh_cn: 索尔欣特

source: **Block timestamp: Semantics may be unclear**
zh_cn: **区块时间戳：语义可能不清晰**

source: **Low level calls: Semantics may be unclear**
zh_cn: **低级调用：语义可能不清晰**
